[
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "102",
    "arabicText": "وَءَاخَرُونَ ٱعْتَرَفُوا۟ بِذُنُوبِهِمْ خَلَطُوا۟ عَمَلًۭا صَـٰلِحًۭا وَءَاخَرَ سَيِّئًا عَسَى ٱللَّهُ أَن يَتُوبَ عَلَيْهِمْ ۚ إِنَّ ٱللَّهَ غَفُورٌۭ رَّحِيمٌ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t there\t are\t others\t who\t have\t\nacknowledged\t their\t sins\t and\t mixed\t a\t\ngood\tdeed\twith\tanother\tthat\twas\tbad;\tit\tis\t\nlikely\t that\t Allah will\t accept\t their\t\nrepentance;\tindeed\tAllah is\tOft\t Forgiving,\t\nMost\tMerciful.\t",
    "romanUrduTranslationText": "Aur\t kuch\t aur\t haiñ\t jo\t apne\t gunāhoñ\t ke\t\nmuqir\t (iqrāri)\t huwe\t aur\t milāyā\t ek\t kām\t\nacha\taur\tdoosrā\tburā\tqarib\thai\tki\tAllāh\tun\t\nki\ttauba\tqabool\tkare\tbeshak\tAllāh\tbakhsh\t\nne\twālā\tmeharbān\thai"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "103",
    "arabicText": "خُذْ مِنْ أَمْوَٰلِهِمْ صَدَقَةًۭ تُطَهِّرُهُمْ وَتُزَكِّيهِم بِهَا وَصَلِّ عَلَيْهِمْ ۖ إِنَّ صَلَوٰتَكَ سَكَنٌۭ لَّهُمْ ۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ",
    "urduTranslationText": "",
    "englishTranslationText": "O\t dear\t Prophet\t(Muhammad - peace\t and\t\nblessings\tbe\tupon\thim)\ttake\tthe\tobligatory\t\ncharity\t from\t their\t wealth,\t by\t which\t you\t\nmay\t cleanse\t them\t and\t make\t them\t pure,\t\nand\tpray\tin\ttheir\tfavour;\tindeed\tyour\tprayer\tis\tthe\tcontentment\tof\ttheir\thearts;\tand\tAllah is\tAll\t\nHearing,\tAll\tKnowing.",
    "romanUrduTranslationText": "Aye\t Mehboob!\t Un\t ke\t māl\t meiñ\t se\t zakāt\t\ntehsil\t (wusool)\t karo\t jis\t se\t tum\t unheñ\t\nsuthrā\t aur\t pakiza\t kar\t do\t aur\t un\t ke\t haq\t\nmeiñ\t Du’ā-e-khair\t karo\t beshak\t tumhāri\t\ndu’ā\t un\t ke\t diloñ\t kā\t chain\t hai\t aur\t Allāh\t\nsuntā\tjāntā\thai."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "104",
    "arabicText": "أَلَمْ يَعْلَمُوٓا۟ أَنَّ ٱللَّهَ هُوَ يَقْبَلُ ٱلتَّوْبَةَ عَنْ عِبَادِهِۦ وَيَأْخُذُ ٱلصَّدَقَـٰتِ وَأَنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
    "urduTranslationText": "",
    "englishTranslationText": "Do\tthey\tnot\tknow\tthat\tAllah only\taccepts\trepentance\tof\tHis\tbondmen\tand\tHe\ttakes\tthe\tcharity\t*\t\nand\tthat\tAllah only\tis\tthe\tMost\tAcceptor\tof\tRepentance,\tthe\tMost\tMerciful?\t(* into His control.)",
    "romanUrduTranslationText": ". Kyā\tunheñ\tkhabar\tnahiñ\tke\tAllāh\thi\tapne\tbandoñ\tki\t taubā\tqabool\tkartā\taur\tsadqe\tkhud\tapne\t\nDast-e-Mubarak\tmeiñ\tleta\thai\taur\tyeh\tki\tAllāh\thi\ttaubā\tqabool\tkarne\twālā\tmeharbān\thai"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "105",
    "arabicText": "وَقُلِ ٱعْمَلُوا۟ فَسَيَرَى ٱللَّهُ عَمَلَكُمْ وَرَسُولُهُۥ وَٱلْمُؤْمِنُونَ ۖ وَسَتُرَدُّونَ إِلَىٰ عَـٰلِمِ ٱلْغَيْبِ وَٱلشَّهَـٰدَةِ فَيُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t say\t “Keep\t on\t with\t your\t works\t - Allah will\t now\t see\t your\t deeds,\t and\t so\t will\t His\t Noble\t\nMessenger\tand\tthe\tMuslims;\tand\tsoon\tyou\twill\treturn\tto\tthe\tOne\tWho\tknows\teverything\t- the\t\nhidden\tand\tthe\tvisible\t- so\tHe\twill\tinform\tyou\tof\twhat\tyou\tused\tto\tdo.”\t",
    "romanUrduTranslationText": ". Aur\t tum\t farmāo\tkām\tkaro\tab\t tumhāre\tkām\tdekhegā\tAllāh\taur\tuske\tRasool\taur\tMusalmān\taur\t\njald\tus ki\ttaraf\tpaltoge\tjo\tchupā\taur\tkhulā\tsab\tjāntā\thai\tto\twoh\ttumhāre\tkām\ttumheñ\tjatā\tdegā."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "106",
    "arabicText": "وَءَاخَرُونَ مُرْجَوْنَ لِأَمْرِ ٱللَّهِ إِمَّا يُعَذِّبُهُمْ وَإِمَّا يَتُوبُ عَلَيْهِمْ ۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t some\t are\t kept\t waiting\t for\t Allah’s\t command\t - He\t may\t punish\t them\t or\t accept\t their\t\nrepentance;\tand\tAllah is\tAll\tKnowing,\tWise.",
    "romanUrduTranslationText": "Aur\t kuch\t mauqoof\t rakhe\t gaye\t haiñ\t Allāh\t ke\t hukm\t par\t yā\t un\t par\t ‘azāb\t kare\t yā\t un\t ki\t taubā\t\nqabool\tkare\taur\tAllāh\t‘Ilm-o-Hikmat\twālā\thai."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "107",
    "arabicText": "وَٱلَّذِينَ ٱتَّخَذُوا۟ مَسْجِدًۭا ضِرَارًۭا وَكُفْرًۭا وَتَفْرِيقًۢا بَيْنَ ٱلْمُؤْمِنِينَ وَإِرْصَادًۭا لِّمَنْ حَارَبَ ٱللَّهَ وَرَسُولَهُۥ مِن قَبْلُ ۚ وَلَيَحْلِفُنَّ إِنْ أَرَدْنَآ إِلَّا ٱلْحُسْنَىٰ ۖ وَٱللَّهُ يَشْهَدُ إِنَّهُمْ لَكَـٰذِبُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tthose\t(hypocrites)\twho\tbuilt\ta\tmasjid\nto\tcause\tharm,\tand\tdue\tto\tdisbelief,\tand\tin\t\norder\t to\t cause\t divisions\t among\t the\t\nMuslims,\t and\t to\t await\t the\t one\t who\t is\t at\t\nthe\t outset\t an\t opponent\t of\t Allah and\t His\t\nNoble\t Messenger;\t and\t they\t will\t surely\t\nswear\t that\t “We\t wished\t only\t good”;\t and\t\nAllah is\twitness\tthat\tthey\tare\tindeed\tliars.",
    "romanUrduTranslationText": "Aur\t woh\t jinhoñ\t ne\t Masjid\t banāi\t nuqsān\t\npahuñchā\t ne\t ko\t aur\t kufr\t ke\t sabab\t aur\t\nMusalmānoñ\tmeiñ\ttifarqā\tdālne\tko\taur\tus\t\nke\tintiżār\tmeiñ\tjo\tpehle\tse\tAllāh\taur\tuske\t\nRasool\t kā\t mukhālif\t hai\t aur\t woh\t zaroor\t\nqasmeñ\t khāyeñ\t ge\t ki\t hamne\t to\t bhalāi\t hi\t\nchāhi\taur\tAllāh\tgawāh\thai\tki\twoh\tbeshak\t\t\njhoote\thaiñ."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "108",
    "arabicText": "لَا تَقُمْ فِيهِ أَبَدًۭا ۚ لَّمَسْجِدٌ أُسِّسَ عَلَى ٱلتَّقْوَىٰ مِنْ أَوَّلِ يَوْمٍ أَحَقُّ أَن تَقُومَ فِيهِ ۚ فِيهِ رِجَالٌۭ يُحِبُّونَ أَن يَتَطَهَّرُوا۟ ۚ وَٱللَّهُ يُحِبُّ ٱلْمُطَّهِّرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Never\tstand\t(for\tworship)\tin\tthat\tmasjid *;\t\nindeed\t the\t masjid **\t that\t has\t been\t\nfounded\t on\t piety\t from\t the\t very\t first\t day\t\ndeserves\t that\tyou\tshould\tstand\tin\tit;\tin\tit\t\nare\t the\t people\t who\t wish\t to\t thoroughly\t\ncleanse\t themselves;\t and\t Allah loves\t the\t\nclean.\t(*The\tmasjid built\tby\tthe\thypocrites.\t\n**\t The\t masjid at\t Quba,\t built\t by\t the\t Holy\t\nProphet\t and\t his\t companions.\t The\tmerit\t of\t\npraying\t2\tRaka’\tNawafil\tin\tit\tis\tequal\tto\tthe\t\nreward\tof\tan\tUmrah.)\t",
    "romanUrduTranslationText": "Us\tmasjid\tmeiñ\ttum\tkabhi\tkhade\tna\thonā\t\nbeshak\twoh\tMasjid\tke\tpehle\thi\tdin\tse\tjis\tki\t\nbunyād\t parhezgāri\t par\t rakhi\tgai\t hai\twoh\t\nis\t qābil\t hai\t ke\t tum\t us\t meiñ\t khade ho\t us\t\nmeiñ\twoh\tlog\t haiñ\t ki\tkhoob\t suthrā\t honā\t\nchāhte\t haiñ\t aur\t suthre\t Allāh\t ko\t piyāre\t\nhaiñ"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "109",
    "arabicText": "أَفَمَنْ أَسَّسَ بُنْيَـٰنَهُۥ عَلَىٰ تَقْوَىٰ مِنَ ٱللَّهِ وَرِضْوَٰنٍ خَيْرٌ أَم مَّنْ أَسَّسَ بُنْيَـٰنَهُۥ عَلَىٰ شَفَا جُرُفٍ هَارٍۢ فَٱنْهَارَ بِهِۦ فِى نَارِ جَهَنَّمَ ۗ وَٱللَّهُ لَا يَهْدِى ٱلْقَوْمَ ٱلظَّـٰلِمِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "So\tis\t one\twho\t established\t his\t foundation\t\nupon\t the\t fear\t of\t Allah and\t upon\t His\t\npleasure\t better,\t or\t the\t one\t who\t laid\t his\t\nfoundation\t upon\t the\t brink\t of\t a\t falling\t\nprecipice,\tso\tit\tfell\talong\twith\thim\tinto\tthe\t\nfire\tof\thell?\tAnd\tAllah does\tnot\tguide\t the\t\nunjust.",
    "romanUrduTranslationText": ". To\t kyā\t jis\t ne\t apni\t bunyād\t rakhi\t Allāh\t se\t\ndar\t aur\t us\t ki\t riza\t par\twoh\t bhalā\t ya\twoh\t\njis\t ne\t apni\t niw\t chuni\t (bunyād\t rakhi)\t ek\t\ngirāoo\t ghade\t ke\t kināre\t to\t woh\t use\t lekar\t\njahannam\tki\tāag\tmeiñ\tdeh\tpadā\taur\tAllāh\tżalimoñ\tko\trāh\tnahiñ\tdetā"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "110",
    "arabicText": "لَا يَزَالُ بُنْيَـٰنُهُمُ ٱلَّذِى بَنَوْا۟ رِيبَةًۭ فِى قُلُوبِهِمْ إِلَّآ أَن تَقَطَّعَ قُلُوبُهُمْ ۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌ",
    "urduTranslationText": "",
    "englishTranslationText": ". The\t building\t which\t they\t erected\t will\t\nconstantly\tkeep\tdisturbing\t their\thearts\tunless\t their\thearts\tare\t torn\t to\tpieces;\tand\tAllah is\tAll\t\nKnowing,\tWise.\t",
    "romanUrduTranslationText": "Woh\tt’amir\tjo\tchuni\thamesha\tun\tke\tdiloñ\tmeiñ\tkhatakti\trahegi\tmagar\tyeh\tki\tun\tke\tdil\tke\ttukde\u0002tukde\tho\tjāyeñ\taur\tAllāh\tIlm-o-Hikmat\twālā\thai"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "111",
    "arabicText": "۞ إِنَّ ٱللَّهَ ٱشْتَرَىٰ مِنَ ٱلْمُؤْمِنِينَ أَنفُسَهُمْ وَأَمْوَٰلَهُم بِأَنَّ لَهُمُ ٱلْجَنَّةَ ۚ يُقَـٰتِلُونَ فِى سَبِيلِ ٱللَّهِ فَيَقْتُلُونَ وَيُقْتَلُونَ ۖ وَعْدًا عَلَيْهِ حَقًّۭا فِى ٱلتَّوْرَىٰةِ وَٱلْإِنجِيلِ وَٱلْقُرْءَانِ ۚ وَمَنْ أَوْفَىٰ بِعَهْدِهِۦ مِنَ ٱللَّهِ ۚ فَٱسْتَبْشِرُوا۟ بِبَيْعِكُمُ ٱلَّذِى بَايَعْتُم بِهِۦ ۚ وَذَٰلِكَ هُوَ ٱلْفَوْزُ ٱلْعَظِيمُ",
    "urduTranslationText": "",
    "englishTranslationText": "Indeed\t Allah has\t purchased\t from\t the\t Muslims\t their\t lives\t and\t their\t wealth\t in\t exchange\t of\t\nParadise\tfor\tthem;\tfighting\tin\tAllah's\tcause,\tslaying\tand\tbeing\tslain;\ta\ttrue\tpromise\tincumbent\t\nupon\t His\t mercy,\t (mentioned)\t in\t the\t Taurat\t and\t the\t Injeel\t and\t the\t Qur’an;\t who\t fulfils\t His\t\npromise\tbetter\tthan\tAllah?\tTherefore\trejoice\tupon\tyour\tdeal\tthat\tyou\thave\tmade\twith\tHim;\tand\t\nthis\tis\tthe\tgreat\tsuccess.\t",
    "romanUrduTranslationText": "Beshak\tAllāh\tne\tMusalmānoñ\tse\tun\tke\tmāl\taur\tjān\tkhareed liye\thaiñ\tis\tbadle\tpar\tke\tun\tke\tliye\t\njannat\thai\tAllāh\tki\trāh\tmeiñ\tladeñ\tto\tmāreñ\taur\tmareñ\tus\tke\tzimma-e-karam\tpar\tsacha\tw’adah\t\ntauret\taur\tinjil\taur\tqurān\tmeiñ\taur\tAllāh\tse\tziyada\tqaul\tkā\tpoorā\tkaun\tto\tkhushiyāñ\tmanāo\tapne\t\nsaude\tki\tjo\ttum\tne\tus\tse\tkiyā\thai\taur\tyahi\tbadi\tkāmyābi\thai.\t"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "112",
    "arabicText": "ٱلتَّـٰٓئِبُونَ ٱلْعَـٰبِدُونَ ٱلْحَـٰمِدُونَ ٱلسَّـٰٓئِحُونَ ٱلرَّٰكِعُونَ ٱلسَّـٰجِدُونَ ٱلْـَٔامِرُونَ بِٱلْمَعْرُوفِ وَٱلنَّاهُونَ عَنِ ٱلْمُنكَرِ وَٱلْحَـٰفِظُونَ لِحُدُودِ ٱللَّهِ ۗ وَبَشِّرِ ٱلْمُؤْمِنِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Those\t who\t repent,\t those\t who\t worship,\t\nthose\t who\t praise,\t those\t who\t fast,\t those\t\nwho\tbow,\tthose\twho\tprostrate,\tthose\twho\t\nshow\t right\t and\t forbid\t wrong\t and\t those\t\nwho\tkeep\t the\tlimits\tof\tAllah in\tsight;\tand\t\ngive\tglad\ttidings\tto\tthe\tMuslims.\t",
    "romanUrduTranslationText": "Taubā\t wale\t Ibādat\t wale\t sarāhne\t wāle\t\nRoze\twāle\truku’\twāle\tsajde\twāle\tbhalai\tke\t\nbatāne\twāle\tburāi\tse\trokne\twāle\taur\tAllāh\t\nki\t hadeñ\t nigāh\t rakhne\t wāle\t aur\t khushi\t\nsunāo\tMusalmānoñ\tko"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "113",
    "arabicText": "مَا كَانَ لِلنَّبِىِّ وَٱلَّذِينَ ءَامَنُوٓا۟ أَن يَسْتَغْفِرُوا۟ لِلْمُشْرِكِينَ وَلَوْ كَانُوٓا۟ أُو۟لِى قُرْبَىٰ مِنۢ بَعْدِ مَا تَبَيَّنَ لَهُمْ أَنَّهُمْ أَصْحَـٰبُ ٱلْجَحِيمِ",
    "urduTranslationText": "",
    "englishTranslationText": ". It\t does\t not\t befit\t the\t Prophet\t and\t those\t\nwho\tbelieve,\tto\tpray\tfor\tthe\tforgiveness\tof\t\npolytheists\t even\t if\t they\t may\t be\t their\t\nrelatives,\tafter\tit\thas\tbecome\tclear\tto\tthem\t\nthat\tthey\tare\tthe\tpeople\tof\thell.\t\t",
    "romanUrduTranslationText": "Nabi\t aur\t Imān\t wāloñ\t ko\t lāiq\t nahi\t ki\t\nmushrikoñ\t ki\t bakhshish\t chāheiñ\t agarche\t\nwoh\t rishte\t dār\t hoñ\t jab\t ke\t unheñ\t khul\t\nchuke\tke\twoh\tdozakhi\thaiñ"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "114",
    "arabicText": "وَمَا كَانَ ٱسْتِغْفَارُ إِبْرَٰهِيمَ لِأَبِيهِ إِلَّا عَن مَّوْعِدَةٍۢ وَعَدَهَآ إِيَّاهُ فَلَمَّا تَبَيَّنَ لَهُۥٓ أَنَّهُۥ عَدُوٌّۭ لِّلَّهِ تَبَرَّأَ مِنْهُ ۚ إِنَّ إِبْرَٰهِيمَ لَأَوَّٰهٌ حَلِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t the\t seeking\t of\t forgiveness\t for\t his\t\nfather\t (paternal\t uncle)\t by\t Ibrahim\t was\t\nonly\tbecause\tof\ta\tpromise\the\thad\tmade\tto\t\nhim;\t then\t when\t it\t became\t clear\t to\t him\t\nthat\t he\t was\t an\t enemy\t of\t Allah,\t Ibrahim\t\nbroke\toff\tties\twith\thim;\tindeed\tIbrahim\tis\t\nsurely\tvery\tsoft-hearted,\tmost\tforbearing.\t",
    "romanUrduTranslationText": ". Aur\t Ibrāheem ka\t apne\t bāp\t ki\t bakhshish\t\nchāhna\twoh\t to\tna\t thā\tmagar\tek\tw’ade\tke\t\nsabab\t jo\t in\t se\t kar\t chuka\t thā\t phir\t jab\t\nIbrāheem\t ko\t khul\t gaya\t ki\t woh\t Allāh\t ka\t\ndushman\t hai\t us\t se\t tinka\t tod\t diyā\t (lā\t\nťalluq\t ho\t gayā)\t beshak\t Ibrāheem zarur\t\nāheñ\tkarne\twālā\tmutahammil\thai"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "115",
    "arabicText": "وَمَا كَانَ ٱللَّهُ لِيُضِلَّ قَوْمًۢا بَعْدَ إِذْ هَدَىٰهُمْ حَتَّىٰ يُبَيِّنَ لَهُم مَّا يَتَّقُونَ ۚ إِنَّ ٱللَّهَ بِكُلِّ شَىْءٍ عَلِيمٌ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t it\t does\t not\t befit\t Allah’s\t Majesty\t to\t\nsend\t a\t nation\t astray\t after\t He\t has\t guided\t\nthem\t until\t He\t has\t made\t clear\t to\t them\t\nwhat\t they\t should\t avoid;\t indeed\t Allah\nknows\teverything.\t",
    "romanUrduTranslationText": "Aur\tAllāh\tki\tshān\tnahi\tke\tkisi\tqaum\tko\thidāyat\tkarke\tgumrāh\tfarmāye\tjab\ttak\tunheiñ\tsāf\tna\tbatā\t\nde\tke\tkis\tchiz\tse\tunheiñ\tbachnā\tchahiye\tbeshak\tAllāh\tsab\tkuch\tjāntā\thai"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "116",
    "arabicText": "إِنَّ ٱللَّهَ لَهُۥ مُلْكُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۖ يُحْىِۦ وَيُمِيتُ ۚ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِن وَلِىٍّۢ وَلَا نَصِيرٍۢ",
    "urduTranslationText": "",
    "englishTranslationText": "Indeed\t for\tAllah only\tis\t the\tkingship\tof\t the\theavens\tand\t the\tearth;\tHe\tgives\tlife\tand\tHe\tgives\t\ndeath;\tand\tother\tthan\tAllah,\tyou\thave\tneither\ta\tProtector\tnor\tany\tSupporter.\t\t",
    "romanUrduTranslationText": "Beshak\tAllāh\thi\tke\tliye\thai\tāasmānoñ\taur\tzameen\tki\tsaltanat\tjilātā\taur\tmārtā\thai\taur\tAllāh\tke\t\nsiwā\tna\ttumhārā\tkoi\twāli\tna\tmadadgār"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "117",
    "arabicText": "لَّقَد تَّابَ ٱللَّهُ عَلَى ٱلنَّبِىِّ وَٱلْمُهَـٰجِرِينَ وَٱلْأَنصَارِ ٱلَّذِينَ ٱتَّبَعُوهُ فِى سَاعَةِ ٱلْعُسْرَةِ مِنۢ بَعْدِ مَا كَادَ يَزِيغُ قُلُوبُ فَرِيقٍۢ مِّنْهُمْ ثُمَّ تَابَ عَلَيْهِمْ ۚ إِنَّهُۥ بِهِمْ رَءُوفٌۭ رَّحِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "Indeed\t Allah’s\t mercy\t inclined\t towards\t the\t Herald\t of\t the\t Hidden,\t and\t the\t Muhajirs\t and\t the\t\nAnsar\twho\tstood\tby\thim\tin\t the\t time\tof\thardship,\tafter\tit\twas\tlikely\t that\t the\thearts\tof\ta\tgroup\t\namong\tthem\twould\tturn\taway\t- He\tthen\tinclined\ttowards\tthem\twith\tmercy;\tindeed\tHe\tis\tMost\t\nCompassionate,\tMost\tMerciful\tupon\tthem.\t\t",
    "romanUrduTranslationText": "Beshak\tAllāh\tki\tRahmateiñ\tmutawajjeh\thuwiñ\tun\tghaib\tki\tkhabreiñ\tbatāne\twāle\t(Nabi)\taur\tun\t\nmuhājirin\taur\tansār\tpar\tjinhoñ\tne\tmushkil\tki\tghari\tmeiñ\tunka\tsāth\tdiya\tbad\tus\tke\tki\tqarib\tthā\tki\t\nun\tmeiñ\tkuch\tlogoñ\tke\tdil\tphir\tjāyeiñ\tphir\tun\tpar\trahmat\tse\tmutawajjeh\thuwa\thai\tbeshak\twoh\t\nun\tpar\tnihāyat\tmeharbān\traham\twālā\thai."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "118",
    "arabicText": "وَعَلَى ٱلثَّلَـٰثَةِ ٱلَّذِينَ خُلِّفُوا۟ حَتَّىٰٓ إِذَا ضَاقَتْ عَلَيْهِمُ ٱلْأَرْضُ بِمَا رَحُبَتْ وَضَاقَتْ عَلَيْهِمْ أَنفُسُهُمْ وَظَنُّوٓا۟ أَن لَّا مَلْجَأَ مِنَ ٱللَّهِ إِلَّآ إِلَيْهِ ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوٓا۟ ۚ إِنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
    "urduTranslationText": "",
    "englishTranslationText": "And\talso\tupon\tthe\tthree\twho\twere\tkept\tin\t\nwaiting;\twhen\t the\tearth,\tvast\tas\tit\tis,\twas\t\nrestricted\t for\t them,\t and\t they\t became\t\nweary\t of\t their\t own\t lives\t and\t became\t\ncertain\t that\t there\tis\tno\trefuge\t from\tAllah\nexcept\t with\t Him;\t He\t then\t accepted\t their\t\nrepentance in\t order\t that\t they\t remain\t\nrepentant;\t indeed\t Allah is\t the\t Most\t\nAcceptor\t of\t Repentance,\t the\t Most\t\nMerciful.\t\t",
    "romanUrduTranslationText": ". Aur\t un\t teen\t par\t jo\t mauqoof\t rakhe\t gaye\t\nthe\t yahañ\t tak\t ke\t jab\t zameen\t itni\t wase’e\t\nho\t kar un\t par\t tang\t ho\tgayi\taur\twoh\tapni\t\njān\tse\ttang\tāaye\taur\tunheiñ\tyaqeen\thua\tke\t\nAllāh\t se\t panāh\t nahiñ\t magar\t usi\t ke\t pās\t\nphir\tun\tki\t tauba\tqabool\tki, ke\t tāib\traheiñ\t\nbeshak\tAllāh\t hi\t taubā\t qubool\t karne\twālā\t\nmeharbān\thai."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "119",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱتَّقُوا۟ ٱللَّهَ وَكُونُوا۟ مَعَ ٱلصَّـٰدِقِينَ",
    "urduTranslationText": "",
    "englishTranslationText": ". O\tPeople\twho\tBelieve!\tFear\tAllah,\tand\tbe\t\nwith\tthe\ttruthful.\t\t",
    "romanUrduTranslationText": "Aye\t Imān\t wālo!\t Allāh\t se\t daro\t aur\t\nsachchoñ\tke\tsath\tho."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "120",
    "arabicText": "مَا كَانَ لِأَهْلِ ٱلْمَدِينَةِ وَمَنْ حَوْلَهُم مِّنَ ٱلْأَعْرَابِ أَن يَتَخَلَّفُوا۟ عَن رَّسُولِ ٱللَّهِ وَلَا يَرْغَبُوا۟ بِأَنفُسِهِمْ عَن نَّفْسِهِۦ ۚ ذَٰلِكَ بِأَنَّهُمْ لَا يُصِيبُهُمْ ظَمَأٌۭ وَلَا نَصَبٌۭ وَلَا مَخْمَصَةٌۭ فِى سَبِيلِ ٱللَّهِ وَلَا يَطَـُٔونَ مَوْطِئًۭا يَغِيظُ ٱلْكُفَّارَ وَلَا يَنَالُونَ مِنْ عَدُوٍّۢ نَّيْلًا إِلَّا كُتِبَ لَهُم بِهِۦ عَمَلٌۭ صَـٰلِحٌ ۚ إِنَّ ٱللَّهَ لَا يُضِيعُ أَجْرَ ٱلْمُحْسِنِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "It\tdid\tnot\tbefit\tthe\tpeople\tof\tMedinah\tand\t\nthe\tpeople\tof\tthe\tvillages\taround\tthem,\tto\t\nstay\tbehind\tthe\tNoble\tMessenger\tof\tAllah,\t\nnor\t to\t consider\t their\t own\t lives\t dearer\t\nthan\t his\tlife;\t that\tis\t because\t the\t thirst\t or\t\nthe\tpain\tor\tthe\thunger\tthat\tafflicts\tthem\tin\t\nAllah's\tcause,\tand\tthe\tstep\tthey\ttread\ton\ta\t\nplace\t that\t angers\t the\t disbelievers,\t and\t\nwhatever harm\t they\t cause\t the\tenemy\t- a\t\ngood\tdeed\tis\trecorded\t for\t them\tin\tlieu\tof\t\nall\t of\t these;\t indeed\tAllah does\t not\t waste\t\nthe\twages\tof\tthe\tvirtuous.\t",
    "romanUrduTranslationText": "Madine wāloñ\taur\tun\tke\tgird\tdehāt\twāloñ\t\nko\t lāiq\t na\t thā\t ke\t Rasool-Ullāh se\t piche\t\nbaith\t raheiñ\t aur\t na\t yeh\t ki\t un\t ki\t jān\t se\t\napni\t jān\t piyāri\t samjheiñ\t yeh\t isliye\t ki\t\nunheiñ\tjo\tpiyās\tya\ttaklif\tya\tbhook\tAllāh\tki\t\nrāh\t meiñ\t pahuñchti\t hai\t aur\t jahān\t aeysi\t\njagah\tqadam\trakhte\thaiñ\tjis\tse\tkāfiroñ\tko\t\nghaiz\t(ghussa)\tāye\taur\tjo\tkuch\tkisi\tdushman\tka\tbigādte\thaiñ\tis\tsab\tke\tbadle\tun\tke\tliye\tnek\támal\t\nlikha\tjāta\thai\tbeshak\tAllāh\tnekoñ\tka\tneg\t(ajar-o-inaām)\tzā’i\tnahi\tkarta"
  }
]