[
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "66",
    "arabicText": "لَا تَعْتَذِرُوا۟ قَدْ كَفَرْتُم بَعْدَ إِيمَـٰنِكُمْ ۚ إِن نَّعْفُ عَن طَآئِفَةٍۢ مِّنكُمْ نُعَذِّبْ طَآئِفَةًۢ بِأَنَّهُمْ كَانُوا۟ مُجْرِمِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "“Do\t not\t feign\t excuses,\t you\t have\t turned\t\ndisbelievers\t after\t becoming\t Muslims”;\t if\t\nWe\tforgive\tsome\tof\tyou\t*,\tWe\tshall\tpunish\t\nothers\t because\t they\t were\t guilty.\t\n(*\tOne\twho\tkept\tquiet\tand\tlater\trepented.)\t",
    "romanUrduTranslationText": "Bahāne\t na\t banāo\t tum\t kāfir\t ho\t chuke\t Musalman\t hokar\t agar\t hum\t tum\t meiñ\t se\t kisi\t ko\t mu'āf\t\nkareiñ\t\tto\tauroñ\tko\t‘aƶāb\tdeñge\tis\tliye\tke\twoh\tmujrim\tthey."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "67",
    "arabicText": "ٱلْمُنَـٰفِقُونَ وَٱلْمُنَـٰفِقَـٰتُ بَعْضُهُم مِّنۢ بَعْضٍۢ ۚ يَأْمُرُونَ بِٱلْمُنكَرِ وَيَنْهَوْنَ عَنِ ٱلْمَعْرُوفِ وَيَقْبِضُونَ أَيْدِيَهُمْ ۚ نَسُوا۟ ٱللَّهَ فَنَسِيَهُمْ ۗ إِنَّ ٱلْمُنَـٰفِقِينَ هُمُ ٱلْفَـٰسِقُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "The\t hypocrite\t men\t and\t women\t are\t all\t the\t same;\t enjoining\t wrong\t and\t forbidding\t right,\t and\t\nbeing\t tight-fisted\t *;\t they\t have\t forgotten\t Allah,\t so\t Allah has\t forsaken\t them;\t indeed\t the\t\nhypocrites\t- it\tis\tthey\twho\tare\treally\tdisobedient.\t(*\tNot\tspending\tin\tAllah's\tcause)\t\t",
    "romanUrduTranslationText": "Munafiq\tmard\taur\tmunafiq\taurteiñ\tek\tthaili\tke\tchatte\tbatte\t(ek\tjaise)\thaiñ\tburāyi\tka\tḥukm\tdeñ\t\naur\t bhalāyi\t se\tman’a\t kareiñ aur\tapni\tmuth-thi\t band\t rakheiñ\t (kharch\t na\t kareñ)\twoh\tAllah\t ko\t\nchhord\t baithe\t to\t Allah\t ne\t unheiñ\t chhord\t diya\t be-shak\t munafiq\t wohi\t pakke\t be-ḥukm\t (Na\t\nfarmān)\thaiñ."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "68",
    "arabicText": "وَعَدَ ٱللَّهُ ٱلْمُنَـٰفِقِينَ وَٱلْمُنَـٰفِقَـٰتِ وَٱلْكُفَّارَ نَارَ جَهَنَّمَ خَـٰلِدِينَ فِيهَا ۚ هِىَ حَسْبُهُمْ ۚ وَلَعَنَهُمُ ٱللَّهُ ۖ وَلَهُمْ عَذَابٌۭ مُّقِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "Allah has\t promised\t the\t hypocrite\tmen\tand\t hypocrite\twomen\tand\t the\t disbelievers,\t the\t fire\t of\t\nhell\t in\t which\t they\t will\t remain\t forever;\t that\t is\t sufficient\t for\t them;\t and\tAllah’s\t curse\t is\t upon\t\nthem;\tand\tfor\tthem\tis\ta\tnever\tending\tpunishment.\t",
    "romanUrduTranslationText": "Allah\tne\tmunafiq\tmardoñ\taur\tmunafiq\taurtoñ\taur\tkāfiroñ\tko\tjahannam\tki\tāag\tka\tw’ada\t\tdiya\thai\t\njis\tmeiñ\thamesha\traheñge\twoh\tunheiñ\tbus\t(kafi)\thai\taur\tAllah\tki\tun\tpar\tl’anat\thai\taur\tunke\tliye\t\nqāim\trehne\twāla\t‘aƶāb\thai"
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "69",
    "arabicText": "كَٱلَّذِينَ مِن قَبْلِكُمْ كَانُوٓا۟ أَشَدَّ مِنكُمْ قُوَّةًۭ وَأَكْثَرَ أَمْوَٰلًۭا وَأَوْلَـٰدًۭا فَٱسْتَمْتَعُوا۟ بِخَلَـٰقِهِمْ فَٱسْتَمْتَعْتُم بِخَلَـٰقِكُمْ كَمَا ٱسْتَمْتَعَ ٱلَّذِينَ مِن قَبْلِكُم بِخَلَـٰقِهِمْ وَخُضْتُمْ كَٱلَّذِى خَاضُوٓا۟ ۚ أُو۟لَـٰٓئِكَ حَبِطَتْ أَعْمَـٰلُهُمْ فِى ٱلدُّنْيَا وَٱلْـَٔاخِرَةِ ۖ وَأُو۟لَـٰٓئِكَ هُمُ ٱلْخَـٰسِرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Like\t those\t who\t were\t before\t you\t - they\t\nwere\t mightier\t than\t you\t in\t strength,\t and\t\nhad\t more\t wealth\t and\t children\t than\t you;\t\nso\t they\t spent\t their\t portion\t - you\t spent\t\nyour\t portion\t just\t as\t those\t before\t you\t\nspent\t their\t portion\t and\t you\t fell\t into\t\nshame\t (sin)\t like\t they\t had\t fallen\t into\t\nshame;\t their\t deeds\t have\t been\t wasted\t in\t\nthe\tworld\tand\tin\t the\tHereafter;\tit\tis\t they\t\nwho\tare\tthe\tlosers.\t",
    "romanUrduTranslationText": "Jaise\twoh\tjo\ttum\tse\tpehle\tthey\ttum\tse\tzor\t\nmeiñ\t badh\t kar\t they\t aur\t unke\t māl\t aur\t\naulād\t tum\t se\t ziyada\t to\t woh\t apna\t hissa\t\nbarat\t (faida\t utha)\t gaye\t to\t tum\t ne\t apna\t\nhissa\t barta\t jaise\t agle\t apna\t hissa\t barat\t\ngaye\t aur\t tum\t be-hoodgi\t meiñ\t pade\t jaise\t\nwoh\t pade\t they\t unke\t ‘amal\t akārat\t (zāye)\t\ngaye\t duniya\t aur\t āakhirat\t meiñ\t aur\t wohi\t\nlog\tghāte\tmeiñ\thaiñ."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "70",
    "arabicText": "أَلَمْ يَأْتِهِمْ نَبَأُ ٱلَّذِينَ مِن قَبْلِهِمْ قَوْمِ نُوحٍۢ وَعَادٍۢ وَثَمُودَ وَقَوْمِ إِبْرَٰهِيمَ وَأَصْحَـٰبِ مَدْيَنَ وَٱلْمُؤْتَفِكَـٰتِ ۚ أَتَتْهُمْ رُسُلُهُم بِٱلْبَيِّنَـٰتِ ۖ فَمَا كَانَ ٱللَّهُ لِيَظْلِمَهُمْ وَلَـٰكِن كَانُوٓا۟ أَنفُسَهُمْ يَظْلِمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Did\t not\t the\t news\t of\t those\t before\t them\t\nreach\t them\t- the\tpeople\tof\tNooh,\tand\t the\t\nA’ad,\t and\t the\t Thamud\t - the\t people\t of\t\nIbrahim,\t the\t people\t of Madyan\t and\t the\t\ndwellings\t that\t were\t overturned?\t Their\t\nNoble\t Messengers\t had\t brought\t clear\t\nproofs\t to\t them;\t so\tit\t did\t not\t befit\tAllah’s\t\nMajesty\t to\toppress\t them,\tbut\tin\t fact\t they\t\nwronged\tthemselves.\t\t",
    "romanUrduTranslationText": "Kya\t unheiñ\t apne\t se\t agloñ\t ki\t khabar\t na\t\nāayi\t Nooh ki\t qaum\t aur\t Āad aur\t Samood\naur\t Ibraheem ki\t qaum\t aur\t Madyan\t wāle\t\naur\t woh\t bastiyāñ\t ke\t ulat\t di\t gayiñ\t unke:\t\nRasool\t Raushan\t Daleeleiñ\t unke\t pās\t lāye\t\nthey\tto\tAllah\tki\tshān\tna\tthi\tke\tun\tpar\tzulm\t\nkarta\t balke\t woh\t khud\t hi\t apni\t jānoñ\t par\t\nzālim\tthey"
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "71",
    "arabicText": "وَٱلْمُؤْمِنُونَ وَٱلْمُؤْمِنَـٰتُ بَعْضُهُمْ أَوْلِيَآءُ بَعْضٍۢ ۚ يَأْمُرُونَ بِٱلْمَعْرُوفِ وَيَنْهَوْنَ عَنِ ٱلْمُنكَرِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤْتُونَ ٱلزَّكَوٰةَ وَيُطِيعُونَ ٱللَّهَ وَرَسُولَهُۥٓ ۚ أُو۟لَـٰٓئِكَ سَيَرْحَمُهُمُ ٱللَّهُ ۗ إِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t the\tMuslim\tmen\tand\tMuslim\twomen\t\nare\t the\t friends\t of\t one\t another;\t enjoining\t\nright\t and\t forbidding\t wrong,\t and\t keeping\t\nthe\t prayer\t established\t and\t paying\t the\t\nobligatory\t charity,\t obeying\tAllah and\tHis\t\nNoble\t Messenger;\t these\t are\t upon\t whom\t\nAllah will\t soon\t have\tmercy;\tindeed\tAllah\nis\tthe\tAlmighty,\tthe\tWise.\t\t\t",
    "romanUrduTranslationText": "Aur\tMusalman\tmard\taur\tMusalman\taurteiñ\tek\tdoosre\tke\trafeeq\thaiñ\tbhalāyi\tka\tḥukm deñ\taur\t\nburāyi\t se\t man’a\t kareiñ aur\tNamāz\t qāim\t rakheiñ\t aur\t Zakāt\t deñ\t aur\t Allah-o-Rasool\t ka\t ḥukm\t\t\nmāneiñ\tyeh\thaiñ\tjin\tpar\t‘an-qareeb\tAllah\trahem\tkarega\tbe-shak\t\tAllah\tghalib\thikmat\twāla\thai."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "72",
    "arabicText": "وَعَدَ ٱللَّهُ ٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَـٰتِ جَنَّـٰتٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا وَمَسَـٰكِنَ طَيِّبَةًۭ فِى جَنَّـٰتِ عَدْنٍۢ ۚ وَرِضْوَٰنٌۭ مِّنَ ٱللَّهِ أَكْبَرُ ۚ ذَٰلِكَ هُوَ ٱلْفَوْزُ ٱلْعَظِيمُ",
    "urduTranslationText": "",
    "englishTranslationText": "Allah has\tpromised\tthe\tMuslim\tmen\tand\tMuslim\twomen,\tGardens\tbeneath\twhich\trivers\tflow\t-\nthey\twill\tabide\tin\tit\tforever\t- and\tpure\tdwellings\tin\tGardens\tof\teverlasting\tstay;\tand\tthe\tgreatest\t\n(reward)\tis\tAllah’s\tpleasure;\tthis\tis\tthe\tsupreme\tsuccess.\t",
    "romanUrduTranslationText": ". Allah\t ne\tMusalman\tmardoñ\t aur\tMusalman\t aurtoñ\t ko\t bāghoñ\t ka\t w’āda diya\t hai\tjinke\t neeche\t\nnehreiñ\t\trawāñ\tun\tmeiñ\thamesha\traheñge\taur\tpakeeza\tmakānoñ\tka\tbasne\tke\tbāghoñ\tmeiñ\taur\t\nAllah\tki\traza\tsab\tse\tbadi\tyehi\thai\tbadi\tmurād\tpāni."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "73",
    "arabicText": "يَـٰٓأَيُّهَا ٱلنَّبِىُّ جَـٰهِدِ ٱلْكُفَّارَ وَٱلْمُنَـٰفِقِينَ وَٱغْلُظْ عَلَيْهِمْ ۚ وَمَأْوَىٰهُمْ جَهَنَّمُ ۖ وَبِئْسَ ٱلْمَصِيرُ",
    "urduTranslationText": "",
    "englishTranslationText": "O\tHerald\tof\t the\tHidden!\tFight\tagainst\t the\t\ndisbelievers\t and\t the\t hypocrites,\t and\t be\t\nstern\t with\t them;\t and\t their\t destination\t\nhell;\tand\twhat\tan\tevil\tplace\tto\treturn!\t",
    "romanUrduTranslationText": "Aey\t Ghaib\t ki\t Khabreiñ\t dene\t Wāle\t (Nabi)!\njihād\t farmāo\t kāfiroñ\t aur\t munafiqoñ\t par\t\naur\t un\t par\t sakhti\t karo\t aur\t unka\t thikāna\t\ndozakh\t hai\t aur\t kya\t hi\t buri\t jagah\t palatne\t\nki."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "74",
    "arabicText": "يَحْلِفُونَ بِٱللَّهِ مَا قَالُوا۟ وَلَقَدْ قَالُوا۟ كَلِمَةَ ٱلْكُفْرِ وَكَفَرُوا۟ بَعْدَ إِسْلَـٰمِهِمْ وَهَمُّوا۟ بِمَا لَمْ يَنَالُوا۟ ۚ وَمَا نَقَمُوٓا۟ إِلَّآ أَنْ أَغْنَىٰهُمُ ٱللَّهُ وَرَسُولُهُۥ مِن فَضْلِهِۦ ۚ فَإِن يَتُوبُوا۟ يَكُ خَيْرًۭا لَّهُمْ ۖ وَإِن يَتَوَلَّوْا۟ يُعَذِّبْهُمُ ٱللَّهُ عَذَابًا أَلِيمًۭا فِى ٱلدُّنْيَا وَٱلْـَٔاخِرَةِ ۚ وَمَا لَهُمْ فِى ٱلْأَرْضِ مِن وَلِىٍّۢ وَلَا نَصِيرٍۢ",
    "urduTranslationText": "",
    "englishTranslationText": ". And\tthey\tswear\tby\tAllah that\tthey\tdid\tnot\t\nsay\tit;\twhereas\tindeed\t they\thad\tcertainly\t\nuttered\t the\t words\t of\t disbelief,\t and\t after\t\nhaving\t entered\t Islam\t turned\t disbelievers\t\nand\thad\twished\tfor\twhat\tthey\tdid\tnot\tget;\t\nand\twhat\tannoyed\tthem\texcept\tthat\tAllah,\t\nand\t His\t Noble\t Messenger,\t made\t them\t\nprosperous\t with\t His\t grace?\t So\t if\t they\t\nrepent,\t it\t is\t better\t for\t them;\t and\t if\t they\t\nturn\t away,\t Allah will\t afflict\t them\t with\t a\t\npainful\tpunishment\t- in\tthis\tworld\tand\tthe\t\nHereafter;\t and\t they\t will\t have\t neither\t a\t\nprotector\tnor\tany\tsupporter\tin\t the\tentire\t\nearth.\t",
    "romanUrduTranslationText": "Allah\tki\tqasam\tkhāte\thaiñ\tke\tunhoñ\tne\tna\t\nkahā\taur\tbe-shak\t\tzaroor\tunhoñ\tne\tkufr\tki\t\nbāt\t kahi\t aur\t islam\t meiñ\t āakar\t kāfir\t\nhogaye\t aur\t woh\t chāha\t tha\t jo\t unheiñ\t na\t\nmila\taur\tunheiñ\t kya\tbura\tlaga\t yehi\tna\t ke\t\nAllah-o-Rasool\t ne\t unheiñ\t apne\t fazl\t se\t\nghani\t kar\t diya\t to\t agar\t woh\t tauba\t kareiñ\t\t\nto\tunka\tbhala\thai\taur\tagar\tmoñh\tphereiñ\t\nto\tAllah\tunheiñ\tsakht\t‘aƶāb\tkarega\tduniya\t\naur\tāakhirat\tmeiñ\taur\tzameen meiñ\tkoi\tna\t\nunka\thimayati\thoga\tna\tmadad-gār."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "75",
    "arabicText": "۞ وَمِنْهُم مَّنْ عَـٰهَدَ ٱللَّهَ لَئِنْ ءَاتَىٰنَا مِن فَضْلِهِۦ لَنَصَّدَّقَنَّ وَلَنَكُونَنَّ مِنَ ٱلصَّـٰلِحِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t among\t them\t are\t those\t who\t made\t a\t\ncovenant\t with\t Allah that,\t “If He\t gives\t us\t\nby\t His\t munificence,\t we\t will\t surely\t give\t\ncharity\tand\tsurely\tbecome\trighteous.”\t",
    "romanUrduTranslationText": "Aur\tun\tmeiñ\tkoi\twoh\thaiñ\tJinhoñ\tne\tAllah\t\nse\t‘ahed\tkiya\ttha\tke\tagar\thameiñ\tapne\tfazl\t\nse\t dega\t to\t hum\t zaroor\t khairāt\t kareñge\t\naur\thum\tzaroor\tbhale\tāadmi\tho\tjāyeñge."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "76",
    "arabicText": "فَلَمَّآ ءَاتَىٰهُم مِّن فَضْلِهِۦ بَخِلُوا۟ بِهِۦ وَتَوَلَّوا۟ وَّهُم مُّعْرِضُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Therefore\t when\t Allah gave\t them\t by\t His\t\nmunificence,\t they\t hoarded\tit\tand\t turning\t\ntheir\t faces,\t went\t back.*\t (*\t Reneged\t on\t\ntheir\tpromise).\t",
    "romanUrduTranslationText": ". To\tjab\tAllah\tne\tunheiñ\tapne\tfazl\tse\tdiya\tus\t\nmeiñ\tbukhl\tkarne\tlage\taur\tmoñh\tpher\tkar\t\npalat\tgaye."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "77",
    "arabicText": "فَأَعْقَبَهُمْ نِفَاقًۭا فِى قُلُوبِهِمْ إِلَىٰ يَوْمِ يَلْقَوْنَهُۥ بِمَآ أَخْلَفُوا۟ ٱللَّهَ مَا وَعَدُوهُ وَبِمَا كَانُوا۟ يَكْذِبُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "So\tfollowing\tthis,\tAllah put\thypocrisy\tin\ttheir\thearts\tuntil\tthe\tday\twhen\tthey\twill\tmeet\tHim\t- the\t\nresult\tof\ttheir\tbreaching\tthe\tpromise\tmade\tto\tAllah,\tand\tbecause\tthey\tlied",
    "romanUrduTranslationText": "To\tuske\tpeechhe\tAllah\tne\tunke\tdiloñ\tmeiñ\tnifāq\trakh\tdiya\tus\tdin\ttak\tke\tus\tse\tmileñge\tbadla\tiska\t\nke\tunhoñ\tne\tAllah\tse\tw’āda\t\tjhoota\tkiya\taur\tbadla\tiska\tke\tjhoot\tbolte\tthey."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "78",
    "arabicText": "أَلَمْ يَعْلَمُوٓا۟ أَنَّ ٱللَّهَ يَعْلَمُ سِرَّهُمْ وَنَجْوَىٰهُمْ وَأَنَّ ٱللَّهَ عَلَّـٰمُ ٱلْغُيُوبِ",
    "urduTranslationText": "",
    "englishTranslationText": ". Do\tthey\tnot\tknow\tthat\tAllah knows\ttheir\tsecrets\tand\tthe\tschemes\tthey\twhisper,\tand\tthat\tAllah\nis\tthe\tAll\tKnowing\tof\tall\tthe\thidden?\t",
    "romanUrduTranslationText": "Kya\tunheiñ\tkhabar\tnahi\tke\tAllah\tunke\tdil\tki\tchhupi\taur\tunki\tsargoshi\tko\tjānta\thai\taur\tyeh\tke\t\nAllah\tsab\tghaiboñ\tka\tbahut\tjānne\twāla\thai."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "79",
    "arabicText": "ٱلَّذِينَ يَلْمِزُونَ ٱلْمُطَّوِّعِينَ مِنَ ٱلْمُؤْمِنِينَ فِى ٱلصَّدَقَـٰتِ وَٱلَّذِينَ لَا يَجِدُونَ إِلَّا جُهْدَهُمْ فَيَسْخَرُونَ مِنْهُمْ ۙ سَخِرَ ٱللَّهُ مِنْهُمْ وَلَهُمْ عَذَابٌ أَلِيمٌ",
    "urduTranslationText": "",
    "englishTranslationText": "Those\twho\tfind\tfault\tin\tthe\tMuslims\twho\tgive\tthe\tcharity\twholeheartedly\tand\tin\tthose\twho\tgain\t\nnothing\t except\t from\t their\t own\t toil\t- so\t they\t mock\t at\t them;\tAllah will\t punish\t them\t for\t their\t\nmocking;\tand\tfor\tthem\tis\ta\tpainful\tpunishment.\t",
    "romanUrduTranslationText": "Woh\tjo\t‘aib\tlagāte\thaiñ\tun\tmusalmanoñ\t\tko\tke\tdil\tse\tkhairāt\tkarte\thaiñ\taur\tunko\tjo\tnahi\tpāte\t\nmagar\tapni\tmehnat\tse\tto\tun\tse\thañste\thaiñ\tAllah\tunki\thañsi\tki\tsaza\tdega\taur\tunke\tliye\tdard-nāk\t\n‘aƶāb\thai."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "80",
    "arabicText": "ٱسْتَغْفِرْ لَهُمْ أَوْ لَا تَسْتَغْفِرْ لَهُمْ إِن تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةًۭ فَلَن يَغْفِرَ ٱللَّهُ لَهُمْ ۚ ذَٰلِكَ بِأَنَّهُمْ كَفَرُوا۟ بِٱللَّهِ وَرَسُولِهِۦ ۗ وَٱللَّهُ لَا يَهْدِى ٱلْقَوْمَ ٱلْفَـٰسِقِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Whether\tyou\t(O\tdear\tProphet\tMuhammad\n- peace\t and\t blessings\t be\t upon\t him)\t ask\t\nforgiveness\t for\t them\t *\t or\t not\t ask\t\nforgiveness\t for\t them;\t even\t if\t you\t ask\t\nforgiveness\t for\t them\tseventy\t times,\tAllah\nwill\tnot\tforgive\tthem;\tthat\tis\tbecause\tthey\t\ndisbelieved\t in\t Allah and\t His\t Noble\t\nMessenger,\t and\tAllah does\t not\t guide\t the\t\nsinful.\t(*\tfor\tthe\thypocrites.)\t",
    "romanUrduTranslationText": "Tum\t unki\tmu'āfi\t chāho\t ya\t na\t chāho\t agar\t\ntum\t sattar\t bār\t un\t ki\t mu'āfi\t chāhoge\t to\t\nAllah\t hargiz\t unheiñ\t nahi\t bakhshe\t ga\t yeh\t\nis\t liye\t ke\t woh\t Allah\t aur\t uske\t Rasool\t se\t\nmunkir\t huwe\t aur\t Allah\t fāsiqon\t ko\t rāh\t\nnahi\tdeta"
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "81",
    "arabicText": "فَرِحَ ٱلْمُخَلَّفُونَ بِمَقْعَدِهِمْ خِلَـٰفَ رَسُولِ ٱللَّهِ وَكَرِهُوٓا۟ أَن يُجَـٰهِدُوا۟ بِأَمْوَٰلِهِمْ وَأَنفُسِهِمْ فِى سَبِيلِ ٱللَّهِ وَقَالُوا۟ لَا تَنفِرُوا۟ فِى ٱلْحَرِّ ۗ قُلْ نَارُ جَهَنَّمَ أَشَدُّ حَرًّۭا ۚ لَّوْ كَانُوا۟ يَفْقَهُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Those\twho\twere\tleft\tbehind\trejoiced\t that\t\nbehind\tthe\tNoble\tMessenger\tof\tAllah they\t\nhad\t remained\t seated,\t and\t they\t were\t\nunwilling\t to\t fight\t in\t Allah's\t cause\t with\t\ntheir\t lives\t or\t their\t wealth,\t and\t said\t “Do\t\nnot\tventure\tout\tin\tthe\theat”;\tsay,\t“The\tfire\t\nof\t hell\t is\t the\t hottest”;\t if\t only\t they\t\nunderstood!\t",
    "romanUrduTranslationText": ". Peechhe\treh\tjāne\twāle\tis\tpar\tkhush\thuwe\t\nke\twoh\tRasool\tke\tpeechhe\tbaith\trahe\taur\t\nunheiñ\tgawara\t na\t huwa\t ke\tapne\tmāl\taur\t\njān\tse\tAllah\tki\trāh\tmeiñ\tladein\taur\tbole\tis\t\ngarmi\t meiñ\t na\t niklo\t tum\t farmāo\t\t\njahannam\t ki\t āag\t sab\t se\t sakht\t garam\t hai\t\nkisi\ttarah\tunheiñ\tsamajh\thoti."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "82",
    "arabicText": "فَلْيَضْحَكُوا۟ قَلِيلًۭا وَلْيَبْكُوا۟ كَثِيرًۭا جَزَآءًۢ بِمَا كَانُوا۟ يَكْسِبُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "So\t they\t should\t laugh\t a\t little\t and\t weep\t\nmuch;\t the\t reward\t of\t what\t they\t used\t to\t\nearn.",
    "romanUrduTranslationText": "To\t unheiñ\t chāhiye\t ke\t thoda\t hañse\t aur\t\nbahut\troyeiñ\tbadla\tuska\tjo\tkamāte\tthey."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "83",
    "arabicText": "فَإِن رَّجَعَكَ ٱللَّهُ إِلَىٰ طَآئِفَةٍۢ مِّنْهُمْ فَٱسْتَـْٔذَنُوكَ لِلْخُرُوجِ فَقُل لَّن تَخْرُجُوا۟ مَعِىَ أَبَدًۭا وَلَن تُقَـٰتِلُوا۟ مَعِىَ عَدُوًّا ۖ إِنَّكُمْ رَضِيتُم بِٱلْقُعُودِ أَوَّلَ مَرَّةٍۢ فَٱقْعُدُوا۟ مَعَ ٱلْخَـٰلِفِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Then\tif\tAllah takes\tyou\tback\tto\ta\tgroup\tof\t\nthem\tand\t they\tseek\tpermission\t from\t you\t\nto\tgo\tout\t to\t fight,\tsay\t to\t them,\t “You\tshall\t\nnever\tgo\tout\twith\tme\tnor\tever\t fight\twith\t\nme\tagainst\tany\tenemy;\tyou\twere\thappy\tto\t\nremain\tseated\tfor\tthe\tfirst\ttime,\ttherefore\t\nremain\t seated\t with those\t who\t stay\t\nbehind.”\t",
    "romanUrduTranslationText": ". Phir\taey\tMehboob!\tagar\tAllah\ttumheiñ\t\tun\t\nmeiñ\t se\t kisi\t giroh\t ki\t taraf\t wāpas\t le\t jāye\t\naur\twoh\t tum\t se\tjihād\t ko\tnikalne\t ki\tijāzat\t\nmāñge\t to\t tum\t farmāna\t tum\t kabhi\t mere\t\nsāth\t na\t chalo\t aur\t hargiz\t mere\t sāth\t kisi\t\ndushman\t se\t na\t lado\t tum\t ne\t pehli\t daf’a\t\nbaith\t rehna\t pasand\t kiya\t to\t baith\t raho\t\npeechhe\treh\tjāne\twāloñ\tke\tsāth"
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "84",
    "arabicText": "وَلَا تُصَلِّ عَلَىٰٓ أَحَدٍۢ مِّنْهُم مَّاتَ أَبَدًۭا وَلَا تَقُمْ عَلَىٰ قَبْرِهِۦٓ ۖ إِنَّهُمْ كَفَرُوا۟ بِٱللَّهِ وَرَسُولِهِۦ وَمَاتُوا۟ وَهُمْ فَـٰسِقُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tnever\toffer\t funeral\tprayers\t for\tany\tof\t them\t*\twho\tdies,\tnor\tstand\tby\this\tgrave\t**;\tindeed\t\nthey\tdisbelieved\tin\tAllah and\tHis\tNoble\tMessenger,\tand\tthey\tdied\tas\tsinners.\t(*\tIt\tis\tforbidden\tto\t\noffer\tfuneral\tprayers\tfor\tthe\thypocrites.\t**\tTo\task\tforgiveness\tfor\tthem).\t",
    "romanUrduTranslationText": "Aur\t un\t meiñ\t se\t kisi\t ki\t mayyit\t par\t kabhi\t\nnamāz\tna\tpadhna\taur\tna\tuski\tqabr\tpar\tkhade\thona\tbe-shak\t\twoh\tAllah\taur\tRasool\tse\tmunkir\t\nhuwe\taur\tfisq\thi\tmeiñ\tmar\tgaye."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "85",
    "arabicText": "وَلَا تُعْجِبْكَ أَمْوَٰلُهُمْ وَأَوْلَـٰدُهُمْ ۚ إِنَّمَا يُرِيدُ ٱللَّهُ أَن يُعَذِّبَهُم بِهَا فِى ٱلدُّنْيَا وَتَزْهَقَ أَنفُسُهُمْ وَهُمْ كَـٰفِرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tdo\tnot\tbe\tsurprised\tat\ttheir\twealth\tor\ttheir\tchildren;\tAllah only\twills\tto\ttorment\tthem\twith\t\nit\tin\tthis\tworld,\tand\tthat\tthey\tpass\taway\tupon\tdisbelief.\t\t",
    "romanUrduTranslationText": "Aur\tunke\tmāl\t ya\taulād\tpar\t t’ajjub\tna\t karna\tAllah\t yehi\tchāhta\thai\t ke\tisey\tduniya\tmeiñ\tun\tpar\t\nwabāl\tkare\taur\tkufr\thi\tpar\tunka\tdam\tnikal\tjāye."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "86",
    "arabicText": "وَإِذَآ أُنزِلَتْ سُورَةٌ أَنْ ءَامِنُوا۟ بِٱللَّهِ وَجَـٰهِدُوا۟ مَعَ رَسُولِهِ ٱسْتَـْٔذَنَكَ أُو۟لُوا۟ ٱلطَّوْلِ مِنْهُمْ وَقَالُوا۟ ذَرْنَا نَكُن مَّعَ ٱلْقَـٰعِدِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t when\t a\t chapter\t is\t sent\t down\t that\t “Accept\t faith\t in\tAllah and\t fight\t along\t with\t His\t Noble\t\nMessenger”,\tthe\tmen\tof\tmeans\tamong\tthem\tseek\texemption\tfrom\tyou\tand\tsay,\t“Leave\tus,\tfor\tus\t\nto\tbe\twith\tthose\twho\tsit.”",
    "romanUrduTranslationText": "Aur\tjab\t koi\t soorat\t utre\t ke\tAllah\t par\t Imān\tlāo\taur\t uske\tRasool\t ke\t hamrah\tJihād\t karo\t to\t unke\t\nmaqdoor\t(Tāqat\trakhne)\twāle\ttum\tse\trukhsat\tmāñgte\thaiñ\taur\tkehte\thaiñ\thameiñ\tchhod\tdijiye\t\nke\tbaith\trehne\twālo\tke\tsāth\tho\tlein"
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "87",
    "arabicText": "رَضُوا۟ بِأَن يَكُونُوا۟ مَعَ ٱلْخَوَالِفِ وَطُبِعَ عَلَىٰ قُلُوبِهِمْ فَهُمْ لَا يَفْقَهُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "They\t preferred\t to\t be\t with\t the\t women\t\nwho\t stay\t behind,\t and\t their\t hearts\t have\t\nbeen\tsealed,\tso\tthey\tdo\tnot\tunderstand.\t",
    "romanUrduTranslationText": "Unheiñ\t pasand\t āaya\t ke\t peechhe\t rehne\t\nwāli\t aurtoñ\t ke\t sāth\t ho\t jāyeñ\t aur\t unke\t\ndiloñ\tpar\tmohar\tkar\tdi\tgayi\tto\twoh\tkuchh\t\nnahi\tsamajhte"
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "88",
    "arabicText": "لَـٰكِنِ ٱلرَّسُولُ وَٱلَّذِينَ ءَامَنُوا۟ مَعَهُۥ جَـٰهَدُوا۟ بِأَمْوَٰلِهِمْ وَأَنفُسِهِمْ ۚ وَأُو۟لَـٰٓئِكَ لَهُمُ ٱلْخَيْرَٰتُ ۖ وَأُو۟لَـٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "But\t the\t Noble\t Messenger\t and\t those\t who\t\naccepted\tfaith\twith\thim,\tfought\twith\ttheir\t\nwealth\t and\t lives;\t and\t for\t them\t only\t are\t\nthe\t virtues\t (rewards);\tand\tit\tis\t they\twho\t\nhave\tachieved\tthe\tgoal.",
    "romanUrduTranslationText": ". Lekin\t Rasool\t aur\t jo\t unke\t sāth\tImān\t lāye\t\nunhoñ\tne\tapne\tmālon,\tjānon\tse\tjihād\tkiya\t\naur\tunhiñ\tke\tliye\tbhalaiyāñ\thaiñ\taur\tyehi\t\nmurād\tko\tpahuñche"
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "89",
    "arabicText": "أَعَدَّ ٱللَّهُ لَهُمْ جَنَّـٰتٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا ۚ ذَٰلِكَ ٱلْفَوْزُ ٱلْعَظِيمُ",
    "urduTranslationText": "",
    "englishTranslationText": "Allah has\t kept\t ready\t for\t them\t Gardens\t\nbeneath\t which\t rivers\t flow,\t abiding\t in\t it\t\nforever;\tthis\tis\tthe\tgreatest\tsuccess.\t",
    "romanUrduTranslationText": "Allah\t ne\t unke\t liye\t tayyār\t kar\t rakhi\t haiñ\t\nbahishteiñ\t jinke\t neeche\t nehreiñ\t \t rawāñ\t\nhamesha\t un\t meiñ\t raheñge\t yehi\t badi\t\nmurād\tmilni\thai"
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "90",
    "arabicText": "وَجَآءَ ٱلْمُعَذِّرُونَ مِنَ ٱلْأَعْرَابِ لِيُؤْذَنَ لَهُمْ وَقَعَدَ ٱلَّذِينَ كَذَبُوا۟ ٱللَّهَ وَرَسُولَهُۥ ۚ سَيُصِيبُ ٱلَّذِينَ كَفَرُوا۟ مِنْهُمْ عَذَابٌ أَلِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t came\t the\t ignorant\t *\t who\t make\t\nexcuses\t seeking\t exemption,\t and\t those\t\nwho\t lied\t to\t Allah and\t His\t Noble\t\nMessenger\t remained\t seated;\t a\t painful\t\npunishment\t will\t soon\t reach\t the\t\ndisbelievers\tamong\tthem.\t(*\tof\tfaith)\t",
    "romanUrduTranslationText": "Aur\t bahāne\t banāne\twāle\tgañwār\tāaye\t ke\t\nunheiñ\trukhsat\tdi\tjāye\taur\tbaith\trahe\twoh\t\nJinhoñ\tne\tAllah-o-Rasool\tse\tjhoot\tbola\ttha\t\njald\tun\tmeiñ\tke\tkāfiroñ\tko\tdard-nāk\t‘aƶāb\t\npahuñche\tga"
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "91",
    "arabicText": "لَّيْسَ عَلَى ٱلضُّعَفَآءِ وَلَا عَلَى ٱلْمَرْضَىٰ وَلَا عَلَى ٱلَّذِينَ لَا يَجِدُونَ مَا يُنفِقُونَ حَرَجٌ إِذَا نَصَحُوا۟ لِلَّهِ وَرَسُولِهِۦ ۚ مَا عَلَى ٱلْمُحْسِنِينَ مِن سَبِيلٍۢ ۚ وَٱللَّهُ غَفُورٌۭ رَّحِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "There\t is\t no\t reproach\t upon\t the\t old\t nor\t\nupon\tthe\tsick\tnor\tupon\tthose\twho\tdo\tnot\t\nhave\t the\t means\t to\t spend,\t provided\t they\t\nremain\t faithful\t to\t Allah and\t His\t Noble\t\nMessenger;\t and\t there\t is\t no\t way\t of\t\nreproach\tagainst\tthe\tvirtuous;\tand\tAllah is\t\nOft\tForgiving,\tMost\tMerciful",
    "romanUrduTranslationText": "Za'eefon\t par\t kuchh\t haraj\t nahi\taur\t na\t bimāroñ\t par\taur\t na\t un\t par\tjinheiñ\t kharch\t ka\tmaqdoor\t\n(tāqat)\tna\tho\tjab\tke\tAllah-o-Rasool\tke\tkhair-khwah\traheiñ\tneki\twāloñ\tpar\tkoi\trāh\tnahi\taur\tAllah\t\nbakhsh\tne\twāla\tmaherbān\thai."
  },
  
    
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "92",
    "arabicText": "وَلَا عَلَى ٱلَّذِينَ إِذَا مَآ أَتَوْكَ لِتَحْمِلَهُمْ قُلْتَ لَآ أَجِدُ مَآ أَحْمِلُكُمْ عَلَيْهِ تَوَلَّوا۟ وَّأَعْيُنُهُمْ تَفِيضُ مِنَ ٱلدَّمْعِ حَزَنًا أَلَّا يَجِدُوا۟ مَا يُنفِقُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Nor\t against\t those\t who\t humbly\t present\t\nthemselves\t before\t you\tin\t order\t that\t you\t provide\t them\ta\tmount,\tand\t receive\tan\tanswer\t from\t\nyou\tthat\t“I\tdo\tnot\thave\tany\tbeast\tto\tcarry\tyou”\t- and\tso\tthey\tturn\tback\twith\teyes\toverflowing\t\nwith\ttears,\tdue\tto\tthe\tsorrow\tthat\tthey\tcould\tnot\tfind\tthe\tmeans\tto\tspend.\t",
    "romanUrduTranslationText": "Aur\tna\tun\tpar\tjo\ttumhāre\thuzoor\thāzir\thoñ ke\ttum\tunheiñ\tsawāri\t‘aṭa\tfarmāo tum\tse\tyehi\tjawāb\t\npāyeiñ\tke\tmere\tpās\tkoi\tcheez\tnahi\tjis\tpar\ttumheiñ suwār\tkarooñ\tis\tpar\tyuñ\twāpas\tjāyeñ\tke\tunki\t\nānkhoñ\tse\tāañsu\tubalte\thoñ is\tgham\tse\tke\tkharch\tka\tmagdoor\tna\tpāya."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "93",
    "arabicText": "۞ إِنَّمَا ٱلسَّبِيلُ عَلَى ٱلَّذِينَ يَسْتَـْٔذِنُونَكَ وَهُمْ أَغْنِيَآءُ ۚ رَضُوا۟ بِأَن يَكُونُوا۟ مَعَ ٱلْخَوَالِفِ وَطَبَعَ ٱللَّهُ عَلَىٰ قُلُوبِهِمْ فَهُمْ لَا يَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "The\tway\t (of\t reproach)\tis\tonly\tagainst\t those\twho\tseek\texemption\t from\t you\talthough\t they\tare\t\nrich;\tthey\tpreferred\tto\tbe\twith\tthe\twomen\twho\tstay\tbehind\t- and\tAllah has\tsealed\ttheir\thearts,\t\nso\tthey\tdo\tnot\tknow\tanything.",
    "romanUrduTranslationText": "Muākhaza\t(pakad)\tto\tun\tse\thai\tjo\ttum\tse\trukhsat\tmāñgte\thaiñ\taur\twoh\tdaulat\tmand\thaiñ\tunheiñ\t\npasand\tāaya\tke\taurtoñ\tke\tsāth\tpeechhe baith\traheiñ\taur\tAllah\tne\tunke\tdiloñ\tpar\tmohar\tkar\tdi\tto\t\nwoh\tkuchh\tnahi\tjānte."
  }
]