[
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "92",
    "arabicText": "لَن تَنَالُوا۟ ٱلْبِرَّ حَتَّىٰ تُنفِقُوا۟ مِمَّا تُحِبُّونَ ۚ وَمَا تُنفِقُوا۟ مِن شَىْءٍۢ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "You\tcan\tnever\tattain\tvirtue\tuntil you\tspend\t\nin\t Allah's\t cause\t the\t things\t you\t love;\t and\t\nAllah is\tAware\tof\twhatever\tyou\tspend.\t",
    "romanUrduTranslationText": "Tum\t hargiz\t bhalāi\t ko\t na\t pahuñcho\t ge\tjab\t\ntak\tRāh-e-Khuda\t me\t apni\t piyāri\t cheez\t na\t\nkharch\t karo\t aur\t tum\tjo\t kuch\t kharch\t karo\t\nAllah\tko\tma'loom\thai."
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "93",
    "arabicText": "۞ كُلُّ ٱلطَّعَامِ كَانَ حِلًّۭا لِّبَنِىٓ إِسْرَٰٓءِيلَ إِلَّا مَا حَرَّمَ إِسْرَٰٓءِيلُ عَلَىٰ نَفْسِهِۦ مِن قَبْلِ أَن تُنَزَّلَ ٱلتَّوْرَىٰةُ ۗ قُلْ فَأْتُوا۟ بِٱلتَّوْرَىٰةِ فَٱتْلُوهَآ إِن كُنتُمْ صَـٰدِقِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "All\tfood\twas\tlawful\tfor\tthe\tDescendants\tof\t\nIsrael\t(Jacob),\texcept\twhat\t Israel\t forbade\t\nfor\thimself,\tbefore\tthe\tTaurat\t(Torah)\twas\t\nsent\t down;\t say,\t “Bring\t the\t Taurat\t and\t\nread\tit,\tif\tyou\tare\ttruthful.”",
    "romanUrduTranslationText": ". Sab\tkhāne\tbani\t Isra’il\tko\thalāl\t they\tmagar\t\nwoh\tjo\tY'aqūb ne\tapne\tupar\tharām\tkar\tliya\t\ntha\t Taurait utarne\t se\t pahle\t tum\t farmao\t\nTaurāt lākar\tpadho\tagar\tsachhe\tho"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "94",
    "arabicText": "فَمَنِ ٱفْتَرَىٰ عَلَى ٱللَّهِ ٱلْكَذِبَ مِنۢ بَعْدِ ذَٰلِكَ فَأُو۟لَـٰٓئِكَ هُمُ ٱلظَّـٰلِمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "So\t henceforth\t whoever\t fabricates\t lies\t\nagainst\tAllah - it\tis\tthey\twho\tare\tthe\tunjust",
    "romanUrduTranslationText": "To\t uske\t bād\t jo\t Allah\t par\t jhoot\t bāñdhe\t to\t\nwahi\tzālim\thaiñ"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "95",
    "arabicText": "قُلْ صَدَقَ ٱللَّهُ ۗ فَٱتَّبِعُوا۟ مِلَّةَ إِبْرَٰهِيمَ حَنِيفًۭا وَمَا كَانَ مِنَ ٱلْمُشْرِكِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Say\t (O\t dear\t Prophet\t Muhammad - peace\t\nand\t blessings\t be\t upon\t him),\t “Allah is\t\ntruthful;\tso\tfollow\tthe\treligion\tof\tIbrahim,\t\nwho\t was\t free\t from\t all\t falsehood;\t and\t he\t\nwas\tnot\tof\tthe\tpolytheists.”",
    "romanUrduTranslationText": "Tum\tfarmāo\tAllah\tsachcha\thai\tto\tIbrāheem\nke\tdeen\tpar\tchalo\tjo\thar\tbātil\tse\tjuda\tthey\t\naur\tshirk\twāloñ\tmeiñ\tna\tthey."
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "96",
    "arabicText": "إِنَّ أَوَّلَ بَيْتٍۢ وُضِعَ لِلنَّاسِ لَلَّذِى بِبَكَّةَ مُبَارَكًۭا وَهُدًۭى لِّلْعَـٰلَمِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Indeed\tthe\tfirst\thouse\tthat\twas\tappointed\t\nas\ta\t place\t of\tworship\t for\tmankind,\tis\t the\t\none\t at\t Mecca\t (the\t Holy\t Ka’aba),\t blessed\t\nand\ta\tguidance\tto\tthe\twhole\tworld;\t",
    "romanUrduTranslationText": "Beshak\t sab\t meiñ\t pahla\t ghar\t jo\t logoñ\t ki\t\nibādat\t ko\t muqarrar\t huwa\t woh\t hai\t jo\t\nmakkeh\t meiñ\t hai\t barkat\t wāla\t aur\t sāre\t\njahāñ\tka\tRahnuma"
  }
]