[
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "94",
    "arabicText": "يَعْتَذِرُونَ إِلَيْكُمْ إِذَا رَجَعْتُمْ إِلَيْهِمْ ۚ قُل لَّا تَعْتَذِرُوا۟ لَن نُّؤْمِنَ لَكُمْ قَدْ نَبَّأَنَا ٱللَّهُ مِنْ أَخْبَارِكُمْ ۚ وَسَيَرَى ٱللَّهُ عَمَلَكُمْ وَرَسُولُهُۥ ثُمَّ تُرَدُّونَ إِلَىٰ عَـٰلِمِ ٱلْغَيْبِ وَٱلشَّهَـٰدَةِ فَيُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "They\twill\tmake\texcuses\t to\t you\twhen\t you\t\nreturn\tto\tthem;\tsay,\t“Do\tnot\tmake\texcuses\t\n- we\t shall\t never\t believe\t you\t - Allah has\t\ngiven\t us\t your\t tidings;\t and\t Allah and\t His\t\nNoble\tMessenger\twill\tnow\tsee\tyour\tdeeds,\t\nand\t then\t you\t will\t return\t to\t Him\t Who\t\nknows\t everything,\t the\t hidden\t and\t the\t\nvisible\t- He\twill\tinform\tyou\tof\tall\twhat\tyou\t\nused\tto\tdo.”",
    "romanUrduTranslationText": "Tum\tse\tbahāne\tbanāyeñ\tge jab\ttum\tun\tki\t\ntaraf\t laut\t kar\t jāoge\t tum\t farmānā\t bahāne\t\nna\tbanāo\thum\thargiz\t tumhārā\tyaqeen\tna\t\nkareiñ\t ge\t Allāh\t ne\t hameiñ\t tumhāri\t\nkhabreñ\tde\tdi\thaiñ\taur\tab\tAllāh\twa\tRasool\t\ntumhāre\t kām\t dekheñ\t ge\t phir\t us\t ki\t taraf\t\npalat\tkar\tjāoge\tjo\tchupe\taur\tzāhir\tsab\tko\t\njāntā\t hai\t woh\t tumhe\t jatā\t dega\t jo\t kuch\t\ntum\tkarte\tthe"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "95",
    "arabicText": "سَيَحْلِفُونَ بِٱللَّهِ لَكُمْ إِذَا ٱنقَلَبْتُمْ إِلَيْهِمْ لِتُعْرِضُوا۟ عَنْهُمْ ۖ فَأَعْرِضُوا۟ عَنْهُمْ ۖ إِنَّهُمْ رِجْسٌۭ ۖ وَمَأْوَىٰهُمْ جَهَنَّمُ جَزَآءًۢ بِمَا كَانُوا۟ يَكْسِبُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". They\twill\tnow\tswear\tby\tAllah before\tyou,\t\nwhen\t you\t return\t to\t them,\t in\t order\t that\t\nyou\t do\t not\t pay\t attention\t to\t them;\t so\t do\t\nnot\t bother\t about\t them;\t they\t are\t indeed\t\nfilthy;\t and\t their\t destination\t is\t hell;\t the\t\nreward\tof\twhat\tthey\tused\tto\tearn.\t",
    "romanUrduTranslationText": "Ab\t tumhāre\tāage\tAllāh\t ki\t qasam\t khāyeiñ\t\nge\t jab\t tum\t un\t ki\t taraf\t palat\t kar\t jāoge\t is\t\nliye\t ke\t tum\t un\t ke\t khayāl\t me\t na\t pado\t to\t\nhāñ\ttum\tun\tke\tkhayāl\tchhodo\twoh\tto\tnire\t\n(bilkul) paleed\t haiñ\t aur\t unkā\t thikāna\t\nJahannam\thai\tbadlā\tus\tkā\tjo\tkamāte\tthe"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "96",
    "arabicText": "يَحْلِفُونَ لَكُمْ لِتَرْضَوْا۟ عَنْهُمْ ۖ فَإِن تَرْضَوْا۟ عَنْهُمْ فَإِنَّ ٱللَّهَ لَا يَرْضَىٰ عَنِ ٱلْقَوْمِ ٱلْفَـٰسِقِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "They\t swear\t before\t you\t that\t you\t may\t be\t\npleased\t with\t them;\t so\t if\t you\t become\t\npleased\twith\tthem,\tthen\tindeed\tAllah will\t\nnever\tbe\tpleased\twith\tthe\tsinful.\t",
    "romanUrduTranslationText": "Tumhāre\t āge\t qasmeiñ\t khāte\t haiñ\t ki\t tum\t\nun\tse\trāzi\tho\tjāo\tto\tagar\ttum\tun\tse\trāzi\tho\t\njāo\t to\t beshak\tAllāh\t to\t fāsiq\tlogoñ\t se\t rāzi\t\nna\thogā"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "97",
    "arabicText": "ٱلْأَعْرَابُ أَشَدُّ كُفْرًۭا وَنِفَاقًۭا وَأَجْدَرُ أَلَّا يَعْلَمُوا۟ حُدُودَ مَآ أَنزَلَ ٱللَّهُ عَلَىٰ رَسُولِهِۦ ۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "The\tignorant\tare\tmore\tsevere\tin\tdisbelief\t\nand\t hypocrisy,\t and\t deserve\t to\t remain\t\nignorant\t of\t the\t commands\t which\t Allah\nhas\trevealed\tto\tHis\tNoble\tMessenger;\tand\t\nAllah is\tAll\tKnowing,\tWise.\t\t",
    "romanUrduTranslationText": "Gañwār\t kufr\t aur\t nifāq\t me\t ziyāda\t sakht\t\nhaiñ\taur\tisi\tqābil\thaiñ\tki\tAllāh\tne\tjo\thukm\t\napne\t Rasool\t par utāre\t us\t se\t jāhil\t raheñ\t\naur\tAllah\t‘Ilm-o-Hikmat\twālā\thai."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "98",
    "arabicText": "وَمِنَ ٱلْأَعْرَابِ مَن يَتَّخِذُ مَا يُنفِقُ مَغْرَمًۭا وَيَتَرَبَّصُ بِكُمُ ٱلدَّوَآئِرَ ۚ عَلَيْهِمْ دَآئِرَةُ ٱلسَّوْءِ ۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t some\t of\t the\t ignorant\t are\t those\t who\t\nwhen\t spending\tin\tAllah's\t cause\t consider\tit\t a\t ransom,\t and\t await\t the\t coming\t of\t the\t cycles\t(of\t\nmisfortunes)\tupon\tyou;\tupon\tthem\tonly\tis\tthe\tevil\tcycle\tof\tmisfortune;\tand\tAllah is\tAll\tHearing,\t\nAll\tKnowing",
    "romanUrduTranslationText": "Aur\tkuch\tgañwār\twoh\thaiñ\tjo\tAllāh\tki\trāh\tmeiñ\tkharch\tkareñ\tto\tuse\ttāwān\tsamjheñ\taur\ttum\tpar\t\ngardisheñ\t(masāib)\tāane\tke\tintiżar\tmeiñ\traheñ\tunhiñ\tpar\thai\tburi\tgardish\taur\tAllāh\tsuntā\tjāntā\t\nhai."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "99",
    "arabicText": "وَمِنَ ٱلْأَعْرَابِ مَن يُؤْمِنُ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ وَيَتَّخِذُ مَا يُنفِقُ قُرُبَـٰتٍ عِندَ ٱللَّهِ وَصَلَوَٰتِ ٱلرَّسُولِ ۚ أَلَآ إِنَّهَا قُرْبَةٌۭ لَّهُمْ ۚ سَيُدْخِلُهُمُ ٱللَّهُ فِى رَحْمَتِهِۦٓ ۗ إِنَّ ٱللَّهَ غَفُورٌۭ رَّحِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tsome\tvillagers\tare\tthose\twho\tbelieve\tin\tAllah and\tthe\tLast\tDay,\tand\tconsider\tthe\tspending\t\nas\tthe\tmeans\tof\tobtaining\tproximity\tto\tAllah and\tobtaining\tthe\tprayers\tof\tthe\tNoble\tMessenger;\t\npay\theed!\tYes\tindeed\tit\tis\tthe\tmeans\tof\tproximity\tfor\tthem;\tAllah will\tsoon\tadmit\tthem\tinto\tHis\t\nmercy;\tindeed\tAllah is\tOft\tForgiving,\tMost\tMerciful",
    "romanUrduTranslationText": ". Aur\tkuch\tgāoñ\twāle\twoh\thaiñ\tjo\tAllāh\taur\tqiyāmat\tpar\t Imān\trakhte\thaiñ\taur\tjo\tkharch\tkareñ\t\nuse\tAllāh\t ki\t nazdikiyoñ\t aur\tRasool\t ki\t duaāen\tlene\t kā\t zari'ā\t samjheñ\t hāñ\t hāñ\twoh\t un\t ke\tliye\t\nbā’is-e-qurb\thai\tAllāh\tjald\tunheñ\tapni\trahmat\tmeiñ\tdākhil\tkarega\tbeshak\tAllāh\tbakhsh\tne\twālā\t\nmeharbān\thai"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "100",
    "arabicText": "وَٱلسَّـٰبِقُونَ ٱلْأَوَّلُونَ مِنَ ٱلْمُهَـٰجِرِينَ وَٱلْأَنصَارِ وَٱلَّذِينَ ٱتَّبَعُوهُم بِإِحْسَـٰنٍۢ رَّضِىَ ٱللَّهُ عَنْهُمْ وَرَضُوا۟ عَنْهُ وَأَعَدَّ لَهُمْ جَنَّـٰتٍۢ تَجْرِى تَحْتَهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَآ أَبَدًۭا ۚ ذَٰلِكَ ٱلْفَوْزُ ٱلْعَظِيمُ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t leading\t everyone,\t the\t first\t are\t the\t\nMuhajirs\t *\t and\t the\t Ansar\t **,\t and\t those\t\nwho\t followed\t them\t with\t virtue\t- Allah is\t\npleased\t with\t them\t and\t they\t are\t pleased\t\nwith\tHim,\tand\tHe\thas\tkept\tready\tfor\tthem\t\nGardens\t beneath\t which\t rivers\t flow,\t to\t\nabide\t in\t it\t for\t ever\t and\t ever;\t this\t is\t the\t\ngreatest\t success.\t (*\t The\t immigrants.\t\n**Those\twho\thelped\tthe\timmigrants.)\t",
    "romanUrduTranslationText": ". Aur\t sab\t meiñ\t agle\t pehle\t muhājir\t aur\t\nansār\tjo\tbhalāi\tke\tsath\tun\tke\tpairw\t(perwi\t\nkarne)\t wāle\t huwe\t Allāh\t un\t se\t rāzi\t woh\t\nAllāh\t se\t rāzi\t aur\t unke\t liye\t tayyār\t kar\t\nrakhe\t haiñ\t bāgh\t jin\t ke\t neeche\t nehreñ\t\t\nbaheñ\t hamesha\t hamesha\t un\t meiñ\t raheñ\t\nyahi\tbadi\tkāmyābi\thai"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "101",
    "arabicText": "وَمِمَّنْ حَوْلَكُم مِّنَ ٱلْأَعْرَابِ مُنَـٰفِقُونَ ۖ وَمِنْ أَهْلِ ٱلْمَدِينَةِ ۖ مَرَدُوا۟ عَلَى ٱلنِّفَاقِ لَا تَعْلَمُهُمْ ۖ نَحْنُ نَعْلَمُهُمْ ۚ سَنُعَذِّبُهُم مَّرَّتَيْنِ ثُمَّ يُرَدُّونَ إِلَىٰ عَذَابٍ عَظِيمٍۢ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tsome\tof\tthe\tilliterates\taround\tyou\tare\t\nhypocrites;\t and\t some\t of\t the\t people\t of\t\nMedinah;\thypocrisy\thas\tbecome\tingrained\t\nin\t them;\t you\t do\t not\t know\t them\t *;\t We\t\nknow\t them;\t We\t shall\t soon\t punish\t them\t\ntwice\t **\t - they\t will\t then\t be\t consigned\t\ntowards\tthe\tterrible\tpunishment.***\n(*Until now or as well as We do. ** In life \nand in the grave *** of hell.) ",
    "romanUrduTranslationText": "Aur\t tumhāre\t āas\t pās\t ke\t kuch\t gañwār\t\nmunāfiq\thaiñ\taur\tkuch\tmadinā\twāle\tun\tki\t\nkhu\t (ādat)\t ho\t gai\t hai\t nifāq,\t tum\t unheñ\t\nnahiñ\t jānte\t hum\t unheñ\t jānte\t haiñ\t jald\t\nhum\t unheñ\t do\t bār\t ‘azāb\t kareñge\t phir\t\nbade\tázāb\tki\ttaraf\tphere\tjāyeñ\tge"
  }
]