[
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "143",
    "arabicText": "وَكَذَٰلِكَ جَعَلْنَـٰكُمْ أُمَّةًۭ وَسَطًۭا لِّتَكُونُوا۟ شُهَدَآءَ عَلَى ٱلنَّاسِ وَيَكُونَ ٱلرَّسُولُ عَلَيْكُمْ شَهِيدًۭا ۗ وَمَا جَعَلْنَا ٱلْقِبْلَةَ ٱلَّتِى كُنتَ عَلَيْهَآ إِلَّا لِنَعْلَمَ مَن يَتَّبِعُ ٱلرَّسُولَ مِمَّن يَنقَلِبُ عَلَىٰ عَقِبَيْهِ ۚ وَإِن كَانَتْ لَكَبِيرَةً إِلَّا عَلَى ٱلَّذِينَ هَدَى ٱللَّهُ ۗ وَمَا كَانَ ٱللَّهُ لِيُضِيعَ إِيمَـٰنَكُمْ ۚ إِنَّ ٱللَّهَ بِٱلنَّاسِ لَرَءُوفٌۭ رَّحِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t so\t it\t is\t that\t We\t have\t made\t you\t the\t\nbest\t nation*\t for\t you\t are\t witnesses**\t\nagainst\t mankind,\t and\t the\t Noble\t\nMessenger\t is\t your\t guardian\t and\t your\t\nwitness;\tand\t(O\tdear\tProphet\tMuhammad\n- peace\tand\tblessings\tbe\tupon\thim)\tWe\thad\t\nappointed\t the\t qiblah\twhich\t you\t formerly\t\nobserved\t only\t to\t see\t (test)\t who\t follows\t\nthe\t Noble\t Messenger,\t and\t who\t turns\t\naway;\t and\t it\t was\t indeed\t hard\t except\t for\t\nthose\twhom\tAllah guided;\tand\tit\tdoes\tnot\t\nbefit\tAllah’s\t Majesty\t to\t waste\t your\t faith!\t\nIndeed\tAllah is\tMost\tCompassionate,\tMost\t\nMerciful\t towards\t mankind.\t (The\t best\t\nUmmah\t is\t that\t of\t Prophet\t Muhammad -\npeace\t and\t blessings\t be\t upon\t him.\t **The\t\nHoly\tProphet\tis\ta\twitness\tfrom\tAllah.)",
    "romanUrduTranslationText": "Aur\tbāt\tyuñ\thi\thai\tke\tham\tne\ttumheiñ\tkiya\t\nsab\tUmmatoñ\tmeiñ\tAfzal\tke\ttum\tlogoñ\tpar\t\ngawah\t ho\taur\t yeh\tRasool\t tumhāre\tnigeh\u0002bān\to\tgawāh\taur\taey\tmehboob!\ttum\tpahle\t\njis\t qibla\t par\t they\t ham\t ne\t woh\t isi\t liye\t\nmuqarrar\tkiya\ttha\tke\tdekheñ\tkaun\tRasool\t\nki\tpairwi\tkarta\thai\taur\tkaun\tulte\tpaoñ\tphir\t\njāta\thai\taur\tbeshak\tyeh\tbhāri\tthi\tmagar\tun\t\npar\tjinheiñ\tAllah\tne\thidāyat\tki\taur\tAllah\tki\t\nshan\tnahi\tke\ttumhāra\tImān\takārat (zaa’e)\nkare\t beshak\t Allah\t ādmiyoñ\t par\t bahot\t\nmaherbān meher\t(rahem) wāla\thai"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "144",
    "arabicText": "قَدْ نَرَىٰ تَقَلُّبَ وَجْهِكَ فِى ٱلسَّمَآءِ ۖ فَلَنُوَلِّيَنَّكَ قِبْلَةًۭ تَرْضَىٰهَا ۚ فَوَلِّ وَجْهَكَ شَطْرَ ٱلْمَسْجِدِ ٱلْحَرَامِ ۚ وَحَيْثُ مَا كُنتُمْ فَوَلُّوا۟ وُجُوهَكُمْ شَطْرَهُۥ ۗ وَإِنَّ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَـٰبَ لَيَعْلَمُونَ أَنَّهُ ٱلْحَقُّ مِن رَّبِّهِمْ ۗ وَمَا ٱللَّهُ بِغَـٰفِلٍ عَمَّا يَعْمَلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". We\tobserve\tyou\tturning\tyour\tface,\tseveral\t\ntimes\t towards\t heaven\t (O\t dear\t Prophet\t\nMuhammad - peace\tand\tblessings\tbe\tupon\t\nhim);\tso\tWe\twill\tdefinitely\tmake\tyou\tturn\t\n(for\t prayer)\ttowards\t a\t qiblah\t which\t pleases\t you;\t therefore\t now\t turn\t your\t face\t towards\t the\t\nSacred Masjid (in\tMecca);\tand\tO\tMuslims,\twherever\t you\tmay\t be,\t turn\t your\t faces\t(for\t prayer)\t\ntowards\tit\tonly;\tand\tthose\twho\thave\treceived\tthe\tBook\tsurely\tknow\tthat\tthis\tis\tthe\ttruth\tfrom\t\ntheir\t Lord;\t and\tAllah is\t not\t unaware\t of\t their\t deeds.\t(Allah seeks\t to\t please\t the\tHoly\t Prophet\t–\npeace\tand\tblessings\tbe\tupon\thim.)",
    "romanUrduTranslationText": ". Hum\t dekh\t rahe\t haiñ\t bār\t bār\t tumhāra\t\nāsmān\tki\ttaraf\tmooñh\tkarna\tto\tzroor\tham\t\ntumheiñ\t pher\t deñge\t us\t qibla\t ki\t taraf\t jis\t\nmeiñ\ttumhāri\tkhushi\thai\tabhi\tapna\tmooñh\t\npher\t do\t Masjid-e-Harām ki\t taraf\t aur\t aey\t\nmuslamanoñ\t tum\t jahāñ\t kaheeñ\t ho\t apna\t\nmuñh\t usi\t ki\t taraf\t karo\t aur\t woh\t jinheiñ\t\nkitāb\tmili\t hai\tzaroor\tjānte\t haiñ\t ke\t yeh\t unke\tRab\t ki\t taraf\t se\t haq\t hai\taur\tAllah\t unke\t kautakoñ\n(bure\ta'amāl) se\tbekhabar\tnahi"
  }
]