[
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "203",
    "arabicText": "۞ وَٱذْكُرُوا۟ ٱللَّهَ فِىٓ أَيَّامٍۢ مَّعْدُودَٰتٍۢ ۚ فَمَن تَعَجَّلَ فِى يَوْمَيْنِ فَلَآ إِثْمَ عَلَيْهِ وَمَن تَأَخَّرَ فَلَآ إِثْمَ عَلَيْهِ ۚ لِمَنِ ٱتَّقَىٰ ۗ وَٱتَّقُوا۟ ٱللَّهَ وَٱعْلَمُوٓا۟ أَنَّكُمْ إِلَيْهِ تُحْشَرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tremember\tAllah in\tthe\tcounted\tdays;\t\nso\t whoever\t hastens\t by\t departing\t in\t two\t\ndays,\tthere\tis\tno\tsin\ton\thim;\tand\twhoever\t\nstays\t on,\t there\tis\t no\t sin\t for\t him\t- for\t the\t\npious;\t and\t keep\t fearing\t Allah,\t and\t know\t\nwell\tthat\tit\tis\tto\tHim\tyou\twill\tbe\traised.",
    "romanUrduTranslationText": "Aur\t Allah\t ki\t yād\t karo\t gine\t huwe\t dinoñ\t\nmeiñ to\t jo\t jaldi\t karke\t do\t din\t meiñ\t chalā\t\njāye\tus\tpar\tkuchh\tgunah\tnahi"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "204",
    "arabicText": "وَمِنَ ٱلنَّاسِ مَن يُعْجِبُكَ قَوْلُهُۥ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا وَيُشْهِدُ ٱللَّهَ عَلَىٰ مَا فِى قَلْبِهِۦ وَهُوَ أَلَدُّ ٱلْخِصَامِ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t among\t men\t is\t one\t whose\t\nconversation\tmay\tplease\tyou\tin\tthe\tlife\tof\t\nthis\tworld,\tand\the\tbrings\tAllah as\twitness\t\nto\twhat\tis\tin\this\theart,\twhereas\the\tis\t the\t\nbiggest\tquarreller!",
    "romanUrduTranslationText": ". Aur\t jo\t reh\t jāye\t to\t us\t par\t gunāh\t nahi\t\nparhez-gār\tke\tliye\taur\tAllah\tse\tdarte\traho\t\naur\t jān\t rakho\t ke\t tumheiñ\t usi\t ki\t taraf\t\nuthna\thai"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "205",
    "arabicText": "وَإِذَا تَوَلَّىٰ سَعَىٰ فِى ٱلْأَرْضِ لِيُفْسِدَ فِيهَا وَيُهْلِكَ ٱلْحَرْثَ وَٱلنَّسْلَ ۗ وَٱللَّهُ لَا يُحِبُّ ٱلْفَسَادَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t when\t he\t turns\t away,\t he\t creates\t\nturmoil\t in\t the\t earth\t and\t destroys\t crops\t\nand\t lives;\t and\t Allah is\t not\t pleased\t with\t\nturmoil.",
    "romanUrduTranslationText": "Aur\t b’az\t ādmi\t woh\t hai\t ke\t duniya\t ki\t\nzindagi\tmeiñ\tuski\tbāt\ttujhe\tbhali\tlage\taur\t\napne\t dil\t ki\t bāt\t par\t Allah\t ko\t gawāh\t lāye\t\naur\twoh\tsabse\tbada\tjhagdālu\thai."
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "206",
    "arabicText": "وَإِذَا قِيلَ لَهُ ٱتَّقِ ٱللَّهَ أَخَذَتْهُ ٱلْعِزَّةُ بِٱلْإِثْمِ ۚ فَحَسْبُهُۥ جَهَنَّمُ ۚ وَلَبِئْسَ ٱلْمِهَادُ",
    "urduTranslationText": "",
    "englishTranslationText": "And\twhen\tit\tis\tsaid\tto\thim,\t“Fear\tAllah”,\the\t\nbecomes\tmore\tresolute\tin\tcommitting\tsin\t\n- therefore\t hell\tis\t sufficient\t for\t such;\tand\t\nthat\t is\t indeed,\t a\t very\t wretched\t resting\t\nplace.",
    "romanUrduTranslationText": " Aur\tjab\tpeeth\tphere\tto\tzameen\tmeiñ\tfasād\t\ndālta\tphire\taur\tkheti\taur\tjāneiñ\ttabāh\tkare\t\naur\tAllah\tfasād\tse\trāzi\tnahi"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "207",
    "arabicText": "وَإِذَا قِيلَ لَهُ ٱتَّقِ ٱللَّهَ أَخَذَتْهُ ٱلْعِزَّةُ بِٱلْإِثْمِ ۚ فَحَسْبُهُۥ جَهَنَّمُ ۚ وَلَبِئْسَ ٱلْمِهَادُ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tamong\tmen\tis\t one\twho\t sells\t himself\t\nto\tseek\tthe\tpleasure\tof\tAllah;\tand\tAllah is\t\nMost\t Compassionate\t towards\t the\t\nbondmen.\t",
    "romanUrduTranslationText": "Aur\tjab\tusse\t kahā\tjāye\t ke\tAllah\t se\tdar\t to\t\nusey\t aur\t zid\t chadhe\t gunāh\t ki\t aise\t ko\t\ndozakh\t kāfi\t hai\t aur\t woh\t zaroor\t bahut\t\nbura\tbichauna\thai."
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "208",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱدْخُلُوا۟ فِى ٱلسِّلْمِ كَآفَّةًۭ وَلَا تَتَّبِعُوا۟ خُطُوَٰتِ ٱلشَّيْطَـٰنِ ۚ إِنَّهُۥ لَكُمْ عَدُوٌّۭ مُّبِينٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "O\tPeople\twho\tBelieve!\tEnter\tIslam\tin\tfull\t-\nand\tdo\tnot\tfollow\tthe\tfootsteps\tof\tthe\tdevil;\tindeed\the\tis\tyour\topen\tenemy.\t\t",
    "romanUrduTranslationText": ". Aur\tkoi\tādmi\tapni\tjān\tbechta\thai\tAllah\tki\t\nmarzi\tchāhne\tmeiñ\taur\tAllah\tbandoñ\tpar\t\nmaherbān\t hai\t aey\t Imān\t wālo\tislām\tmeiñ\t\npooore\tdākhil\tho\taur\tshaitān\tke\tqadamoñ\t\npar\tna\tchalo\tbeshak\twoh\ttumhāra\tkhula\tdushman\thai"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "209",
    "arabicText": "فَإِن زَلَلْتُم مِّنۢ بَعْدِ مَا جَآءَتْكُمُ ٱلْبَيِّنَـٰتُ فَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ عَزِيزٌ حَكِيمٌ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tif\tyou\trenege,\teven\tafter\tthe\tclear\tcommands\thave\tcome\tto\tyou,\tthen\tknow\twell\tthat\tAllah\nis\tAlmighty,\tWise.\t\t\t",
    "romanUrduTranslationText": "Aur\tagar\tis\tke\tb'ad\tbhi\tbichlo (Behko) ke\ttumhāre\tpās\traushan\thukm\tāa\tchuke\tto\tjān\tlo\tke\tAllah\t\nzabardast\thikmat\twāla\thai"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "210",
    "arabicText": "هَلْ يَنظُرُونَ إِلَّآ أَن يَأْتِيَهُمُ ٱللَّهُ فِى ظُلَلٍۢ مِّنَ ٱلْغَمَامِ وَٱلْمَلَـٰٓئِكَةُ وَقُضِىَ ٱلْأَمْرُ ۚ وَإِلَى ٱللَّهِ تُرْجَعُ ٱلْأُمُورُ",
    "urduTranslationText": "",
    "englishTranslationText": "What\t are\t they\t waiting\t for,\t except\t that\t Allah’s\t punishment\t should\t come\t through\t stretched\t\nclouds\tand\t the\tangels\t descend\tand\t the\tmatter\t be\t finished?\tAnd\tall\tmatters\tare\t directed\t only\t\ntowards\tAllah.\t\t\t\t",
    "romanUrduTranslationText": "Kāhe\tke\tintezār\tmeiñ\thaiñ\tmagar\t yahi\tAllah\tka\t‘azab\tāaye\tchhāye\thuwe\tbādloñ\tmeiñ\t farishte\t\nutreiñ\taur\tkām\tho\tchuke\taur\tsab\tkāmoñ ki\truju’Allah\thi\tki\ttaraf\t\thai"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "211",
    "arabicText": "سَلْ بَنِىٓ إِسْرَٰٓءِيلَ كَمْ ءَاتَيْنَـٰهُم مِّنْ ءَايَةٍۭ بَيِّنَةٍۢ ۗ وَمَن يُبَدِّلْ نِعْمَةَ ٱللَّهِ مِنۢ بَعْدِ مَا جَآءَتْهُ فَإِنَّ ٱللَّهَ شَدِيدُ ٱلْعِقَابِ",
    "urduTranslationText": "",
    "englishTranslationText": "Ask\t the\t Descendants\t of\t Israel\t how\tmany\t\nclear\t signs\t We\t gave\t them;\t and\t whoever\t\nalters\t Allah’s\t favour\t which\t came\t to\t him,\t\nthen\tindeed\tAllah’s\tpunishment\tis\tsevere.\t\t\t\t",
    "romanUrduTranslationText": "Bani\t Isra’il\t se\t poocho\t ham\t ne\t kitni\t\nraushan\t nishāniyāñ\t unheiñ\t deiñ\t aur\t jo\t\nAllah\t ki\t āyi\t huwi\t ne'mat\t ko\t badal\t de\t to\t\nbeshak Allah\tka\t‘azāb\tsakht\thai."
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "212",
    "arabicText": "زُيِّنَ لِلَّذِينَ كَفَرُوا۟ ٱلْحَيَوٰةُ ٱلدُّنْيَا وَيَسْخَرُونَ مِنَ ٱلَّذِينَ ءَامَنُوا۟ ۘ وَٱلَّذِينَ ٱتَّقَوْا۟ فَوْقَهُمْ يَوْمَ ٱلْقِيَـٰمَةِ ۗ وَٱللَّهُ يَرْزُقُ مَن يَشَآءُ بِغَيْرِ حِسَابٍۢ",
    "urduTranslationText": "",
    "englishTranslationText": "The\t life\t of\t this\t world\t is\t made\t to\t appear\t\nbeautiful\t in\t the\t sight\t of\t the\t disbelievers,\t\nand\t they\t make\t fun\t of\t the\t believers;\t and\t\nthe\t pious\twill\t be\t above\t them\t on\t the\tDay\t\nof\t Resurrection;\t and\t Allah may\t give\t to\t\nwhomever\tHe\twills,\twithout\taccount.\t\t\t\t",
    "romanUrduTranslationText": ". Kāfiroñ\t ki\t nigah\t meiñ\t duniya\t ki\t zindagi\t\narāsta\t ki\t gyi\t aur\t Musalmānoñ\t se\t hañste\t\nhaiñ\t aur\t dar\t wāle\t unse\t upar\t hoñge\t\nQiyamat\t ke\t din\t aur\t Khuda\t jise\t chāhe\t be\t\nginti\tde"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "213",
    "arabicText": "كَانَ ٱلنَّاسُ أُمَّةًۭ وَٰحِدَةًۭ فَبَعَثَ ٱللَّهُ ٱلنَّبِيِّـۧنَ مُبَشِّرِينَ وَمُنذِرِينَ وَأَنزَلَ مَعَهُمُ ٱلْكِتَـٰبَ بِٱلْحَقِّ لِيَحْكُمَ بَيْنَ ٱلنَّاسِ فِيمَا ٱخْتَلَفُوا۟ فِيهِ ۚ وَمَا ٱخْتَلَفَ فِيهِ إِلَّا ٱلَّذِينَ أُوتُوهُ مِنۢ بَعْدِ مَا جَآءَتْهُمُ ٱلْبَيِّنَـٰتُ بَغْيًۢا بَيْنَهُمْ ۖ فَهَدَى ٱللَّهُ ٱلَّذِينَ ءَامَنُوا۟ لِمَا ٱخْتَلَفُوا۟ فِيهِ مِنَ ٱلْحَقِّ بِإِذْنِهِۦ ۗ وَٱللَّهُ يَهْدِى مَن يَشَآءُ إِلَىٰ صِرَٰطٍۢ مُّسْتَقِيمٍ",
    "urduTranslationText": "",
    "englishTranslationText": "Mankind\t was\t on\t one\t religion;\t so\t Allah\nsent\t Prophets\t giving\t glad\t tidings\t and\t\nwarnings\t- and\twith\t them\t sent\t down\t the\t\ntrue\t Book\t to\t judge\t between\t mankind\t on\t\ntheir\tdifferences;\tand\tonly\tthose\tto\twhom\t\nit\t was\t given\t created\t disputes\t regarding\t\nthe\tBook,\tafter\tclear\tcommands\thad\tcome\t\nto\tthem,\tdue\tto\thostility\tof\tone\tanother;\tso\t\nAllah,\t by\t His\t command,\t made\t the\t truth\t\nclear\t to\t the\t believers,\t concerning\t their\t\ndisputes;\tand\tAllah may\tguide\twhomever\t\nHe\twills\tto\tthe\tStraight Path.\t\t\t\t\t",
    "romanUrduTranslationText": "\t\nLog\tek\tdeen\tpar\tthey\tphir\tAllah\tne\tAñbiya\t\nbheje\t khush-khabri\t dete\t aur\t dar\t sunāte\t\naur\t unke\t sāth\t sachchi\t kitāb\t utāri\t ke\twoh\t\nlogoñ\tmeiñ\tunke\tikhtilāfoñ\tka\tfaisla\tkarde\t\naur\tkitāb\tmeiñ\tikhtilāf\tunhiñ\tne\tdāla\tjinko\t\ndi\tgayi\t thi\tb'ād\tiske\t ke\tunke\tpās\t raushan\t\nhukm\t āa\t chuke\t āapas\t ki\t sarkashi\t se\t to\t\nAllah\t ne\t Imān\t wāloñ\t ko\t woh\t Haq\t bāt\nsujha\t di\t jis\t meiñ\t jhagad\t rahe\t they\t apne\t\nhukm\t se\t aur\t Allah\t jise\t chāhe\t seedhi\t rāh\t\ndikhāye."
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "214",
    "arabicText": "أَمْ حَسِبْتُمْ أَن تَدْخُلُوا۟ ٱلْجَنَّةَ وَلَمَّا يَأْتِكُم مَّثَلُ ٱلَّذِينَ خَلَوْا۟ مِن قَبْلِكُم ۖ مَّسَّتْهُمُ ٱلْبَأْسَآءُ وَٱلضَّرَّآءُ وَزُلْزِلُوا۟ حَتَّىٰ يَقُولَ ٱلرَّسُولُ وَٱلَّذِينَ ءَامَنُوا۟ مَعَهُۥ مَتَىٰ نَصْرُ ٱللَّهِ ۗ أَلَآ إِنَّ نَصْرَ ٱللَّهِ قَرِيبٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "Are\t you\t under\t the\t illusion\t that\t you\t will\t\nenter\t Paradise\t whereas\t the\t suffering,\t\nwhich\t came\t to\t those\t before\t you,\t has\t not\t\nyet\tcome\t to\t you?\tHardship\tand\tadversity\t\nbefell\t them\tand\t they\twere\t shaken,\t to\t the\t\nextent\t that\t the\tNoble\t Messenger\t and\t the\t\nbelievers\talong\twith\thim\tsaid,\t“When\twill\t\nthe\thelp\tof\tAllah come?”;\tpay\theed!\tAllah’s\t\nhelp\tis\tsurely\tnear\t\t\t\t",
    "romanUrduTranslationText": ". Kya\t is\t gumān\t meiñ\t ho\t ke\t jannat\t meiñ\t\nchale\t jāoge\t aur\t abhi\t tum\t par\t agloñ\t ki\t si\t\nrudād\tna\tāayi\tpahoñchi\tunheiñ\tsakhti\taur\t\nshiddat\taur\thila\thila\tdāle\tgye\tyahāñ\ttak\tke\t\nkeh\t utha\t Rasool\t aur\t uske\t sāth\t ke\t Imān\t\nwāle\t jab\t āyegi\t Allah\t ki\t madad\t sun\t lo\t\nbeshak\tAllah\tki\tmadad\tqareeb\thai."
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "215",
    "arabicText": "يَسْـَٔلُونَكَ مَاذَا يُنفِقُونَ ۖ قُلْ مَآ أَنفَقْتُم مِّنْ خَيْرٍۢ فَلِلْوَٰلِدَيْنِ وَٱلْأَقْرَبِينَ وَٱلْيَتَـٰمَىٰ وَٱلْمَسَـٰكِينِ وَٱبْنِ ٱلسَّبِيلِ ۗ وَمَا تَفْعَلُوا۟ مِنْ خَيْرٍۢ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": ". They\task\tyou\twhat\t they\tshould\tspend;\tsay,\t “Whatever\tyou\tspend\t for\tgood,\tis\t for\tparents\tand\t\nnear\trelatives\tand\torphans\tand\tthe\tneedy\tand\tthe\ttraveller”;\tand\twhatever\tgood\tyou\tdo,\tindeed\t\nAllah knows\tit\t\t\t",
    "romanUrduTranslationText": " Tum\tse\tpoochte\thaiñ\tkya\tkharch\tkareiñ\ttum\tfarmao\tjo\tkuchh\tmāl\tneki\tmeiñ\tkharch\tkaro\tto\twoh\t\nmāñ\t\tbāp\taur\tqareeb\tke\trisht-e-dāroñ\taur\tyateemoñ\taur\tmohtājoñ\taur\trāh-geer\tke\tliye\thai\taur\t\njo\tbhalāi\tkaro\tbeshak\tAllah\tuse\tjānta\thai."
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "216",
    "arabicText": "كُتِبَ عَلَيْكُمُ ٱلْقِتَالُ وَهُوَ كُرْهٌۭ لَّكُمْ ۖ وَعَسَىٰٓ أَن تَكْرَهُوا۟ شَيْـًۭٔا وَهُوَ خَيْرٌۭ لَّكُمْ ۖ وَعَسَىٰٓ أَن تُحِبُّوا۟ شَيْـًۭٔا وَهُوَ شَرٌّۭ لَّكُمْ ۗ وَٱللَّهُ يَعْلَمُ وَأَنتُمْ لَا تَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Fighting\t in\t Allah's\t cause\t is\t ordained\t for\t\nyou,\twhereas\tit\tis\tdisliked\tby\tyou;\tand\tit\tis\t\npossible\t that\t you\t hate\t a\t thing\t which\t is\t\nbetter\t for\tyou;\tand\tit\tis\tpossible\t that\tyou\t\nlike\t a\t thing\t which\t is\t bad\t for\t you;\t and\t\nAllah knows,\tand\tyou\tdo\tnot\tknow\t\t",
    "romanUrduTranslationText": " Tum\tpar\tfarz\thua\tkhuda\tki\trāh\tmeiñ\tladna\t\naur\twoh\ttumheiñ\tna-gawār\thai\taur\tqareeb\t\nhai\tke\tkoi\tbāt\t tumheiñ\tburi\tlage\taur\twoh\t\ntumhāre\t haq\t meiñ\t behtar\t ho\t aur\t qareeb\t\nhai\t ke\t koi\t bāt\t tumheiñ\t pasand\t āye\t aur\t\nwoh\t tumhāre\thaq\tmeiñ\tburi\tho\taur\tAllah\t\njānta\thai\taur\ttum\tnahi\tjānte"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "217",
    "arabicText": "يَسْـَٔلُونَكَ عَنِ ٱلشَّهْرِ ٱلْحَرَامِ قِتَالٍۢ فِيهِ ۖ قُلْ قِتَالٌۭ فِيهِ كَبِيرٌۭ ۖ وَصَدٌّ عَن سَبِيلِ ٱللَّهِ وَكُفْرٌۢ بِهِۦ وَٱلْمَسْجِدِ ٱلْحَرَامِ وَإِخْرَاجُ أَهْلِهِۦ مِنْهُ أَكْبَرُ عِندَ ٱللَّهِ ۚ وَٱلْفِتْنَةُ أَكْبَرُ مِنَ ٱلْقَتْلِ ۗ وَلَا يَزَالُونَ يُقَـٰتِلُونَكُمْ حَتَّىٰ يَرُدُّوكُمْ عَن دِينِكُمْ إِنِ ٱسْتَطَـٰعُوا۟ ۚ وَمَن يَرْتَدِدْ مِنكُمْ عَن دِينِهِۦ فَيَمُتْ وَهُوَ كَافِرٌۭ فَأُو۟لَـٰٓئِكَ حَبِطَتْ أَعْمَـٰلُهُمْ فِى ٱلدُّنْيَا وَٱلْـَٔاخِرَةِ ۖ وَأُو۟لَـٰٓئِكَ أَصْحَـٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَـٰلِدُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "They\t ask\t you\t the\t decree\t regarding\t\nfighting\tin\t the\tsacred\tmonth;\tsay\t(O\t dear\t\nProphet\tMuhammad - peace\t and\t blessings\t\nbe\tupon\thim),\t“Fighting\tin\tit\tis\ta\tgreat\tsin;\t\nand\tto\tprevent\tfrom\tthe\tway\tof\tAllah,\tand\t\nnot\t to\t believe\t in\t Him\t and\t to\t prevent\t\n(people)\t from\t the\t Sacred\t Masjid and\t to\t\nexpel\tits\tresidents\t- these\tare\tgreater\tsins\t\nbefore\tAllah\";\tand\t the\t turmoil\t they\tcause\t\nis\t worse\t than\t killing;\t and\t they\t will\t keep\t\nfighting\t you\t till\t they\t turn\t you\taway\t from\t\nyour\t religion,\t if\t they\t can;\t and\t whoever\t\namong\t you\t turns\t renegade\t and\t dies\t as\t a\t\ndisbeliever,\t then\t their\t deeds\t are\t wasted\t\nin\t this\t world\t and\t in\t the\t Hereafter;\t and\t\nthey\t are\t the\t people\t of\t hell;\t they\t will\t\nremain\tin\tit\tforever.\t\t\t",
    "romanUrduTranslationText": " . Tum\t se\t poochte\t haiñ\tMah-e-Harām\tmeiñ\t\nladne\tka\thukm\t tum\t farmao\tis\tmeiñ\tladna\t\nbada\tgunāh\thai\taur\tAllah\tki\trāh\tse\troñkna\t\naur\t us\t par\t Imān\t na\t lāna\t aur\t Masjid-e\u0002Harām se\t roñkna\t aur\t uske\t basne\t wāloñ\t\nko\tnikāl\tdena\tAllah\tke\tnazdeek\tyeh\tgunāh\t\nis\tse\tbhi\tbade\thaiñ\taur\tinka\t fasād\tqatl\tse\t\nsakht\t tar\t hai\t aur\t hamesha\t tum\t se\t ladte\t\nraheñge\t yahāñ\t tak\t ke\t tumheiñ\t tumhāre\t\ndeen\tse\tpher\tdeiñ\tagar\tban\tpade\taur\ttum\t\nmeiñ\tjo\tkoi\tapne\tdeen\tse\tphire\tphir\tkāfir\t\nhokar\t mare\t to\t un\t logoñ\t ka\t kiya\t akārat\t\ngaya\t duniya\t meiñ\t aur\t ākhirat\t meiñ\t aur\t\nwoh\t dozakh\t wāle\t haiñ\t unheiñ\t us\t meiñ\t\nhamesha\trahna."
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "218",
    "arabicText": "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَٱلَّذِينَ هَاجَرُوا۟ وَجَـٰهَدُوا۟ فِى سَبِيلِ ٱللَّهِ أُو۟لَـٰٓئِكَ يَرْجُونَ رَحْمَتَ ٱللَّهِ ۚ وَٱللَّهُ غَفُورٌۭ رَّحِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "Those\t who\t believed,\t and\t those\t who\t\nmigrated\tfor\tthe\tsake\tof\tAllah,\tand\tfought\t\nin\t Allah's\t cause\t - they\t are\t hopeful\t of\t\ngaining Allah’s\t mercy;\t and\t Allah is\t Oft\t\nForgiving,\tMost\tMerciful.\t\t\t\t",
    "romanUrduTranslationText": "Woh\tjo\tImān\tlāye\taur\twoh\tjinhoñ\tne\tAllah\t\nke\tliye\tapne\tghar\tbār\tchhode\taur\tAllah\tki\t\nrāh\tmeiñ\tlade\twho\tRahmat-e-Ilāhi\tke\tummid-wār\thaiñ\taur\tAllah\tbakhsh\tne\twāla\tmaherbān\thai."
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "219",
    "arabicText": "۞ يَسْـَٔلُونَكَ عَنِ ٱلْخَمْرِ وَٱلْمَيْسِرِ ۖ قُلْ فِيهِمَآ إِثْمٌۭ كَبِيرٌۭ وَمَنَـٰفِعُ لِلنَّاسِ وَإِثْمُهُمَآ أَكْبَرُ مِن نَّفْعِهِمَا ۗ وَيَسْـَٔلُونَكَ مَاذَا يُنفِقُونَ قُلِ ٱلْعَفْوَ ۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمُ ٱلْـَٔايَـٰتِ لَعَلَّكُمْ تَتَفَكَّرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "They\t ask\t you\t the\t decree\t regarding\t wine\t (intoxicants)\t and\t gambling;\t say\t (O\t dear\t Prophet\t\nMuhammad - peace\tand\tblessings\tbe\tupon\thim),\t“In\tboth\tis\tgreat\tsin,\tand\tsome\tworldly\tbenefit\t\nfor\tmen\t- but\ttheir\tsin\tis\tgreater\tthan\ttheir\tbenefit”;\tand\tthey\task\tyou\twhat\tthey\tshould\tspend;\t\nsay,\t“That\twhich\tremains\tspare\t(surplus)”;\tthis\tis\thow\tAllah explains\tHis\tverses\tto\tyou,\tso\tthat\t\nyou\tmay\tthink.\t\t\t\t\t",
    "romanUrduTranslationText": "Tum\tse\tsharāb\taur\tjuweñ\tka\thukm\tpoochte\thaiñ\ttum\tfarmā\tdo\tke\tin\tdonoñ\tmeiñ\tbada\tgunāh\thai\t\naur\tlogoñ\tke\tkuchh\tdunyavi\tnafa'\tbhi\taur\tunka\tgunāh\tunke\tnafa'\tse\tbada\thai\taur\ttum\tse\tpoochte\t\nhaiñ\tkya\tkharch\tkareiñ\ttum\tfarmao\tjo\tfāzil\tbache\tisi\ttarah\tAllah\ttum\tse\tāyateiñ\tbayān\tfarmāta\t\nhai\tke\tkaheeñ"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "220",
    "arabicText": "فِى ٱلدُّنْيَا وَٱلْـَٔاخِرَةِ ۗ وَيَسْـَٔلُونَكَ عَنِ ٱلْيَتَـٰمَىٰ ۖ قُلْ إِصْلَاحٌۭ لَّهُمْ خَيْرٌۭ ۖ وَإِن تُخَالِطُوهُمْ فَإِخْوَٰنُكُمْ ۚ وَٱللَّهُ يَعْلَمُ ٱلْمُفْسِدَ مِنَ ٱلْمُصْلِحِ ۚ وَلَوْ شَآءَ ٱللَّهُ لَأَعْنَتَكُمْ ۚ إِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "Before\t you\t execute\t your\t deeds\t of\t this\t\nworld\tand\t of\t the\tHereafter;\tand\t they\task\t\nyou\t the\t decree\t regarding\t orphans;\t say,\t\n“To\tdo\tgood\ttowards\tthem\tis\tbetter;\tand\tif\t\nyou\t combine\t your\t expenses\t with\t theirs,\t\nthey\tare\tyour\tbrothers”;\tand\tAllah knows\t\nvery\t well\t the\t one\t who\t spoils\t from\t him\t\nwho\t improves;\t and\t if\t Allah willed,\t He\t\ncould\thave\tput\tyou\tin\thardship;\tand\tAllah\nis\tAlmighty,\tWise.\t\t\t\t\t\t",
    "romanUrduTranslationText": "Tum\tDuniya\taur\tĀkhirat\tke\tkām\tsoch\tkar\t\nkaro\t aur\t tum\t se\t yateemoñ\t ka\t mas'ala\t\npoochte\t haiñ\t tum\t farmao\t unka\t bhalā\t\nkarna\t behtar\t hai\t aur\t agar\t apna\t unka\t\nkharch\tmila\tlo\t to\twoh\t tumhāre\tbhāi\thaiñ\t\naur\t khuda\t khoob\t jānta\t hai\t bigādne\t wāle\nko\t sawārne\t wāle\t se\t aur\t Allah\t chāhta\t to\t\ntumheiñ\t mashaqqat\t meiñ\t dālta\t beshak\t\nAllah\tzabardast\thikmat\twāla\thai"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "221",
    "arabicText": "فِى ٱلدُّنْيَا وَٱلْـَٔاخِرَةِ ۗ وَيَسْـَٔلُونَكَ عَنِ ٱلْيَتَـٰمَىٰ ۖ قُلْ إِصْلَاحٌۭ لَّهُمْ خَيْرٌۭ ۖ وَإِن تُخَالِطُوهُمْ فَإِخْوَٰنُكُمْ ۚ وَٱللَّهُ يَعْلَمُ ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tdo\tnot\tmarry\tpolytheist\twomen\tuntil\t\nthey\t become\tMuslims;\t for\t undoubtedly\t a\t\nMuslim\t bondwoman\t is\t better\t than\t a\t\npolytheist\twoman,\talthough\tyou\tmay\tlike\t\nher;\t and\t do\t not\t give\t your\t women\t in\t\nmarriage\t to\t polytheist\t men\t until\t they\t\naccept\t faith;\t for\t undoubtedly\t a\t Muslim\t\nslave\tis\tbetter\t than\ta\tpolytheist,\talthough\t\nyou\tmay\tlike\thim;\tthey\tinvite\tyou\ttowards\t\nthe\t fire;\t and\t Allah invites\t towards\t\nParadise\t and\t forgiveness\t by\t His\t\ncommand;\t and\t explains\t His\t verses\t to\t\nmankind\t so\t that\t they\t may\t accept\t\nguidance.\t\t\t\t\t\t",
    "romanUrduTranslationText": "Aur\tshirk\twāli\taurtoñ\tse\tnikāh\tna\tkaro\tjab\t\ntak\t Musalman\t na\t ho\t jāyeñ\t aur\t beshak\t\nMusalman\t laundi\t mushrika\t se\t achchi\t\nagarche\ttumheiñ\twoh\tbhāti\tho\tmushrikoñ\t\nke\t nikāh\t me\t na\t do\t jab\t tak\t woh\t Imān\t na\t\nlāyeiñ\t aur\t beshak\t Musalman\t ghulām\t\nmushrik\t se\t achha\t agarche\t woh\t tumheiñ\t\nbhāta\tho\twoh\tdozakh\tki\ttaraf\t\tbulāte\thaiñ\t\naur\t Allah\t Jannat\t aur\t bakhshish\t ki\t taraf\t\t\nbulāta\thai\tapne\thukm\tse\taur\tapni\tĀyateiñ\t\nlogoñ\t ke\t liye\t bayān\t karta\t hai\t ke\t kaheeñ\t\nwoh\tnaseehat\tmāneñ\t"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "222",
    "arabicText": "وَيَسْـَٔلُونَكَ عَنِ ٱلْمَحِيضِ ۖ قُلْ هُوَ أَذًۭى فَٱعْتَزِلُوا۟ ٱلنِّسَآءَ فِى ٱلْمَحِيضِ ۖ وَلَا تَقْرَبُوهُنَّ حَتَّىٰ يَطْهُرْنَ ۖ فَإِذَا تَطَهَّرْنَ فَأْتُوهُنَّ مِنْ حَيْثُ أَمَرَكُمُ ٱللَّهُ ۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلتَّوَّٰبِينَ وَيُحِبُّ ٱلْمُتَطَهِّرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t they\t ask\t you\t the\t decree\t concerning\t\nmenstruation;\t say,\t “It\t is\t an\t impurity,\t so\t\nstay\taway\tfrom\twomen\tat\tsuch\ttimes,\tand\t\ndo\tnot\tcohabit\twith\t them\tuntil\t they\thave\t\ncleansed\tthemselves;\tso\twhen\tthey\thave\tcleansed\tthemselves,\tcohabit\twith\tthem\tthe\tway\tAllah\nhas\tdetermined\t for\tyou”;\tindeed\tAllah loves\tthose\twho\trepent\tprofusely,\tand\tloves\tthose\twho\t\nkeep\tclean.\t\t\t\t\t\t\t",
    "romanUrduTranslationText": "Aur\t tum\t se\t poochte\t haiñ\t haiz\t ka\t hukm\t\nTum\tfarmao\twoh\tna-pāki\thai\tto\taurtoñ\tse\t\nalag\traho\thaiz\tke\tdinoñ\taur\tunse\tnazdeeki\t\nna\tkaro\tjab\ttak\tpāk\tna\tho leiñ\tphir\tjub\tPāk\t\nho jāyeiñ\tto\tunke\tpās\tjāo\tjahāñ\tse\tAllah\tne\ttumheiñ hukm\tdiya\tbeshak\tAllah\tpasand\trakhta\thai\t\nbahut\ttauba\tkarne\twāloñ\tko\taur\tpasand\trakhta\thai\tsuthroñ\tko\t"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "223",
    "arabicText": "نِسَآؤُكُمْ حَرْثٌۭ لَّكُمْ فَأْتُوا۟ حَرْثَكُمْ أَنَّىٰ شِئْتُمْ ۖ وَقَدِّمُوا۟ لِأَنفُسِكُمْ ۚ وَٱتَّقُوا۟ ٱللَّهَ وَٱعْلَمُوٓا۟ أَنَّكُم مُّلَـٰقُوهُ ۗ وَبَشِّرِ ٱلْمُؤْمِنِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Your\twomen\tare\ta\t tillage\t for\tyou;\tso\tcome\tinto\tyour\t tillage\tas\tyou\twill;\tand\t first\tperform\t the\t\ndeeds\tthat\tbenefit\tyou;\tand\tkeep\tfearing\tAllah,\tand\tknow\twell\tthat\tyou\thave\tto\tmeet\tHim;\tand\t\n(O\tdear\tProphet\tMuhammad - peace\tand\tblessings\tbe\tupon\thim)\tgive\tglad\ttidings\tto\tthe\tMuslims\t\t\t\t\t\t\t",
    "romanUrduTranslationText": "Tumhāri\t aurteiñ\t tumhāre\tliye\t khetiyāñ\t haiñ\t to\t āao\t apni\t kheti meiñ\tjis\t tarah\t chāho\t aur\t apne\t\nbhale\tka\tkām\tpahle\tkaro\taur\tAllah\tse\tdarte\traho\taur\tjān\trakho\tke\ttumheiñ\tus\tse\tmilna\thai aur\t\naey\tMehboob!\tBashārat\tdo\tImān\twāloñ\tko"
  }
]
    