[
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "10",
    "arabicText": "إِنَّ ٱلَّذِينَ كَفَرُوا۟ لَن تُغْنِىَ عَنْهُمْ أَمْوَٰلُهُمْ وَلَآ أَوْلَـٰدُهُم مِّنَ ٱللَّهِ شَيْـًۭٔا ۖ وَأُو۟لَـٰٓئِكَ هُمْ وَقُودُ ٱلنَّارِ",
    "urduTranslationText": "",
    "englishTranslationText": "Indeed\t for\t those\t who\t disbelieve,\t neither\t\ntheir\t wealth\t nor\t their\t offspring\t will\t help\t\nto\tsave\tthem\tin\tthe\tleast\tfrom\tAllah;\tand\tit\t\nis\tthey\twho\tare\tfuel\tfor\tthe\tfire.\t",
    "romanUrduTranslationText": "Beshak\t woh\tjo\t kāfir\t huwe\t un\t ke\tmāl\t aur\t\nunki\taulād\tAllah\tse\tunheiñ\tkuch\tna\tbacha\t\nsakeñge\taur\twohi\tdozakh\tke\teeñdhan\thaiñ"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "11",
    "arabicText": "كَدَأْبِ ءَالِ فِرْعَوْنَ وَٱلَّذِينَ مِن قَبْلِهِمْ ۚ كَذَّبُوا۟ بِـَٔايَـٰتِنَا فَأَخَذَهُمُ ٱللَّهُ بِذُنُوبِهِمْ ۗ وَٱللَّهُ شَدِيدُ ٱلْعِقَابِ",
    "urduTranslationText": "",
    "englishTranslationText": "Like\tthe\tway\tof\tFiraun’s\tpeople,\tand\tthose\t\nbefore\t them;\t they\t denied\t Our\t signs;\t so\t\nAllah seized\t them\t because\t of\t their\t sins;\t\nand\tAllah’s\tpunishment\tis\tsevere.\t",
    "romanUrduTranslationText": ". Jaise\t Fir'aun\t wāloñ\t aur\t un\t se\t agloñ\t ka\t\ntareeqa\t unhoñ\t ne\t hamāri\t āayatyeñ\t\njhutlayiñ\t to\t Allah\t ne\t unke\t gunahoñ\t par\t\nunko\tpakda\taur\tAllah\tka\tazāb\tsakht"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "12",
    "arabicText": "قُل لِّلَّذِينَ كَفَرُوا۟ سَتُغْلَبُونَ وَتُحْشَرُونَ إِلَىٰ جَهَنَّمَ ۚ وَبِئْسَ ٱلْمِهَادُ",
    "urduTranslationText": "",
    "englishTranslationText": "Say\t (O\t dear\t Prophet\t Muhammad - peace\t\nand\t blessings\t be\t upon\t him)\t to\t the\t\ndisbelievers,\t “Very\t soon\t you\t shall\t be\t\novercome\t and\t driven\t towards\t hell;\t and\t\nthat\tis\ta\twretched\tresting-place.”\t\t",
    "romanUrduTranslationText": "Farma\t do\t kāfiroñ\t se,\t koi\t dam\t jāta\t hai\t ke\t\ntum\t maghloob\t hoge\t aur\t dozakh\t ki\t taraf\t\nhāñke\t jao\t ge\t aur\t woh\t bahot\t hi\t bura\t\nbichhauna\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "13",
    "arabicText": "قَدْ كَانَ لَكُمْ ءَايَةٌۭ فِى فِئَتَيْنِ ٱلْتَقَتَا ۖ فِئَةٌۭ تُقَـٰتِلُ فِى سَبِيلِ ٱللَّهِ وَأُخْرَىٰ كَافِرَةٌۭ يَرَوْنَهُم مِّثْلَيْهِمْ رَأْىَ ٱلْعَيْنِ ۚ وَٱللَّهُ يُؤَيِّدُ بِنَصْرِهِۦ مَن يَشَآءُ ۗ إِنَّ فِى ذَٰلِكَ لَعِبْرَةًۭ لِّأُو۟لِى ٱلْأَبْصَـٰرِ",
    "urduTranslationText": "",
    "englishTranslationText": "Indeed\tthere\twas\ta\tsign\tfor\tyou\tin\tthe\ttwo\t\ngroups\t that\tclashed;\tone\tarmy\t fighting\tin\t\nAllah's\t cause,\t against\t the\t other\t of\t\ndisbelievers,\t whom\t they\t (the\t Muslims)\t\nsaw\t with\t their\t eyes,\t as\t twice\t their\t own\t\nnumber;\t and\t Allah strengthens\t with\t His\t\nhelp\twhomever\tHe\twills;\tindeed\tin\tthis\tis\t\na\tlesson\tfor\tthe\tintelligent,\tto\tbe\tlearnt\tby\t\nobserving.\t\t\t",
    "romanUrduTranslationText": "Beshak\t tumhāre\t liye\t nishāni\t thi\t do\t\ngirohoñ\t meiñ\t jo\t āpas\t meiñ\t bhid\t pade\t ek\t\njat-tha\t(giroh)\tAllah\tki\trāh\tmeiñ\tladta\taur\t\ndoosra\t kāfir\t ke\t unheiñ\t ānkhoñ\t dekha\t\napne\t se\t doona\t samjheiñ\t aur\t Allah\t apni\t\nmadad\t se\t zor\t deta\t hai\t jise\t chāhta\t hai\t\nbeshak\tis\tmeiñ\taqalmandoñ\tke\tliye\tzaroor\t\ndekh\tkar seekhna\thai\t\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "14",
    "arabicText": "زُيِّنَ لِلنَّاسِ حُبُّ ٱلشَّهَوَٰتِ مِنَ ٱلنِّسَآءِ وَٱلْبَنِينَ وَٱلْقَنَـٰطِيرِ ٱلْمُقَنطَرَةِ مِنَ ٱلذَّهَبِ وَٱلْفِضَّةِ وَٱلْخَيْلِ ٱلْمُسَوَّمَةِ وَٱلْأَنْعَـٰمِ وَٱلْحَرْثِ ۗ ذَٰلِكَ مَتَـٰعُ ٱلْحَيَوٰةِ ٱلدُّنْيَا ۖ وَٱللَّهُ عِندَهُۥ حُسْنُ ٱلْمَـَٔابِ",
    "urduTranslationText": "",
    "englishTranslationText": "Beautified\tis\tfor\tmankind\tthe\tlove\tof\tthese\t\ndesires\t- women,\t and\t sons,\t and\t heaps\t of\t\ngold\t and\t piled\t up\t silver,\t and\t branded\t\nhorses,\t and\t cattle\t and\t fields;\t this\t is\t the\t\nwealth\t of\t the\t life\t of\t this\t world;\t and\t it\t is\t\nAllah,\twith\tWhom\tis\tthe\texcellent\tabode\t\t\t",
    "romanUrduTranslationText": ". Logoñ\t ke\t liye\t ārāsta\t ki\t gayi\t un\t\nkhuwahishoñ\t ki\t muhabbat\t aurteiñ\t aur\t\nbete\taur\ttale\tupar\tsone\tchāndi\tke\tdher\taur\t\nnishān\tkiye\thuwe\tghode\taur\tchaupāye\taur\t\nkheti,\t yeh\t jeeti\t duniya\t ki\t pooñji\t hai\t aur\t\nAllah\thai\tjiske\tpās\tachchha\tthikana\t\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "15",
    "arabicText": "۞ قُلْ أَؤُنَبِّئُكُم بِخَيْرٍۢ مِّن ذَٰلِكُمْ ۚ لِلَّذِينَ ٱتَّقَوْا۟ عِندَ رَبِّهِمْ جَنَّـٰتٌۭ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا وَأَزْوَٰجٌۭ مُّطَهَّرَةٌۭ وَرِضْوَٰنٌۭ مِّنَ ٱللَّهِ ۗ وَٱللَّهُ بَصِيرٌۢ بِٱلْعِبَادِ",
    "urduTranslationText": "",
    "englishTranslationText": "Say\t (O\t dear\t Prophet\t Muhammad - peace\t and\t blessings\t be\t upon\t him),\t “Shall\t I\t inform\t you\t of\t\nsomething\tbetter\t than\t that?\tFor\t the\tpious,\twith\t their\tLord,\tare\tGardens\tbeneath\twhich\trivers\t\nflow\t- they\twill\tabide\tin\tit\t forever\t- and\tpure\twives,\tand\tAllah’s\tpleasure”;\tand\tAllah sees\t the\t\nbondmen.\t\t",
    "romanUrduTranslationText": "Tum\tfarmao\tkya\tmaiñ\ttumheiñ\tis\tse\tbehtar\tcheez\tbata\tdooñ\tparhez-gāroñ\tke\tliye\tunke\tRab\tke\t\npās\tJannateiñ\thaiñ\tjin\tke\tneeche\tnahre\trawāñ,\thamesha\tun\tmeiñ\traheñge\taur\tsuthri\tbiwiyāñ\taur\t\nAllah\tki\tkhush-noodi\taur\tAllah\tbandoñ\tko\tdekhta\thai\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "16",
    "arabicText": "ٱلَّذِينَ يَقُولُونَ رَبَّنَآ إِنَّنَآ ءَامَنَّا فَٱغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ ٱلنَّارِ",
    "urduTranslationText": "",
    "englishTranslationText": "Those\t who\t say,\t “Our\t Lord!\t we\t have\t\naccepted\t faith,\t so\t forgive\tus\t our\t sins\tand\t\nsave\tus\tfrom\tthe\tpunishment\tof\tfire.”\t\t",
    "romanUrduTranslationText": "Woh\tjo\tkehte\thaiñ\taey\tRab\thamāre!\tHam\t\nImān\tlāye\ttu\thamāre\tgunah\tmu'āf\tkar\taur\t\nhameiñ\tdozakh\tke\tázāb\tse\tbacha\tle"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "17",
    "arabicText": "ٱلصَّـٰبِرِينَ وَٱلصَّـٰدِقِينَ وَٱلْقَـٰنِتِينَ وَٱلْمُنفِقِينَ وَٱلْمُسْتَغْفِرِينَ بِٱلْأَسْحَارِ",
    "urduTranslationText": "",
    "englishTranslationText": "The\t steadfast,\t and\t the\t truthful,\t and\t the\t\nreverent,\tand\twho\tspend\tin\tAllah's\tcause,\t\nand\t who\t seek\t forgiveness\t in\t the\t last\t\nhours\tof\tthe\tnight\t(before\tdawn).\t\t",
    "romanUrduTranslationText": "Sabr\twāle\taur\tsachche\taur\tadab\twāle\taur\t\nRāh-e-Khuda\t meiñ\t kharchne\t \t wāle\t aur\t\npichhle\tpahar\tse\tmu'āfi\tmāñgne\twāle"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "18",
    "arabicText": "شَهِدَ ٱللَّهُ أَنَّهُۥ لَآ إِلَـٰهَ إِلَّا هُوَ وَٱلْمَلَـٰٓئِكَةُ وَأُو۟لُوا۟ ٱلْعِلْمِ قَآئِمًۢا بِٱلْقِسْطِ ۚ لَآ إِلَـٰهَ إِلَّا هُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
    "urduTranslationText": "",
    "englishTranslationText": "Allah has\tgiven\twitness\tthat\tthere\tis\tnone\t\nworthy\tof\tworship\t(God)\texcept\tHim\t- and\t\nthe\t angels\t and\t the\t scholars\t also\t give\t\nwitness,\t established\t with\t justice\t (with\t\ntruth)\t - there\t is\t no\t God\t except\t Him,\t the\t\nAlmighty,\tthe\tWise.\t\t\t",
    "romanUrduTranslationText": ". Allah\t ne\t gawāhi\t di\t ke\t us\t ke\t siwa\t koi\t\nMa'bood\tnahi\taur\tFarishtoñ\tne\taur\tālimoñ\t\nne\tinsāf\tse\tqāyim\thokar,\tus\tke\tsiwa\tkisi\tki\t\nibadat\tnahi,\tizzat\twāla\thikmat\twāla."
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "19",
    "arabicText": "إِنَّ ٱلدِّينَ عِندَ ٱللَّهِ ٱلْإِسْلَـٰمُ ۗ وَمَا ٱخْتَلَفَ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَـٰبَ إِلَّا مِنۢ بَعْدِ مَا جَآءَهُمُ ٱلْعِلْمُ بَغْيًۢا بَيْنَهُمْ ۗ وَمَن يَكْفُرْ بِـَٔايَـٰتِ ٱللَّهِ فَإِنَّ ٱللَّهَ سَرِيعُ ٱلْحِسَابِ",
    "urduTranslationText": "",
    "englishTranslationText": "Indeed\t the\t only\t true\t religion\tin\t the\t sight\t\nof\tAllah is\t Islam;\t those\twho\thad\treceived\t\nthe\t Books\t differed\t only\t after\t the\t\nknowledge\t came\t to\t them,\t due\t to\t their\t\nhearts’\t envy;\t and\t whoever\t disbelieves\t in\t\nthe\t signs\t of\t Allah,\t then\t Allah is\t Swift\t At\t\nTaking\tAccount\t\t\t",
    "romanUrduTranslationText": "Beshak\t Allah\t ke\t yahāñ\t Islam\t hi\t deen\t hai\t\naur\tphoot\tmeiñ\tna\tpade\tkitābi\tmagar\tb’ad\t\niske\t ke\t unheiñ\t ilm\t āchuka\t Apne\t diloñ\t ki\t\njalan\tse\taur\tjo\tAllah\tki\tāayatoñ\tka\tmunkir\t\nho\t to\t beshak\t Allah\t jald\t hisāb\t lene\t wāla\t\nhai.\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "20",
    "arabicText": "فَإِنْ حَآجُّوكَ فَقُلْ أَسْلَمْتُ وَجْهِىَ لِلَّهِ وَمَنِ ٱتَّبَعَنِ ۗ وَقُل لِّلَّذِينَ أُوتُوا۟ ٱلْكِتَـٰبَ وَٱلْأُمِّيِّـۧنَ ءَأَسْلَمْتُمْ ۚ فَإِنْ أَسْلَمُوا۟ فَقَدِ ٱهْتَدَوا۟ ۖ وَّإِن تَوَلَّوْا۟ فَإِنَّمَا عَلَيْكَ ٱلْبَلَـٰغُ ۗ وَٱللَّهُ بَصِيرٌۢ بِٱلْعِبَادِ",
    "urduTranslationText": "",
    "englishTranslationText": "Then\t if\t they\t argue\t with\t you,\t (O\t dear\t\nProphet\tMuhammad - peace\t and\t blessings\t\nbe\t upon\t him)\t say,\t “I\t have\t submitted\t my\t\nface\t(self)\tto\tAllah and\t likewise\t have\t my\t\nfollowers”;\t and\t say\t to\t the\t People\t given\t\nthe\t Book(s)\t and\t the\t illiterate,\t “Have\t you\t\nsubmitted\t(accepted\tIslam)?”\tIf\tthey\tsubmit,\tthey\thave\tattained\tthe\tright\tpath\t- and\tif\tthey\tturn\t\naway\t(reject),\tthen\tyour\tduty\tis\tonly\tto\tconvey\tthis\tcommand;\tand\tAllah is\tseeing\tthe\tbondmen.\t\t",
    "romanUrduTranslationText": " Phir\taey\tMehboob agar\twoh\ttum\tse\thujjat\t\nkareiñ\tto\tfarma\tdo\tmaiñ\tapna\tmuñh\tAllah\tke\thozoor\tjhukaye\thooñ\taur\tjo\tmere\tpairo\thuwe\taur\t\nkitābiyoñ\taur\tan-padhoñ\tse\tfarmao\tkiya\ttum\tne\tgardan\trakhi\tpas\tagar\twoh\tgardan\trakheiñ\tjab\t\nto\trāh\tpa\tgaye\taur\tagar\tmooñh\tphereiñ\tto\ttum\tpar\tto\tyahi\thukm\tpahoñcha\tdena\thai\taur\tAllah\t\nbandoñ\tko\tdekh\traha\thai\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "21",
    "arabicText": "إِنَّ ٱلَّذِينَ يَكْفُرُونَ بِـَٔايَـٰتِ ٱللَّهِ وَيَقْتُلُونَ ٱلنَّبِيِّـۧنَ بِغَيْرِ حَقٍّۢ وَيَقْتُلُونَ ٱلَّذِينَ يَأْمُرُونَ بِٱلْقِسْطِ مِنَ ٱلنَّاسِ فَبَشِّرْهُم بِعَذَابٍ أَلِيمٍ",
    "urduTranslationText": "",
    "englishTranslationText": ". Those\twho\tdisbelieve\tin\tthe\tsigns\tof\tAllah,\tand\twrongfully\tmartyr\tthe\tProphets,\tand\tslay\tpeople\t\nwho\tenjoin\tjustice\t- so\tgive\tthem\tthe\tglad\ttidings\tof\ta\tpainful\tpunishment.\t\t\t",
    "romanUrduTranslationText": ". Woh\tjo\tAllah\tki\tāayatoñ\tse\tmunkir\thote\taur\tpaighambaroñ\tko\tna-haq\tshaheed\tkarte\taur\tinsāf\tka\t\nhukm\tkarne\twāloñ\tko\tqatl\tkarte\thaiñ\tunheiñ\tKhush\tkhabri\tdo\tdard-nāk\tazāb\tki"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "22",
    "arabicText": "أُو۟لَـٰٓئِكَ ٱلَّذِينَ حَبِطَتْ أَعْمَـٰلُهُمْ فِى ٱلدُّنْيَا وَٱلْـَٔاخِرَةِ وَمَا لَهُم مِّن نَّـٰصِرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "They\tare\tthose\twhose\tdeeds\tare\twasted\tin\tthis\tworld\tand\tin\tthe\tHereafter;\tand\tthey\tdo\tnot\thave\t\nany\taides.\t\t",
    "romanUrduTranslationText": "Yeh\thaiñ\twoh\tjin\tke\támal\takārat\tgaye\tDuniya-o-Ākhirat\tmeiñ\taur\tun\tka\tkoi\tmadad-gār\tnahi"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "23",
    "arabicText": "أُو۟لَـٰٓئِكَ ٱلَّذِينَ حَبِطَتْ أَعْمَـٰلُهُمْ فِى ٱلدُّنْيَا وَٱلْـَٔاخِرَةِ وَمَا لَهُم مِّن نَّـٰصِرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "They\tare\tthose\twhose\tdeeds\tare\twasted\tin\tthis\tworld\tand\tin\tthe\tHereafter;\tand\tthey\tdo\tnot\thave\t\nany\taides.\t\t",
    "romanUrduTranslationText": "Yeh\thaiñ\twoh\tjin\tke\támal\takārat\tgaye\tDuniya-o-Ākhirat\tmeiñ\taur\tun\tka\tkoi\tmadad-gār\tnahi"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "23",
    "arabicText": "أَلَمْ تَرَ إِلَى ٱلَّذِينَ أُوتُوا۟ نَصِيبًۭا مِّنَ ٱلْكِتَـٰبِ يُدْعَوْنَ إِلَىٰ كِتَـٰبِ ٱللَّهِ لِيَحْكُمَ بَيْنَهُمْ ثُمَّ يَتَوَلَّىٰ فَرِيقٌۭ مِّنْهُمْ وَهُم مُّعْرِضُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Did\tyou\tnot\tsee\tthem\twho\thave\treceived\ta\t\npart\t of\t the\t Book\t - when\t called\t towards\t\nthe\t Book\t of\t Allah for\t judging\t between\t\nthem,\t a\t group\t of\t them\t opposes\t it\t and\t\nturns\taway?\t\t",
    "romanUrduTranslationText": ". Kya\ttum\tne\tunheiñ\tna\tdekha\tjinheiñ\tkitāb\t\nka\tek\thissa\tmila\tKitāb-Ullah ki\ttaraf\tbulāye\t\njāte\thaiñ\tke\twoh\tunka\t faisla\tkare\tphir\tun\t\nmeiñ\t ka\t ek\t giroh\t us\t se\t ru-gardān\t hokar\t\nphir\tjāta\thai"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "23",
    "arabicText": "أَلَمْ تَرَ إِلَى ٱلَّذِينَ أُوتُوا۟ نَصِيبًۭا مِّنَ ٱلْكِتَـٰبِ يُدْعَوْنَ إِلَىٰ كِتَـٰبِ ٱللَّهِ لِيَحْكُمَ بَيْنَهُمْ ثُمَّ يَتَوَلَّىٰ فَرِيقٌۭ مِّنْهُمْ وَهُم مُّعْرِضُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Did\tyou\tnot\tsee\tthem\twho\thave\treceived\ta\t\npart\t of\t the\t Book\t - when\t called\t towards\t\nthe\t Book\t of\t Allah for\t judging\t between\t\nthem,\t a\t group\t of\t them\t opposes\t it\t and\t\nturns\taway?\t\t",
    "romanUrduTranslationText": ". Kya\ttum\tne\tunheiñ\tna\tdekha\tjinheiñ\tkitāb\t\nka\tek\thissa\tmila\tKitāb-Ullah ki\ttaraf\tbulāye\t\njāte\thaiñ\tke\twoh\tunka\t faisla\tkare\tphir\tun\t\nmeiñ\t ka\t ek\t giroh\t us\t se\t ru-gardān\t hokar\t\nphir\tjāta\thai"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "24",
    "arabicText": "ذَٰلِكَ بِأَنَّهُمْ قَالُوا۟ لَن تَمَسَّنَا ٱلنَّارُ إِلَّآ أَيَّامًۭا مَّعْدُودَٰتٍۢ ۖ وَغَرَّهُمْ فِى دِينِهِم مَّا كَانُوا۟ يَفْتَرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "They\t dared\t to\t do\t this\t because\t they\t say,\t\n“The\t fire\t will\t definitely\t not\t touch\t us\t\nexcept\tfor\ta\tcertain\tnumber\tof\tdays”;\tand\t\nthey\tare\tdeceived\tin\t their\t religion\tby\t the\t\nlies\tthey\tfabricated",
    "romanUrduTranslationText": "Yeh\tjur'at\tunheiñ\tis\tliye\thuyi\tke\twoh\tkehte\t\nhaiñ\thargiz\thameiñ\tāg\tna\tchuwe\tgi\tmagar\t\nginti\tke\tdinoñ\taur\tun\tke\tdeen\tmeiñ\tunheiñ\t\nfareb\tdiya\tus\tjhoot\tne\tjo\tbandh\tte\tthey"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "25",
    "arabicText": "فَكَيْفَ إِذَا جَمَعْنَـٰهُمْ لِيَوْمٍۢ لَّا رَيْبَ فِيهِ وَوُفِّيَتْ كُلُّ نَفْسٍۢ مَّا كَسَبَتْ وَهُمْ لَا يُظْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". So\t what\t will\t be\t (their\t state)\t when\t We\t\nbring\tall\tof\t them\t together\t for\t the\tDay\t(of\t\nResurrection)\t about\t which\t there\t is\t no\t\ndoubt;\tand\tevery\tsoul\twill\tbe\tpaid\tback\tin\t\nfull\t for\t what\tit\t has\t earned,\t and\t they\t will\t\nnot\tbe\twronged.",
    "romanUrduTranslationText": "To\t kaisi\t hogi\t jab\t ham\t unheiñ\t ikhat-tha\t\nkareiñ\tge\tus\tdin\tke\tliye\tjis\tmeiñ\tshak\tnahi\t\naur\t har\t jān\t ko\t uski\t kamāi\t poori\t bhar\t di\t\njāye\tgi\taur\tun\tpar\tzulm\tna\thoga\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "26",
    "arabicText": "قُلِ ٱللَّهُمَّ مَـٰلِكَ ٱلْمُلْكِ تُؤْتِى ٱلْمُلْكَ مَن تَشَآءُ وَتَنزِعُ ٱلْمُلْكَ مِمَّن تَشَآءُ وَتُعِزُّ مَن تَشَآءُ وَتُذِلُّ مَن تَشَآءُ ۖ بِيَدِكَ ٱلْخَيْرُ ۖ إِنَّكَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": ". Invoke\t (O\t dear\t Prophet\t Muhammad -\npeace\tand\tblessings\tbe\tupon\thim),\t“O\tAllah!\t\nOwner\tOf\tThe\tKingdom\t- You\tbestow\t the\t\nkingdom\ton\twhomever\tYou\twill,\tand\tYou\t\ntake\t back\t the\t kingdom\t from\t whomever\t\nYou\t will;\t and\t You\t give\t honour\t to\t\nwhomever\t You\t will,\t and\t You\t humiliate\t\nwhomever\t You\t will;\t only\t in\t Your\t Hand\t\n(control)\tlies\tall\tgoodness;\tindeed,\tYou\tare\t\nAble\tto\tdo\tall\tthings.”\t",
    "romanUrduTranslationText": ". Yuñ\tarz\tkar\taey\tAllah\tmulk\tke\tMālik\ttu\tjise\t\nchāhe\tsaltanat\tde\taur\tjis\tse\tchāhe\tsaltanat\t\nchheen\tle\t aur\t jise\t chāhe\tizzat\t de\t aur\t jise\t\nchāhe\t zillat\t de\t sāri\t hi\t bhalāi\t tere\t hi\t hāth\t\nhai\tbeshak\ttu\tsab\tkuchh\tkar\tsakta\thai\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "27",
    "arabicText": "تُولِجُ ٱلَّيْلَ فِى ٱلنَّهَارِ وَتُولِجُ ٱلنَّهَارَ فِى ٱلَّيْلِ ۖ وَتُخْرِجُ ٱلْحَىَّ مِنَ ٱلْمَيِّتِ وَتُخْرِجُ ٱلْمَيِّتَ مِنَ ٱلْحَىِّ ۖ وَتَرْزُقُ مَن تَشَآءُ بِغَيْرِ حِسَابٍۢ",
    "urduTranslationText": "",
    "englishTranslationText": "“You\t cause\t part\t of\t the\t night\t to\t pass\t into\t\nthe\tday,\tand\tYou\tcause\tpart\tof\t the\tday to\t\npass\t into\t the\t night;\t and\t You\t bring\t forth\t\nthe\t living\t from\t the\t dead,\t and\t You\t bring\t forth\t the\t dead\t from\t the\t living;\t and\t You\t give\t to\t\nwhomever\tYou\twill,\twithout\taccount.”",
    "romanUrduTranslationText": ". Tu\t din\t ka\t hissa\t rāt\t meiñ\t dāle\t aur\t rāt\t ka\t\nhissa\t din\t meiñ\t dāle\t aur\t murda\t se\t zinda\t\nnikāle\t aur\t zinda\t se\tmurda\t nikāle\t aur\tjise\t\nchāhe\tbe\tginti\tde\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "28",
    "arabicText": "لَّا يَتَّخِذِ ٱلْمُؤْمِنُونَ ٱلْكَـٰفِرِينَ أَوْلِيَآءَ مِن دُونِ ٱلْمُؤْمِنِينَ ۖ وَمَن يَفْعَلْ ذَٰلِكَ فَلَيْسَ مِنَ ٱللَّهِ فِى شَىْءٍ إِلَّآ أَن تَتَّقُوا۟ مِنْهُمْ تُقَىٰةًۭ ۗ وَيُحَذِّرُكُمُ ٱللَّهُ نَفْسَهُۥ ۗ وَإِلَى ٱللَّهِ ٱلْمَصِيرُ",
    "urduTranslationText": "",
    "englishTranslationText": "The\tMuslims\tmust\tnot\tbefriend\tthe\tdisbelievers,\tin\tpreference\tover\tthe\tMuslims;\twhoever\tdoes\t\nthat\thas\tno\tconnection\twhatsoever\twith\tAllah,\texcept\tif\tyou\tfear\tthem;\tAllah warns\tyou\tof\tHis\t\nwrath;\tand\ttowards\tAllah only\tis\tthe\treturn.",
    "romanUrduTranslationText": ". Musalman\t kāfiroñ\t ko\t apna\t dost\t na\t bana\t\nleiñ\t musalmanoñ\t ke\t siwa\t aur\t jo\t aisa\t\nkarega\t usey\t Allah\t se\t kuchh\t alāqā\t\n(Ta’alluq) na\traha\tmagar\tyeh\tke\ttum\tun\tse\tkuchh\tdaro\taur Allah\ttumheiñ\tapne\tgazab\tse\tdarata\t\nhai\taur\tAllah\thi\tki\ttaraf\tphirna\thai"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "29",
    "arabicText": "قُلْ إِن تُخْفُوا۟ مَا فِى صُدُورِكُمْ أَوْ تُبْدُوهُ يَعْلَمْهُ ٱللَّهُ ۗ وَيَعْلَمُ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۗ وَٱللَّهُ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "Say,\t(O\t dear\t Prophet\t Muhammad - peace\t and\t blessings\t be\t upon\t him),\t “Whether\t you\t hide\t or\t\nreveal\t whatever\t is\t in your\t hearts,\t Allah knows\t it\t all;\t and\t He\t knows\t all\t whatever\t is\t in\t the\t\nheavens\tand\tall\twhatever\tis\tin\tthe\tearth;\tand\tAllah has\tcontrol\tover\tall\tthings.”",
    "romanUrduTranslationText": "Tum\t farma\t do\t ke\tagar\t tum\tapne\tji\t ki\t bāt\t chupao\t ya\tzāhir\t karo\tAllah\t ko\t sab\tma'loom\t hai\taur\t\njānta\thai\tjo\tkuchh\tāasmanoñ\tmeiñ\thai\taur\tjo\tkuch\tzameen\tmeiñ\thai\taur\thar\tcheez\tpar\tAllah\tka\t\nqābu\thai"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "30",
    "arabicText": "يَوْمَ تَجِدُ كُلُّ نَفْسٍۢ مَّا عَمِلَتْ مِنْ خَيْرٍۢ مُّحْضَرًۭا وَمَا عَمِلَتْ مِن سُوٓءٍۢ تَوَدُّ لَوْ أَنَّ بَيْنَهَا وَبَيْنَهُۥٓ أَمَدًۢا بَعِيدًۭا ۗ وَيُحَذِّرُكُمُ ٱللَّهُ نَفْسَهُۥ ۗ وَٱللَّهُ رَءُوفٌۢ بِٱلْعِبَادِ",
    "urduTranslationText": "",
    "englishTranslationText": "On\t the\t Day\t when\t every\t soul\t will\t be\t\nconfronted\t with\t all\t the\t good\t that\t it\t has\t\ndone;\tand\tall\t the\tevil\t that\tit\thas\tdone\t- it\t\nwill\t wish\t that\t perhaps\t there\t would\t have\t\nbeen\t a\t great\t distance\t between\t itself\t and\t\nthe\t punishment;\t and\t Allah warns\t you\t of\t\nHis\t punishment; and\t Allah is\t Most\t\nCompassionate\ttowards\tHis\tbondmen.\t",
    "romanUrduTranslationText": ". Jis\tdin\thar\tjān\tne\tjo\tbhala\tkām\tkiya\thāzir\t\npayegi\taur\tjo\tbura\tkām\tkiya\tummid\tkaregi\t\t\nkash\tmujh\tmeiñ\taur\tis\tmeiñ\tdoor\tka\t fāsla\t\nhota\t aur\t Allah\t tumheiñ\t apne\t ‘azāb\t se\t\ndarata\t hai\t aur\t Allah\t bandoñ\t par\t\nmeharbān\thai."
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "31",
    "arabicText": "يَقُلْ إِن كُنتُمْ تُحِبُّونَ ٱللَّهَ فَٱتَّبِعُونِى يُحْبِبْكُمُ ٱللَّهُ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ ۗ وَٱللَّهُ غَفُورٌۭ رَّحِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "Proclaim,\t (O\t dear\t Prophet\t Muhammad -\npeace\t and\t blessings\t be\t upon\t him),\t “O\t\nmankind!\t If\t you\t love\t Allah,\t follow\t me\t -\nAllah will\t love\t you\t and\t forgive\t you\t your\t\nsins”;\t and\t Allah is\t Oft\t Forgiving,\t Most\t\nMerciful.\t\t",
    "romanUrduTranslationText": "Aey\t Mehboob!\t Tum\t farma\t do\t ke\t logoñ!\t\nAgar\t Allah\t ko\t dost\t rakhte\t ho\t to\t mere\t\nfarmā-bardār\t ho\t jāo\t Allah\t tumheiñ\t dost\t\nrakhega\t aur\t tumhare\t gunah\t bakhsh\t dega\t\naur\tAllah\tbakhsh\tne\twāla\tmeharbān\thai"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "32",
    "arabicText": "قُلْ أَطِيعُوا۟ ٱللَّهَ وَٱلرَّسُولَ ۖ فَإِن تَوَلَّوْا۟ فَإِنَّ ٱللَّهَ لَا يُحِبُّ ٱلْكَـٰفِرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Proclaim,\t “Obey\t Allah and\t the\t Noble\t\nMessenger”;\t so\t if\t they\t turn\t away\t - then\t\nAllah is\tnot\tpleased\twith\tthe\tdisbelievers.\t\t",
    "romanUrduTranslationText": "Tum\t farma\t do\t ke\t hukm\t māno\t Allah\t aur\t\nRasool\tka\tphir\tagar\twoh\tmuñh\tphereiñ\tto\t\nAllah\tko\tkhush\tnahi\tāte\tkāfir.\n"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "33",
    "arabicText": "۞ إِنَّ ٱللَّهَ ٱصْطَفَىٰٓ ءَادَمَ وَنُوحًۭا وَءَالَ إِبْرَٰهِيمَ وَءَالَ عِمْرَٰنَ عَلَى ٱلْعَـٰلَمِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Indeed\tAllah chose\tAdam,\tand\tNooh,\tand\t\nthe\t Family\t of\t Ibrahim,\t and\t the\t Family\t of\t\nImran\tover\tthe\tcreation.\t",
    "romanUrduTranslationText": "Beshak\tAllah\tne\tchun\tliya\tÃdam\taur\tNooh\t\naur\tIbrāheem\tki\tāl\taur\tImran\tki\tāl\tko\tsāre\t\njahān\tse"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "34",
    "arabicText": "ذُرِّيَّةًۢ بَعْضُهَا مِنۢ بَعْضٍۢ ۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ",
    "urduTranslationText": "",
    "englishTranslationText": "They\tare\tthe\tdescendants one\tof\tanother;\t\nand\t Allah is\t the\t All\t Hearing,\t the\t All\t\nKnowing.",
    "romanUrduTranslationText": "Yeh\t ek\t nasl\t hai\t ek\t doosre\t se\t aur\t Allah\t\nsunta\tjānta\thai\t."
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "35",
    "arabicText": "إِذْ قَالَتِ ٱمْرَأَتُ عِمْرَٰنَ رَبِّ إِنِّى نَذَرْتُ لَكَ مَا فِى بَطْنِى مُحَرَّرًۭا فَتَقَبَّلْ مِنِّىٓ ۖ إِنَّكَ أَنتَ ٱلسَّمِيعُ ٱلْعَلِيمُ",
    "urduTranslationText": "",
    "englishTranslationText": "(Remember)\tWhen\tthe\twife\tof\tImran\tsaid,\t\n“My\t Lord!\t I\t pledge\t to\t you\t what\t is\t in\t my\t\nwomb\t- that\tit\tshall\tbe\tdedicated\tpurely\tin\t\nYour\tservice,\tso\taccept\tit\tfrom\tme;\tindeed\t\nYou\t only\t are\t the\t All\t Hearing,\t the\t All\t\nKnowing.”\t",
    "romanUrduTranslationText": "Jab\tImran ki\tbiwi\tne\tarz\tki\taey\tRab\tmere!\t\nMaiñ\ttere\tliye\tmannat\tmānti\thooñ\tjo\tmere\t\npet\t meiñ\t hai\t ke\t khālis\t teri\t hi\t khidmat\t\nmeiñ\t rahe\t to\t tu\t mujh\t se\t qabool\t karle,\t\nbeshak\ttu\thi\thai\tsunta\tjānta.\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "36",
    "arabicText": "فَلَمَّا وَضَعَتْهَا قَالَتْ رَبِّ إِنِّى وَضَعْتُهَآ أُنثَىٰ وَٱللَّهُ أَعْلَمُ بِمَا وَضَعَتْ وَلَيْسَ ٱلذَّكَرُ كَٱلْأُنثَىٰ ۖ وَإِنِّى سَمَّيْتُهَا مَرْيَمَ وَإِنِّىٓ أُعِيذُهَا بِكَ وَذُرِّيَّتَهَا مِنَ ٱلشَّيْطَـٰنِ ٱلرَّجِيمِ ٣٦",
    "urduTranslationText": "",
    "englishTranslationText": ". So\twhen\tshe\tgave\tbirth\tto\tit,\tshe\tsaid,\t“My\tLord!\tI\thave\tindeed\tgiven\tbirth\tto\ta\tgirl!”\tAnd\tAllah\nwell\tknows\twhat\tshe\tgave\tbirth\tto;\tand\tthe\tboy\tshe\thad\tprayed\t for\tis\tnot\tlike\tthis\tgirl;\t“And\tI\t\nhave\tnamed\ther\tMaryam\tand\tI\tgive\ther\tand\ther\toffspring\tin\tYour\tprotection,\tagainst\tSatan\tthe\t\noutcast.”\t\t",
    "romanUrduTranslationText": "Phir\tjab\tusey\tjanā,\tboli\taey\tRab\tmere\tyeh\t\nto\tmaiñ\tne\tladki\tjani\taur\tAllah\tko\tkhoob\tma'loom\thai\tjo\tkuchh\twoh\tjani\taur\twoh\tladka\tjo\tus\tne\t\nmāñga\tus\tladki\tsa\tnahi\taur\tmaiñ\tne\tus\tka\tnām\tMaryam\trakha\tāur\tmaiñ\tusey\taur\tuski\taulād\tko\t\nteri\tpanāh\tmeiñ\tdeti\thooñ\trāñde huwe\tshaitān\tse.\t\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "37",
    "arabicText": "فَتَقَبَّلَهَا رَبُّهَا بِقَبُولٍ حَسَنٍۢ وَأَنۢبَتَهَا نَبَاتًا حَسَنًۭا وَكَفَّلَهَا زَكَرِيَّا ۖ كُلَّمَا دَخَلَ عَلَيْهَا زَكَرِيَّا ٱلْمِحْرَابَ وَجَدَ عِندَهَا رِزْقًۭا ۖ قَالَ يَـٰمَرْيَمُ أَنَّىٰ لَكِ هَـٰذَا ۖ قَالَتْ هُوَ مِنْ عِندِ ٱللَّهِ ۖ إِنَّ ٱللَّهَ يَرْزُقُ مَن يَشَآءُ بِغَيْرِ حِسَابٍ",
    "urduTranslationText": "",
    "englishTranslationText": "So\ther\tLord\tfully\taccepted\ther\t(Maryam),\tand\tgave\ther\tan\texcellent\tdevelopment;\tand\tgave\ther\t\nin\t Zakaria’s\tguardianship;\twhenever\t Zakaria\t visited\ther\tat\ther\tplace\t of\tprayer,\the\t found\tnew\t\nfood\twith\ther;\the\tsaid,\t“O\tMaryam!\tFrom\twhere\tdid\tthis\tcome\tto\tyou?”\tShe\tanswered,\t“It\tis\tfrom\t\nAllah;\tindeed\tAllah gives\tto\twhomever\tHe\twills,\twithout\tlimit\taccount.”\t(Miracles\toccur\tthrough\t\nthe\tfriends\tof\tAllah.)\t\t",
    "romanUrduTranslationText": "To\t usey\t us\t ke\t Rab\t ne\t achhi\t tarah\t qabool\t kiya\t aur\t usey\t achchha\t parwān\t chadhaya\t aur\t usey\t\nZakariya ki\tnigeh-bāni\tmeiñ\tdiya,\tjab\tZakariya us\tke\tpās\tus\tki\tnamāz\tpadhne\tki\tjagah\tjāte\tus\tke\t\npās\tnaya\trizq\tpāte\tkaha:\taey\tMaryam!\tyeh\ttere\tpās\tkahāñ\tse\tāaya\tboleiñ\twoh\tAllah\tke\tpās\tse\thai,\t\nbeshak\tAllah\tjise\tchāhe\tbe\tginti\tde"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "38",
    "arabicText": "هُنَالِكَ دَعَا زَكَرِيَّا رَبَّهُۥ ۖ قَالَ رَبِّ هَبْ لِى مِن لَّدُنكَ ذُرِّيَّةًۭ طَيِّبَةً ۖ إِنَّكَ سَمِيعُ ٱلدُّعَآءِ",
    "urduTranslationText": "",
    "englishTranslationText": "It\tis\there\tthat\tZakaria\tprayed\tto\this\tLord;\t\nhe\tsaid,\t“My\tLord!\tGive\tme\t from\tYourself\t\na\trighteous\tchild;\tindeed\tYou\tonly\tare\tthe\t\nListener\tOf\tPrayer.”\t\t",
    "romanUrduTranslationText": "Yahāñ\tpukāra\tZakariya apne\tRab\tko,\tbola:\t\naey\tRab\tmere!\tMujhe\tapne\tpās\tse\tde\tsuthri\t\naulād\tbeshak\ttu\thi\thai\tdua\tsun\tne\twāla\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "39",
    "arabicText": "فَنَادَتْهُ ٱلْمَلَـٰٓئِكَةُ وَهُوَ قَآئِمٌۭ يُصَلِّى فِى ٱلْمِحْرَابِ أَنَّ ٱللَّهَ يُبَشِّرُكَ بِيَحْيَىٰ مُصَدِّقًۢا بِكَلِمَةٍۢ مِّنَ ٱللَّهِ وَسَيِّدًۭا وَحَصُورًۭا وَنَبِيًّۭا مِّنَ ٱلصَّـٰلِحِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tthe\tangels\tcalled\tout\tto\thim\twhile\the\t\nwas\tstanding,\toffering\tprayer\tat\this\tplace\t\nof\t worship,\t “Indeed\t Allah gives\t you\t glad\t\ntidings\tof\tYahya\t(John),\twho\twill\tconfirm\ta\t\nWord\t (or\t sign)\t from\t Allah,\t - a\t leader,\t\nalways\trefraining\tfrom\twomen,\ta\tProphet\t\nfrom\tone\tof\tOur\tdevoted\tones.”",
    "romanUrduTranslationText": ". To\tfarishtoñ\tne\tusey\tāwaz\tdi\taur\twoh\tapni\t\nnamāz\t ki\t jagah\t khada\tNamāz\t pardh\t raha\t\ntha\t beshak\t Allah\t āpko\t muzda\t deta\t hai\t\nYahya\t ka\tjo\t Allah ki\t taraf\t ke\t ek\t kalime\t ki\t\ntasdeeq\tkarega\taur\tsardār\taur\thamesha\tke\t\nliye\t aurtoñ\t se\t bachne\t wāla\t aur\t Nabi\t\nhamāre\tkhāsoñ\tme\tse"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "40",
    "arabicText": "قَالَ رَبِّ أَنَّىٰ يَكُونُ لِى غُلَـٰمٌۭ وَقَدْ بَلَغَنِىَ ٱلْكِبَرُ وَٱمْرَأَتِى عَاقِرٌۭ ۖ قَالَ كَذَٰلِكَ ٱللَّهُ يَفْعَلُ مَا يَشَآءُ",
    "urduTranslationText": "",
    "englishTranslationText": "He\t said,\t “My\t Lord!\tHow\t can\t I\t have\ta\t son\t\nwhen\told\tage\thas\treached\tme\tand\tmy\twife\t\nis\t barren?”\t He\t said,\t “This\t is\t how\t Allah\nbrings\tabout,\twhatever\tHe\twills.”\t",
    "romanUrduTranslationText": "Bola\t aey\t mere\t Rab!\t Mere\t ladka\t kahāñ\t se\t\nhoga\t mujhe\t to\t pahuñch\t gya\t budhapa\t aur\t\nmeri\t aurat\t bāñjh\t farmāya\t Allah\t yooñ\t hi\t\nkarta\thai\tjo\tchāhe"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "41",
    "arabicText": "قَالَ رَبِّ ٱجْعَل لِّىٓ ءَايَةًۭ ۖ قَالَ ءَايَتُكَ أَلَّا تُكَلِّمَ ٱلنَّاسَ ثَلَـٰثَةَ أَيَّامٍ إِلَّا رَمْزًۭا ۗ وَٱذْكُر رَّبَّكَ كَثِيرًۭا وَسَبِّحْ بِٱلْعَشِىِّ وَٱلْإِبْكَـٰرِ",
    "urduTranslationText": "",
    "englishTranslationText": "He\t said,\t “My\t Lord!\t Determine\t a\t sign\t for\t\nme”;\t He\t said,\t “The\t sign\t is\t that\t you\t shall\t\nnot\tbe\table\tto\tspeak\tto\tmankind\tfor\tthree\t\ndays\texcept\tby\tsigns;\tand\tremember\tyour\t\nLord\t profusely,\t and\t proclaim\t His\t Purity\t\nbefore\tsunset\tand\tat\tdawn.”\t\t",
    "romanUrduTranslationText": "Arz\tki\taey\tmere\tRab!\tMere\tliye\tkoi\tnishāni\t\nkarde\tfarmaya\tteri\tnishāni\tyeh\thai\tke\tteen\t\ndin\ttu\tlogoñ\tse\tbāt\tna\tkare\tmagar\tishāre\tse\t\naur\t apne\t Rab\t ki\t bahut\t yād\t kar\t aur\t kuchh\t\ndin\t rahe (sham) aur\t tadke (subah) uski\t\npāki\tbol."
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "42",
    "arabicText": "وَإِذْ قَالَتِ ٱلْمَلَـٰٓئِكَةُ يَـٰمَرْيَمُ إِنَّ ٱللَّهَ ٱصْطَفَىٰكِ وَطَهَّرَكِ وَٱصْطَفَىٰكِ عَلَىٰ نِسَآءِ ٱلْعَـٰلَمِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t when\t the\t angels\t said,\t “O\t Maryam!\t\nIndeed\tAllah has\tchosen\tyou\tand\tpurified\t\nyou,\tand\t has\t this\t day,\t chosen\t you\tamong\t\nall\tthe\twomen\tof\tthe\tworld.”\t\t\t",
    "romanUrduTranslationText": ". Aur\t jab\t Farishtoñ\t ne\t kaha\t aey\t Maryam!\t\nbeshak\tAllah\tne\ttujhe\tchun\tliya\taur\tkhoob\t\nsuthra\t kiya\t aur\t āj\t sāre\tjahān\t ki\t aurtoñ\t se\t\ntujhe\tpasand\tkiya\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "43",
    "arabicText": "يَـٰمَرْيَمُ ٱقْنُتِى لِرَبِّكِ وَٱسْجُدِى وَٱرْكَعِى مَعَ ٱلرَّٰكِعِينَ",
    "urduTranslationText": "",
    "englishTranslationText": ". “O\t Maryam!\t Stand\t in\t reverence\t before\t\nyour\t Lord,\t prostrate yourself\t and\t bow\t\nalong\twith\tthose\twho\tbow.”\t\t",
    "romanUrduTranslationText": ". Aey\tMaryam!\tApne\trab\tke\thuzoor\tadab\tse\tkhadi\tho\taur\tuske\tliye\tsajda\tkar\taur\truku'\twāloñ\tke\t\nsāth\truku'\tkar"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "44",
    "arabicText": "ذَٰلِكَ مِنْ أَنۢبَآءِ ٱلْغَيْبِ نُوحِيهِ إِلَيْكَ ۚ وَمَا كُنتَ لَدَيْهِمْ إِذْ يُلْقُونَ أَقْلَـٰمَهُمْ أَيُّهُمْ يَكْفُلُ مَرْيَمَ وَمَا كُنتَ لَدَيْهِمْ إِذْ يَخْتَصِمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "These\tare\ttidings\tof\tthe\thidden,\twhich\tWe\tsecretly\treveal\tto\tyou\t(O\tdear\tProphet\tMuhammad -\npeace\tand\tblessings\tbe\tupon\thim);\tand\tyou\twere\tnot\tpresent\twith\tthem\twhen\tthey\tthrew\ttheir\t\npens\tto\tdraw\tlots,\tto\tknow\twho\tshould\tbe\tthe\tguardian\tof\tMaryam;\tnor\twere\tyou\tpresent\twith\t\nthem\twhen\tthey\twere\tquarrelling.\t(Yet\tyou\tknow\tof\tthese\tthings\t- this\tis\ta\tproof\tof\tyour\tbeing\ta\t\nProphet.)\t\t",
    "romanUrduTranslationText": ". Yeh\tghaib\tki\tkhabreiñ\thaiñ\tke\thum\tkhufiya\ttaur\tpar\ttumheiñ\tbatate\thaiñ\taur\ttum\tunke\tpās\tna\t\nthey\tjab\twoh\tapni\tqalamoñ\tse\tqur'a\tdālte\tthey\tke\tMaryam kis\tki\tparwarish\tmeiñ\traheñ\taur\ttum\t\nunke\tpās\tna\tthey\tjab\twoh\tjhagad\trahe\tthey\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "45",
    "arabicText": "ذَٰلِكَ مِنْ أَنۢبَآءِ ٱلْغَيْبِ نُوحِيهِ إِلَيْكَ ۚ وَمَا كُنتَ لَدَيْهِمْ إِذْ يُلْقُونَ أَقْلَـٰمَهُمْ أَيُّهُمْ يَكْفُلُ مَرْيَمَ وَمَا كُنتَ لَدَيْهِمْ إِذْ يَخْتَصِمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tremember\twhen\tthe\tangels\tsaid,\t“O\tMaryam!\tAllah gives\tyou\tglad\ttidings\tof\ta\tWord\tfrom\t\nHim,\twhose\tname\tis\tthe\tMessiah,\tEisa\tthe\tson\tof\tMaryam\t- he\twill\tbe\thonourable\tin\tthis\tworld\t\nand\tin\tthe\tHereafter,\tand\tamong\tthe\tclose\tones\t(to\tAllah).”\t\t",
    "romanUrduTranslationText": "Aur\tyād\tkaro\tjab\tFarishtoñ\tne\tMaryam se\tkaha:\taey\tMaryam!\tAllah\ttujhe\tbashārat\tdeta\thai\tapne\t\npās\tse\tek\tkalime\tki\tjis\tka\tnām\thai\tMaseeh\tĪsa Maryam ka\tbeta\troodār\thoga\tduniya\taur\tĀkhirat\t\nmeiñ\taur\tqurb\twāla"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "46",
    "arabicText": "ذَٰلِكَ مِنْ أَنۢبَآءِ ٱلْغَيْبِ نُوحِيهِ إِلَيْكَ ۚ وَمَا كُنتَ لَدَيْهِمْ إِذْ يُلْقُونَ أَقْلَـٰمَهُمْ أَيُّهُمْ يَكْفُلُ مَرْيَمَ وَمَا كُنتَ لَدَيْهِمْ إِذْ يَخْتَصِمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "“He\twill\tspeak\tto\tpeople\twhile\the\tis\tin\tthe\t\ncradle\tand\tin\this\tadulthood,\tand\twill\tbe\tof\t\nthe\tdevoted\tones.”\t\t",
    "romanUrduTranslationText": ". Aur\t logoñ\t se\t bāt\t karega\t pālne\t (Jhoole)\t\nmeiñ\t aur\t pakki\t umr\t meiñ\t aur\t khāsoñ\t\nmeiñ\thoga"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "47",
    "arabicText": "قَالَتْ رَبِّ أَنَّىٰ يَكُونُ لِى وَلَدٌۭ وَلَمْ يَمْسَسْنِى بَشَرٌۭ ۖ قَالَ كَذَٰلِكِ ٱللَّهُ يَخْلُقُ مَا يَشَآءُ ۚ إِذَا قَضَىٰٓ أَمْرًۭا فَإِنَّمَا يَقُولُ لَهُۥ كُن فَيَكُونُ",
    "urduTranslationText": "",
    "englishTranslationText": "She\tsaid,\t“My\tLord!\tHow\tcan\tI\tbear\ta\tchild\t\nwhen\t no\t man\t has\t ever\t touched\t me?”\t He\t\nsaid,\t “This\tis\thow\tAllah creates\twhatever\t\nHe\t wills;\t when\t He\t wills\t a thing,\t He\t only\t\nsays\t to\t it,\t ‘Be’\t - and\t it\t happens\t\nimmediately.”\t\t\t",
    "romanUrduTranslationText": ". Boli\taey\tmere\tRab\tmere\tbachcha\tkahāñ\tse\t\nhoga\t mujhe\t to\t kisi\t shakhs\t ne\t hāth\t na\t\nlagāya\t farmāya\t Allah\t yooñ\t hi\t paida\t karta\t\nhai\tjo\tchāhe\tjab\tkisi\tkām\tka\thukm\tfarmāye\t\nto\tus\tse\tyehi\tkehta\thai\tke\thoja\twoh\tfauran\t\nho\tjāta\thai."
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "48",
    "arabicText": "وَيُعَلِّمُهُ ٱلْكِتَـٰبَ وَٱلْحِكْمَةَ وَٱلتَّوْرَىٰةَ وَٱلْإِنجِيلَ",
    "urduTranslationText": "",
    "englishTranslationText": "“And\t Allah will\t teach\t him\t the\t Book\t and\t\nwisdom,\t and\t the\t Taurat\t(Torah)\t and\t the\t\nInjeel\t(Bible).”\t\t\t",
    "romanUrduTranslationText": "Aur\t Allah\t usey\t sikhāye\t ga\t kitāb\t aur\t\nhikmat\taur\tTaurāt aur\tInjeel."
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "49",
    "arabicText": "وَرَسُولًا إِلَىٰ بَنِىٓ إِسْرَٰٓءِيلَ أَنِّى قَدْ جِئْتُكُم بِـَٔايَةٍۢ مِّن رَّبِّكُمْ ۖ أَنِّىٓ أَخْلُقُ لَكُم مِّنَ ٱلطِّينِ كَهَيْـَٔةِ ٱلطَّيْرِ فَأَنفُخُ فِيهِ فَيَكُونُ طَيْرًۢا بِإِذْنِ ٱللَّهِ ۖ وَأُبْرِئُ ٱلْأَكْمَهَ وَٱلْأَبْرَصَ وَأُحْىِ ٱلْمَوْتَىٰ بِإِذْنِ ٱللَّهِ ۖ وَأُنَبِّئُكُم بِمَا تَأْكُلُونَ وَمَا تَدَّخِرُونَ فِى بُيُوتِكُمْ ۚ إِنَّ فِى ذَٰلِكَ لَـَٔايَةًۭ لَّكُمْ إِن كُنتُم مُّؤْمِنِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "“And\t he\t will\t be\t a\t Noble\t Messenger\t\ntowards\tthe\tDescendants\tof\tIsrael\tsaying,\t\n‘I\thave\tcome\tto\tyou with\ta\tsign\tfrom\tyour\t\nLord,\t for\t I\t mould\t a\t birdlike\t sculpture\t\nfrom\tclay\tfor\tyou,\tand\tI\tblow\tinto\tit\tand\tit\t\ninstantly\t becomes\t a\t (living)\t bird,\t by\t\nAllah’s\tcommand;\tand\tI\theal\thim\twho\twas\t\nborn\tblind,\tand\tthe\tleper,\tand\tI\trevive\tthe\t\ndead,\t by\tAllah’s\t command;\t and\t I\t tell\t you\t\nwhat\t you\teat\tand\twhat\t you\tstore\tin\t your\t\nhouses;\tundoubtedly\tin\tthese\t(miracles)\tis\t\na\tgreat\tsign\t for\t you,\tif\t you\tare\tbelievers.’\t\n(Several\tmiracles\tbestowed\tto\tProphet\tEisa\t\nare\tmentioned\there.)",
    "romanUrduTranslationText": "Aur\t Rasool\t hoga\t bani\t Isra’il\t ki\t taraf\t yeh\t\nfarmāta\t huwa\t ke\t maiñ\t tumhāre\t pās\t ek\t\nnishāni\tlāya\thooñ\ttumhāre\tRab\tki\ttaraf\tse\t\nke\tmaiñ\ttumhāre\tliye\tmitti\tse\tparind\tki\tsi\t\nmoorat\tbanāta\thooñ\tphir\tus\tmeiñ\tphoonk\t\nmārta\t hooñ\t to\t woh\t fauran\t parind\t ho\t jāti\t\nhai\tAllah\tke\thukm\tse\taur\tmaiñ\tShifa\tdeta\t\nhooñ\t mādar\t zāt\t andhe\t aur\t safed\t dāgh\t\nwāle\t ko\t aur\t maiñ\t murde\t jilāta\t (zinda\t\nkarta)\thooñ\tAllah\tke\thukm\tse\taur\ttumheiñ\t\nbatata\t hooñ\t jo\t tum\t khāte\t aur\t jo\t apne\t\ngharoñ\t meiñ\t jama\t kar\t ke\t rakhte\t ho\t\nbeshak\t in\t bātoñ\t meiñ\t tumhāre\t liye\t badi\t\nnishāni\thai\tagar\ttum\tImān\trakhte\tho"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "50",
    "arabicText": "وَمُصَدِّقًۭا لِّمَا بَيْنَ يَدَىَّ مِنَ ٱلتَّوْرَىٰةِ وَلِأُحِلَّ لَكُم بَعْضَ ٱلَّذِى حُرِّمَ عَلَيْكُمْ ۚ وَجِئْتُكُم بِـَٔايَةٍۢ مِّن رَّبِّكُمْ فَٱتَّقُوا۟ ٱللَّهَ وَأَطِيعُونِ",
    "urduTranslationText": "",
    "englishTranslationText": "‘And\t I\t come\t confirming\t the\t Taurat\t\n(Torah)\t - the\t Book\t before\t me\t - and\t to\t make\t lawful\t for\t you\t some\t of\t the\t things\t which\t were\t\nforbidden\tto\tyou,\tand\tI\thave\tcome\tto\tyou\twith\ta\tsign\tfrom\tyour\tLord\t- therefore\tfear\tAllah and\t\nobey\tme.’",
    "romanUrduTranslationText": "Aur\t tasdeeq\tkarta\tāaya\thooñ\tapne\tse\tpahli\tKitāb\tTaurāt ki\taur\tis\tliye\tke\thalāl\tkaroñ\t tumhāre\t\nliye\tkuch\twoh\tcheezeiñ\tjo\ttum\tpar\tharām\ttheiñ\taur\tmaiñ\ttumhāre\tpās\ttumhāre\tRab\tki\ttaraf\tse\t\nnishāni\tlāya\thoon,\tto\tAllah\tse\tdaro\taur\tmera\thukm\tmāno"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "51",
    "arabicText": "إِنَّ ٱللَّهَ رَبِّى وَرَبُّكُمْ فَٱعْبُدُوهُ ۗ هَـٰذَا صِرَٰطٌۭ مُّسْتَقِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "Undoubtedly\tAllah is\tthe\tLord\tof\tall\t- mine\tand\tyours\t- so\tworship\tHim\tonly; this\tis\tthe\tStraight\t\nPath.’\t”\t",
    "romanUrduTranslationText": ". Beshak\tmera\ttumhara\tsab\tka\tRab\tAllah\thai\tto\tusi\tko\tpoojo\tyeh\thai\tseedha\trāsta\t."
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "52",
    "arabicText": "۞ فَلَمَّآ أَحَسَّ عِيسَىٰ مِنْهُمُ ٱلْكُفْرَ قَالَ مَنْ أَنصَارِىٓ إِلَى ٱللَّهِ ۖ قَالَ ٱلْحَوَارِيُّونَ نَحْنُ أَنصَارُ ٱللَّهِ ءَامَنَّا بِٱللَّهِ وَٱشْهَدْ بِأَنَّا مُسْلِمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "So\twhen\t Eisa\t sensed\t their\t disbelief\t he\t said,\t “Who\twill\t be\tmy\t aides\t towards\t(in\t the\t cause\t of)\t\nAllah?”\tThe\tdisciples\tsaid,\t“We\tare\tthe\taides\tof\tAllah’s\treligion;\twe\tbelieve\tin\tAllah,\tand\tyou\tbear\t\nwitness\tthat\twe\tare\tMuslims.”\t",
    "romanUrduTranslationText": ". Phir\tjab\tĪsa\tne\tunse\tkufr\tpāya\tbola\tkaun\tmere\tmadad-gār\thote\thaiñ\tAllah\tki\ttaraf\thawāriyoñ\tne\t\nkaha\tham\tDeen-e-Khuda ke\tmadad-gār\thaiñ\tham\tAllah\tpar\tImān\tlāye\taur\tāp\tgawah\tho\tjāyeñ\tke\t\nham\tMusalman\thaiñ"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "53",
    "arabicText": "رَبَّنَآ ءَامَنَّا بِمَآ أَنزَلْتَ وَٱتَّبَعْنَا ٱلرَّسُولَ فَٱكْتُبْنَا مَعَ ٱلشَّـٰهِدِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "“Our\tLord!\tWe\thave\tbelieved\tin\twhat\tYou\t\nhave\t sent\t down\tand\twe\t follow\t the\tNoble\t\nMessenger,\ttherefore\trecord\tus\tamong\tthe\t\nwitnesses\tof\tthe\ttruth.”",
    "romanUrduTranslationText": "Aey\tRab\thamāre\thum\tus\tpar\tImān\tlāye\tjo\t\ntu\t ne\t utāra\t aur\t Rasool\t ke\t tābe'\t huwe\t tu\t\nhameiñ\thaq\tpar\tgawāhi\tdene\twāloñ\tmeiñ\t\nlikh\tle."
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "54",
    "arabicText": "وَمَكَرُوا۟ وَمَكَرَ ٱللَّهُ ۖ وَٱللَّهُ خَيْرُ ٱلْمَـٰكِرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t the\t disbelievers\t conspired\t (to\t kill\t\nEisa\t ),\t and\t Allah covertly\t planned\t to\t\ndestroy\t them;\t and\t Allah is\t the\t best\t of\t\nsecret\tplanners.",
    "romanUrduTranslationText": "Aur\tkāfiroñ\tne\tmakr\tkiya\taur\tAllah\tne\tun\t\nke\t halāk\t ki\t khufiya\t tadbeer\t farmāyi\t aur\t\nAllah\tsab\tse\tbehtar\tchupi\ttadbeer\twāla\thai\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "55",
    "arabicText": "إِذْ قَالَ ٱللَّهُ يَـٰعِيسَىٰٓ إِنِّى مُتَوَفِّيكَ وَرَافِعُكَ إِلَىَّ وَمُطَهِّرُكَ مِنَ ٱلَّذِينَ كَفَرُوا۟ وَجَاعِلُ ٱلَّذِينَ ٱتَّبَعُوكَ فَوْقَ ٱلَّذِينَ كَفَرُوٓا۟ إِلَىٰ يَوْمِ ٱلْقِيَـٰمَةِ ۖ ثُمَّ إِلَىَّ مَرْجِعُكُمْ فَأَحْكُمُ بَيْنَكُمْ فِيمَا كُنتُمْ فِيهِ تَخْتَلِفُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Remember\twhen\tAllah said,\t“O\tEisa!\tI\twill\t\nkeep\tyou\talive\ttill\tyour\t full\tage,\tand\traise\t\nyou\t towards\t Me,\t and\t cleanse\t you\t of\t the\t\ndisbelievers\t and\t give\t your\t followers\t\ndominance\tover\tthe\tdisbelievers\tuntil\tthe\t\nDay\t of\t Resurrection;\t then\t you\t will\t all\t\nreturn\tto\tMe,\tso\tI\tshall\tjudge\tbetween\tyou\t\nconcerning\t the\t matter\t in\t which\t you\t\ndispute.”\t",
    "romanUrduTranslationText": "Yād\t karo\t jab\t Allah\t ne\t farmāya\t aey\t Īsa!\t\nmaiñ\t tujhe\t poori\t umr\t tak\t pahuñchaoñga\t\naur\ttujhe\tapni\ttaraf\tutha\tlooñga\taur\ttujhe\t\nkāfiroñ\t se\t pāk\t kar\t dooñga\t aur\t tere\t\npairawoñ\t ko\t qiyamat\t tak\t tere\t munkiroñ\t\npar\tghalba\tdooñga\tphir\ttum\tsab\tmeri\ttaraf\t\npalat\t kar\t āoge\t to\t maiñ\t tum\t meiñ\t faisla\t\nfarma\tdooñga\tjis\tbāt\tmeiñ\tjhagadte\tho\t."
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "56",
    "arabicText": "إِذْ قَالَ ٱللَّهُ يَـٰعِيسَىٰٓ إِنِّى مُتَوَفِّيكَ وَرَافِعُكَ إِلَىَّ وَمُطَهِّرُكَ مِنَ ٱلَّذِينَ كَفَرُوا۟ وَجَاعِلُ ٱلَّذِينَ ٱتَّبَعُوكَ فَوْقَ ٱلَّذِينَ كَفَرُوٓا۟ إِلَىٰ يَوْمِ ٱلْقِيَـٰمَةِ ۖ ثُمَّ إِلَىَّ مَرْجِعُكُمْ فَأَحْكُمُ بَيْنَكُمْ فِيمَا كُنتُمْ فِيهِ تَخْتَلِفُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "“So\t I\t shall\t mete\t a\t severe\t punishment\t to\t\nthose\twho\tdisbelieve,\tin\tthis\tworld\tand\tin\t\nthe\tHereafter;\tand they\twill\tnot\thave\tany\t\nsupporters.”\t",
    "romanUrduTranslationText": "To\twoh jo\tkāfir\thuwe\tmaiñ\tunheiñ\tduniya\t\no\tākhirat\tmeiñ\tsakht\t‘azāb\tkaruñga\taur\tun\t\nka\tkoi\tmadad-gār\tna\thoga\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "57",
    "arabicText": "وَأَمَّا ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ فَيُوَفِّيهِمْ أُجُورَهُمْ ۗ وَٱللَّهُ لَا يُحِبُّ ٱلظَّـٰلِمِينَ`",
    "urduTranslationText": "",
    "englishTranslationText": "“And\tfor\tthose\twho\tbelieved\tand\tdid\tgood\t\ndeeds,\t Allah will\t give\t them\t their\t full\t\nreward;\t and\t Allah does\t not\t like\t the\t\nunjust.”\t\t",
    "romanUrduTranslationText": "Aur\twoh\tjo\tImān\tlāye\taur\tachche\tkām\tkiye\t\nAllah\t unka\t neg (Ájr) unheiñ\t bharpoor\t\ndega\taur\tzālim\tAllah\tko\tnahi\tbhāte."
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "58",
    "arabicText": "ذَٰلِكَ نَتْلُوهُ عَلَيْكَ مِنَ ٱلْـَٔايَـٰتِ وَٱلذِّكْرِ ٱلْحَكِيمِ",
    "urduTranslationText": "",
    "englishTranslationText": "“And\tfor\tthose\twho\tbelieved\tand\tdid\tgood\t\nThese\t are\t some\t verses\t that\tWe\t recite\t to\t\nyou,\tand\tadvice\tfull\tof\twisdom.",
    "romanUrduTranslationText": "Yeh\t ham\t tum\t par\t padhte\t haiñ\t kuch\t\nĀyatyeñ\taur\thikmat\twāli\tnasihat"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "59",
    "arabicText": "إِنَّ مَثَلَ عِيسَىٰ عِندَ ٱللَّهِ كَمَثَلِ ءَادَمَ ۖ خَلَقَهُۥ مِن تُرَابٍۢ ثُمَّ قَالَ لَهُۥ كُن فَيَكُونُ",
    "urduTranslationText": "",
    "englishTranslationText": "The\texample\tof\tEisa\twith\tAllah is\tlike\tthat\tof\tAdam;\tHe\tcreated\thim\t(Adam)\tfrom\tclay\tand\tthen\t\nsaid\tto\thim,\t“Be”\t- and\tit\tthereupon\thappens!",
    "romanUrduTranslationText": ". Īsa ki\tkahāwat\tAllah\tke\tnazdeek\tĀdam ki\ttarah\thai\tusey\tmitti\tse\tbanaya\tphir\tfarmāya\tho\tja\twoh\t\nfauran\tho\tjāta\thai\t."
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "60",
    "arabicText": "ٱلْحَقُّ مِن رَّبِّكَ فَلَا تَكُن مِّنَ ٱلْمُمْتَرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "O\tlistener!\t(followers\tof\tthis\tProphet)\tThis\tis\tthe\tTruth\tfrom\tyour\tLord,\tso\tnever\tbe\tof\tthose\twho\t\ndoubt.\t",
    "romanUrduTranslationText": ". Aey\tsun\tne\twāle!\tyeh\ttere\tRab\tki\ttaraf\tse\thaq\t[hai]\ttu\tshak\twāloñ\tmeiñ\tna\thona"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "61",
    "arabicText": "فَمَنْ حَآجَّكَ فِيهِ مِنۢ بَعْدِ مَا جَآءَكَ مِنَ ٱلْعِلْمِ فَقُلْ تَعَالَوْا۟ نَدْعُ أَبْنَآءَنَا وَأَبْنَآءَكُمْ وَنِسَآءَنَا وَنِسَآءَكُمْ وَأَنفُسَنَا وَأَنفُسَكُمْ ثُمَّ نَبْتَهِلْ فَنَجْعَل لَّعْنَتَ ٱللَّهِ عَلَى ٱلْكَـٰذِبِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Therefore\tsay\tto\tthose\twho\tdispute\twith\tyou\t(O\tdear\tProphet\tMuhammad - peace\tand\tblessings\t\nbe\tupon\thim)\tconcerning\tEisa\tafter\tthe\tknowledge\thas\tcome\tto\tyou,\t“Come!\tLet\tus\tsummon\tour\t\nsons\tand\tyour\tsons,\tand\tour\twomen\tand\tyour\twomen,\tand\tourselves\tand\tyourselves\t- then\tpray\t\nhumbly,\t thereby\t casting\t the\t curse\t of\tAllah upon\t the\tliars!”\t(The\t Christians\t did\t not\t accept\t this\t\nchallenge.)\t",
    "romanUrduTranslationText": ". Phir\taey\tMehboob!\tJo\ttum\tse Īsa ke\tbāre\tmein\thujjat\tkareiñ\tb’ad\tiske\tke\ttumheiñ\tilm\tāchuka\tto\t\nun\tse\tfarma\tdo\tāao\tham\ttum\tbalāyeiñ\tapne\tbete\taur\ttumhāre\tbete\taur\tapni\taurteiñ\taur\ttumhāri\t\naurteiñ\taur\tapni\tjāneiñ\taur\ttumhāri\tjāneiñ\tphir\tmubahela\tkareiñ\tto\tjhootoñ\tpar\tAllah\tki\tla'nat\t\ndāleiñ"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "62",
    "arabicText": "إِنَّ هَـٰذَا لَهُوَ ٱلْقَصَصُ ٱلْحَقُّ ۚ وَمَا مِنْ إِلَـٰهٍ إِلَّا ٱللَّهُ ۚ وَإِنَّ ٱللَّهَ لَهُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
    "urduTranslationText": "",
    "englishTranslationText": "This\t undoubtedly\t is\t the\t true\t narrative;\t\nthere\t is\t none\t worthy\t of\t worship\t except\t\nAllah;\tand\tAllah is\tthe\tAlmighty,\tthe\tWise",
    "romanUrduTranslationText": "Yehi\t beshak\t sachcha\t bayān\t hai\t aur\t Allah\t\nke\t siwa\t koi\t Ma'bood\t nahi\t aur\t beshak\t\nAllah\thi\tghalib\thai\thikmat\twāla.\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "63",
    "arabicText": "فَإِن تَوَلَّوْا۟ فَإِنَّ ٱللَّهَ عَلِيمٌۢ بِٱلْمُفْسِدِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "So\t if\t they\t turn\t away,\t then\t indeed\t Allah\nknows\tthose\twho\tcause\tturmoil.\t",
    "romanUrduTranslationText": "Phir\t agar\t woh\t muñh\t phereiñ\t to\t Allah\t\nfasādiyoñ\tko\tjānta\thai.\t\n"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "64",
    "arabicText": "قُلْ يَـٰٓأَهْلَ ٱلْكِتَـٰبِ تَعَالَوْا۟ إِلَىٰ كَلِمَةٍۢ سَوَآءٍۭ بَيْنَنَا وَبَيْنَكُمْ أَلَّا نَعْبُدَ إِلَّا ٱللَّهَ وَلَا نُشْرِكَ بِهِۦ شَيْـًۭٔا وَلَا يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَابًۭا مِّن دُونِ ٱللَّهِ ۚ فَإِن تَوَلَّوْا۟ فَقُولُوا۟ ٱشْهَدُوا۟ بِأَنَّا مُسْلِمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Say\t (O\t dear\t Prophet\t Muhammad - peace\t\nand\t blessings\t be\t upon\t him),\t “O\t People\t\ngiven\t the\tBook(s)!\t Come\t towards\ta\tword\t\nwhich\t is\t common\t between\t us\t and\t you,\t\nthat\twe\tshall\tworship\tno\tone\texcept\tAllah,\t\nand\tthat\twe\tshall\tnot\tascribe\tany\tpartner\t\nto\tHim,\tand\tthat\tnone\tof\tus\tshall\ttake\tone\t\nanother\t as\t lords\t besides\t Allah”;\t then\t if\t\nthey\t do\t not\t accept\t say,\t “Be\t witness\t that\t\n(only)\twe\tare\tMuslims.”",
    "romanUrduTranslationText": "Tum\t farmao\t aey\t kitābiyoñ\t aise\t kalme\t ki\t\ntaraf\t āao\t jo\t ham\t meiñ\t tum\t meiñ\t yaksāñ\t\nhaiñ\tyeh\tke\tibādat\tna\tkareiñ\tmagar\tkhuda\t\nki\taur\tus\tka\tshareek\tkisi\tko\tna\tkareiñ\taur\t\nham\tmeiñ\tkoi\tek\tdoosre\tko\tRab\tna\tbana\tle\t\nAllah\tke\tsiwa\tphir\tagar\twoh\tna\tmāneiñ\tto\t\nkeh\tdo\ttum\tgawah\traho\tke\tham\tMusalman\t\nhaiñ.\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "65",
    "arabicText": "يَـٰٓأَهْلَ ٱلْكِتَـٰبِ لِمَ تُحَآجُّونَ فِىٓ إِبْرَٰهِيمَ وَمَآ أُنزِلَتِ ٱلتَّوْرَىٰةُ وَٱلْإِنجِيلُ إِلَّا مِنۢ بَعْدِهِۦٓ ۚ أَفَلَا تَعْقِلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "O\t People\t given\t the\t Book(s)!\tWhy\t do\t you\t\nargue\tabout\t Ibrahim,\twhereas\t the\tTaurat\t\n(Torah)\t and\t the\t Injeel\t (Bible)\t were\t not\t\nsent\tdown\tuntil\tafter\thim?\tSo\tdo\tyou\tnot\t\nhave\tsense?",
    "romanUrduTranslationText": "Aey\tKitāb\t wālo!\tIbrāheem ke\t baare meiñ\t\nkyuñ\t jhagardte ho\t Taurāt-o-Injeel to\t na\t\nutri\tmagar\tunke\tb’ād\t to\t kiya\t tumheiñ\taql\t\nnahi!\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "66",
    "arabicText": "هَـٰٓأَنتُمْ هَـٰٓؤُلَآءِ حَـٰجَجْتُمْ فِيمَا لَكُم بِهِۦ عِلْمٌۭ فَلِمَ تُحَآجُّونَ فِيمَا لَيْسَ لَكُم بِهِۦ عِلْمٌۭ ۚ وَٱللَّهُ يَعْلَمُ وَأَنتُمْ لَا تَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Listen!\tThis\twas\twhat\tyou\targued\tabout\t-\nof\twhich\tyou\thave\tsome\tknowledge\t- why\t\ndo\t you\t then\t argue\t about\t the\t matter\t you\t\ndo\tnot\thave\tany\tknowledge\tof?\tAnd\tAllah\nknows\twhereas\tyou\tdo\tnot\tknow.\t",
    "romanUrduTranslationText": "Sunte\tho!\tYeh\tjo\ttum\tho\tis\tmeiñ\tjhagde\tjis\t\nka tumheiñ\t ilm\t tha\t to\t is\t meiñ\t kiyuñ\t\njhagadte\tho\tjis\tka\ttumheiñ\tilm\thi\tnahi\taur\t\nAllah\tjānta\thai\taur\ttum\tnahi\tjānte"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "67",
    "arabicText": "مَا كَانَ إِبْرَٰهِيمُ يَهُودِيًّۭا وَلَا نَصْرَانِيًّۭا وَلَـٰكِن كَانَ حَنِيفًۭا مُّسْلِمًۭا وَمَا كَانَ مِنَ ٱلْمُشْرِكِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Ibrahim\twas\tneither\ta\tJew\tnor\ta\tChristian;\t\nbut\t he\t was\t a\t Muslim,\t free\t from\t all\t\nfalsehood;\tand\twas\tnot\tof\tthe\tpolytheists.",
    "romanUrduTranslationText": "Ibrāheem na\tYahūdi\tthey\tna\tNasrāni\tbalke\t\nhar\t bātil\t se\t juda\t Musalman\t the\t aur\t\nmushrikoñ\tse\tna\tthey"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "68",
    "arabicText": "إِنَّ أَوْلَى ٱلنَّاسِ بِإِبْرَٰهِيمَ لَلَّذِينَ ٱتَّبَعُوهُ وَهَـٰذَا ٱلنَّبِىُّ وَٱلَّذِينَ ءَامَنُوا۟ ۗ وَٱللَّهُ وَلِىُّ ٱلْمُؤْمِنِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Undoubtedly\tamong\tall\tmankind\twho\thave\t the\tbest\tclaim\t to\t Ibrahim\tare\t those\twho\t followed\t\nhim,\tand\t this\t Prophet\t(Muhammad - peace\t and\t blessings\t be\t upon\t him)\tand\t the\t believers;\tand\t\nAllah is\tthe\tGuardian\tof\tthe\tbelievers.\t",
    "romanUrduTranslationText": "Beshak\tsab\tlogoñ\tse\tIbrāheem ke\tziyāda\thaqdār\twoh\tthey\tjo\tun\tke\tpairo\thuwe\taur\tyeh\tNabi\taur\t\nImān\twāle\taur\tImān\twāloñ\tka\twāli\tAllah\thai\t."
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "69",
    "arabicText": "وَدَّت طَّآئِفَةٌۭ مِّنْ أَهْلِ ٱلْكِتَـٰبِ لَوْ يُضِلُّونَكُمْ وَمَا يُضِلُّونَ إِلَّآ أَنفُسَهُمْ وَمَا يَشْعُرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Undoubtedly\tamong\tall\tmankind\twho\thave\t the\tbest\tclaim\t to\t Ibrahim\tare\t those\twho\t followed\t\nhim,\tand\t this\t Prophet\t(Muhammad - peace\t and\t blessings\t be\t upon\t him)\tand\t the\t believers;\tand\t\nAllah is\tthe\tGuardian\tof\tthe\tbelievers.\t",
    "romanUrduTranslationText": ". Kitābiyoñ\tka\tek\tgiroh\tdil\tse\tchāhta\thai\tke\tkisi\ttarah\ttumheiñ\tgumrah\tkar\tdeiñ\taur\twoh\tapne\thi\t\nāp\tko\tgumrah\tkarte\thaiñ\taur\tunheiñ\tsha'oor\tnhi"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "70",
    "arabicText": "يَـٰٓأَهْلَ ٱلْكِتَـٰبِ لِمَ تَكْفُرُونَ بِـَٔايَـٰتِ ٱللَّهِ وَأَنتُمْ تَشْهَدُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "O\t People\t given\t the\t Book(s)!\t Why\t do\t you\t disbelieve\t in\t the\t signs of\t Allah,\t whereas\t you\t\nyourselves\tare\twitnesses?",
    "romanUrduTranslationText": "Aey\tkitābiyoñ!\tAllah\tki\tĀyatoñ\tse\tkyuñ\tkufr\tkarte\tho\thalāñke\ttum\tkhud\tgawāh ho"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "71",
    "arabicText": "يَـٰٓأَهْلَ ٱلْكِتَـٰبِ لِمَ تَلْبِسُونَ ٱلْحَقَّ بِٱلْبَـٰطِلِ وَتَكْتُمُونَ ٱلْحَقَّ وَأَنتُمْ تَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "O\t People\t given\t the\t Book(s)!\tWhy\t do\t you\t\nmix\t the\t truth\twith\t falsehood\tand\tconceal\t\nthe\ttruth,\twhereas\tyou\tknow?\t",
    "romanUrduTranslationText": "Aey\t kitābiyoñ!\t Haq\t meiñ\t bātil\t kiyuñ\t\nmilāte\t ho\t aur\t haq\t kiyuñ\t chupāte\t ho\t\nhalāñke\ttumheiñ\tkhabar\thai\t."
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "72",
    "arabicText": "وَقَالَت طَّآئِفَةٌۭ مِّنْ أَهْلِ ٱلْكِتَـٰبِ ءَامِنُوا۟ بِٱلَّذِىٓ أُنزِلَ عَلَى ٱلَّذِينَ ءَامَنُوا۟ وَجْهَ ٱلنَّهَارِ وَٱكْفُرُوٓا۟ ءَاخِرَهُۥ لَعَلَّهُمْ يَرْجِعُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\ta\tgroup\tamong\t the\t People\tgiven\t the\t\nBook(s)\t said,\t “Believe\t in\t what\t has\t been\t\nsent\tdown\tto\tthe\tbelievers\tin\tthe\tmorning\t\nand\tdeny\tit\tby\tevening\t- perhaps\tthey\t(the\t\nMuslims)\tmay\tturn\tback\t(disbelieve).”\t",
    "romanUrduTranslationText": "Aur\t kitābiyoñ\t ka\t ek\t giroh\t bola\t woh\t jo\t\nImān\t wāloñ\t par\t utra\t subah\t ko\t us\t par\t\nImān\t lāo\t aur\t shām\t ko\t munkir\t ho\t jāo\t\nshāyad\twoh\tphir\tjāyeiñ\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "73",
    "arabicText": "وَلَا تُؤْمِنُوٓا۟ إِلَّا لِمَن تَبِعَ دِينَكُمْ قُلْ إِنَّ ٱلْهُدَىٰ هُدَى ٱللَّهِ أَن يُؤْتَىٰٓ أَحَدٌۭ مِّثْلَ مَآ أُوتِيتُمْ أَوْ يُحَآجُّوكُمْ عِندَ رَبِّكُمْ ۗ قُلْ إِنَّ ٱلْفَضْلَ بِيَدِ ٱللَّهِ يُؤْتِيهِ مَن يَشَآءُ ۗ وَٱللَّهُ وَٰسِعٌ عَلِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "“And\tdo\tnot\tbelieve\tin\tanyone\texcept\thim\t\nwho\t follows\t your\t religion”;\t say\t (O\t dear\t\nProphet\tMuhammad - peace\t and\t blessings\t\nbe\tupon\thim),\t“Only\tAllah’s\tguidance\tis\tthe\t\ntrue\tguidance”\t- (so\twhy\tnot\tbelieve\tin\tit)\tif\t\nsomeone\t has\t been\t given\t similar\t to\t what\t\nwas\t given\t to\t you,\t or\t if\t someone\t may\t be\t\nable\t to\t evidence\t it\t against\t you\t before\t\nyour\t Lord;\t say\t (O\t dear\t Prophet\t\nMuhammad - peace\tand\tblessings\tbe\tupon\t\nhim),\t “Undoubtedly\t the\t munificence\t lies\t\nonly\t in\t Allah’s\t Hand\t (control);\t He\t may\t\nbestow\t upon\t whomever\t He\t wills;\t and\t\nAllah is\tMost\tCapable,\tAll\tKnowing.”\t\t",
    "romanUrduTranslationText": "Aur\tyaqeen\tna\tlāo\tmagar\tuska\tjo\ttumhāre\t\ndeen\tka\tpairo\tho\ttum\tfarma\tdo\tke\tAllah\thi\t\nki\thidāyat\thidāyat\thai\t(yaqeen\tkāhe\tka\tna\nlāo)\tiska\tke\tkisi\tko\tmile\tjaisa\ttumheiñ\tmila\t\nya\tkoi\ttum\tpar\thujjat\tla\tsake\ttumhāre\tRab\t\nke\tpās\ttum\tfarma\tdo\tke\tfazl\tto\tAllah\thi\tke\t\nhāth\t hai\t jise\t chāhe\t de\t aur\t Allah\t wus'at\t\nwāla\tilm\twāla\thai.\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "74",
    "arabicText": "يَخْتَصُّ بِرَحْمَتِهِۦ مَن يَشَآءُ ۗ وَٱللَّهُ ذُو ٱلْفَضْلِ ٱلْعَظِيمِ",
    "urduTranslationText": "",
    "englishTranslationText": "“He\t chooses\t by\tHis\tmercy,\twhomever\tHe\t\nwills;\t and\t Allah is\t the\t Owner\t of\t Great\t\nMunificence.”\t\t\t",
    "romanUrduTranslationText": ". Apni\t rahmat\t se\t khās\t karta\t hai\tjise\t chāhe\t\naur\tAllah\tbade\tfazl\twāla hai\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "75",
    "arabicText": "۞ وَمِنْ أَهْلِ ٱلْكِتَـٰبِ مَنْ إِن تَأْمَنْهُ بِقِنطَارٍۢ يُؤَدِّهِۦٓ إِلَيْكَ وَمِنْهُم مَّنْ إِن تَأْمَنْهُ بِدِينَارٍۢ لَّا يُؤَدِّهِۦٓ إِلَيْكَ إِلَّا مَا دُمْتَ عَلَيْهِ قَآئِمًۭا ۗ ذَٰلِكَ بِأَنَّهُمْ قَالُوا۟ لَيْسَ عَلَيْنَا فِى ٱلْأُمِّيِّـۧنَ سَبِيلٌۭ وَيَقُولُونَ عَلَى ٱللَّهِ ٱلْكَذِبَ وَهُمْ يَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Among\t the\t People\t given\t the\t Book(s)\t is\t\none\twho,\tif\t you\t trust\t him\twith\t a\t heap\t of\t\ntreasure,\twill\treturn\tit\tto\tyou;\tand\tamong\t\nthem\t is\t one\t who,\t if\t you\t trust\t him\t with\t\n(just)\tone\tcoin,\twill\tnot\treturn\tit\tto\tyou\tunless\tyou\tconstantly\tstand\tover\thim\t(keep\tdemanding);\t\nthat\tis\t because\t they\t say,\t “We\t are\t not\t obliged\tin\t any\tway,\tin\t the\t case\t of\tilliterates”;\t and\t they\t\npurposely\tfabricate\tlies\tagainst\tAllah.\t",
    "romanUrduTranslationText": ". Aur\tkitābiyoñ\tmeiñ\tkoi\twoh\thai\tke\tagar\ttu\t\nus\t ke\t pās\t ek\t dher\t amānat\t rakhe\t to\t woh\t\ntujhe\t ada karde\t ga\t aur\t un\t meiñ\t koi\t woh\t\nhai\t ke\t agar\t ek\t asharfi\t un\t ke\t pās\t amānat\t\nrakhe\t to\t woh\t tujhe\t pher\t kar\t na\t dega\t\nmagar\tjab\ttak\ttu\tus\tke\tsar\tpar\tkhada\trahe\t\nyeh\tis\tliye ke\twoh\tkahte\thaiñ\tke\tan-padho\t\nke\t mu'āmle\t meiñ\t ham\t par\t koi\t muākhza\t\nnahi\taur\tAllah\tpar\tjān\tboojh\tkar\tjhoot\tbāndhte\thaiñ.\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "76",
    "arabicText": "بَلَىٰ مَنْ أَوْفَىٰ بِعَهْدِهِۦ وَٱتَّقَىٰ فَإِنَّ ٱللَّهَ يُحِبُّ ٱلْمُتَّقِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Yes,\t why\t not?\t Whoever\t fulfilled\t his\t pledge\t and\t practised\t piety\t- and\t indeed\t Allah loves\t the\t\npious.\t\t",
    "romanUrduTranslationText": "Hāñ\tkiyuñ\tnahi\tjisne\tapna\t‘ahed\tpoora\tkiya\taur\tparhez-gāri\tki\taur\tbeshak\tparhez-gār\tAllah\tko\t\nkhush\tāate\thaiñ.\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "77",
    "arabicText": "إِنَّ ٱلَّذِينَ يَشْتَرُونَ بِعَهْدِ ٱللَّهِ وَأَيْمَـٰنِهِمْ ثَمَنًۭا قَلِيلًا أُو۟لَـٰٓئِكَ لَا خَلَـٰقَ لَهُمْ فِى ٱلْـَٔاخِرَةِ وَلَا يُكَلِّمُهُمُ ٱللَّهُ وَلَا يَنظُرُ إِلَيْهِمْ يَوْمَ ٱلْقِيَـٰمَةِ وَلَا يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "Those\twho\taccept\tabject\tprices\tin\texchange\tof\tAllah’s\tcovenant\tand\ttheir\toaths,\tdo\tnot\thave\ta\t\nportion\tin\tthe\tHereafter\t- Allah will\tneither\tspeak\tto\tthem\tnor\tlook\ttowards\tthem\ton\tthe\tDay\tof\t\nResurrection,\tnor\twill\tHe\tpurify\tthem;\tand\tfor\tthem\tis\ta\tpainful\tpunishment.\t",
    "romanUrduTranslationText": "woh\tjo\tAllah\tke\t‘ahed\taur apni\tqasmoñ\tko\tbadale\tzaleel\tdām\tlete\thaiñ\tākhirat\tmeiñ\tunka\tkuch\t\nhissa\tnahi\taur\tAllah\tna\tunse\tbāt\tkare\tna\tunki\ttaraf\tnazar\tfarmāye\tqiyāmat\tke\tdin\taur\tna\tunheiñ\t\npāk\tkare\taur\tunke\tliye\tdard-nāk\tazāb\thai"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "78",
    "arabicText": "وَإِنَّ مِنْهُمْ لَفَرِيقًۭا يَلْوُۥنَ أَلْسِنَتَهُم بِٱلْكِتَـٰبِ لِتَحْسَبُوهُ مِنَ ٱلْكِتَـٰبِ وَمَا هُوَ مِنَ ٱلْكِتَـٰبِ وَيَقُولُونَ هُوَ مِنْ عِندِ ٱللَّهِ وَمَا هُوَ مِنْ عِندِ ٱللَّهِ وَيَقُولُونَ عَلَى ٱللَّهِ ٱلْكَذِبَ وَهُمْ يَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tamongst\t them\tare\t some\twho\t distort\t\n(change\t words\t of)\t the\t Book\t with\t their\t\ntongues,\t so\t that\t you\t may\t think\t that\t this\t\nalso\tis\tin\tthe\tBook\twhereas\tit\tis\tnot\tin\tthe\t\nBook;\t and\t they\t say,\t “This\t is\t from\t Allah”\t\nwhereas\t it\t is\t not\t from\t Allah;\t and\t they\t\nfabricate\tlies\t against\tAllah,\t whereas\t they\t\nknow.\t",
    "romanUrduTranslationText": "Aur\t un\t meiñ\t kuchh\t woh\t haiñ\t jo\t zabān\t\npher\t kar\t kitāb\t meiñ\t mel\t(milāwat)\t karte\t\nhaiñ\tke\ttum\tsamjho\tyeh\tbhi\tkitāb\tmeiñ\thai\t\naur\t woh\t kitāb\t meiñ\t nahi\t aur\t woh\t kahte\t\nhaiñ\tyeh\tAllah\tke\tpās\tse\thai\taur\twoh\tAllah\t\nke\t pās\t se\t nahi\t aur\t Allah\t par\t deeda\t wa\t\ndānista\tjhoot\tbāndhte\thaiñ\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "79",
    "arabicText": "مَا كَانَ لِبَشَرٍ أَن يُؤْتِيَهُ ٱللَّهُ ٱلْكِتَـٰبَ وَٱلْحُكْمَ وَٱلنُّبُوَّةَ ثُمَّ يَقُولَ لِلنَّاسِ كُونُوا۟ عِبَادًۭا لِّى مِن دُونِ ٱللَّهِ وَلَـٰكِن كُونُوا۟ رَبَّـٰنِيِّـۧنَ بِمَا كُنتُمْ تُعَلِّمُونَ ٱلْكِتَـٰبَ وَبِمَا كُنتُمْ تَدْرُسُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "It\tis\tnot\tfor\tany\thuman\tto\twhom\tAllah has\t\ngiven\t the\t Book\t and\t wisdom\t and\t\nProphethood,\t that\t he\t should\t afterwards\t\nsay\t to\t the\tpeople,\t“Leave\t(the\tworship\tof)\t\nAllah and\t be\t my\t worshippers”\t - but\t he\t\nwill\tsurely\tsay,\t“Be\tsincere\tworshippers\tof\t\nAllah,\t because\t you\t teach\t the\t Book\t and\t\nyou\tpreach\tfrom\tit.”\t",
    "romanUrduTranslationText": "Kisi\t ādmi\t ka\t yeh\t haq\t nahi\t ke\t Allah\t usey\t\nKitāb\t aur\t hukm\t wa Paighambari\t de\t phir\t\nwoh\tlogoñ\t se\t kahe\t ke\tAllah\t ko\t chord\t kar\t\nmere\t bande\t ho\t jāo\t is\t sabab\t se\t ke\t tum\t\nkitāb\t sikhāte\t ho\t aur\t is\t se\t ke\t tum\t dars\t\nkarte\tho\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "80",
    "arabicText": "وَلَا يَأْمُرَكُمْ أَن تَتَّخِذُوا۟ ٱلْمَلَـٰٓئِكَةَ وَٱلنَّبِيِّـۧنَ أَرْبَابًا ۗ أَيَأْمُرُكُم بِٱلْكُفْرِ بَعْدَ إِذْ أَنتُم مُّسْلِمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tnor\twill\the\tcommand\tyou\t to\tappoint\t\nthe\t angels\t and\t the\t Prophets\t as\t Gods;\t\nwould\t he\t (a\t Prophet)\t command\t you\t to\t\ndisbelieve\t after\t you\t have\t become\t\nMuslims?",
    "romanUrduTranslationText": "Aur\t na\t tumheiñ\t yeh\t hukm\t dega\t ke\t\nFirishtoñ\t aur\t Paighambaroñ\t ko\t khuda\t\nthahra\tlo; kya\ttumheiñ\tkufr\tka\thukm\tdega\t\nb’ād\tiske\tke\ttum\tMusalman\tho\tliye?\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "81",
    "arabicText": "وَإِذْ أَخَذَ ٱللَّهُ مِيثَـٰقَ ٱلنَّبِيِّـۧنَ لَمَآ ءَاتَيْتُكُم مِّن كِتَـٰبٍۢ وَحِكْمَةٍۢ ثُمَّ جَآءَكُمْ رَسُولٌۭ مُّصَدِّقٌۭ لِّمَا مَعَكُمْ لَتُؤْمِنُنَّ بِهِۦ وَلَتَنصُرُنَّهُۥ ۚ قَالَ ءَأَقْرَرْتُمْ وَأَخَذْتُمْ عَلَىٰ ذَٰلِكُمْ إِصْرِى ۖ قَالُوٓا۟ أَقْرَرْنَا ۚ قَالَ فَٱشْهَدُوا۟ وَأَنَا۠ مَعَكُم مِّنَ ٱلشَّـٰهِدِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t remember\t when\t Allah took\t a\t\ncovenant\tfrom\tthe\tProphets;\t“If\tI\tgive\tyou\t\nthe\t Book\t and\t knowledge\t and\t the\t\n(promised)\t Noble\t Messenger\t (Prophet\t\nMuhammad - peace\tand\tblessings\tbe\tupon\t\nhim)\tcomes\t to\t you,\t confirming\t the\tBooks\t\nyou\t possess,\t you\t shall\t positively,\t\ndefinitely\tbelieve\tin\thim\tand\tyou\tshall\tpositively,\tdefinitely\thelp\thim”;\tHe\tsaid, “Do\tyou\tagree,\t\nand\taccept\tMy\tbinding\tresponsibility\tin\t this\tmatter?”\tThey\tall\tanswered,\t“We\tagree”;\tHe\tsaid,\t\n“Then\tbear\twitness\tamongst\tyourselves,\tand\tI\tMyself\tam\ta\twitness\twith\tyou.”\t",
    "romanUrduTranslationText": ". Aur\t yād\t karo\t jab\t Allah\t ne\t Paighambaroñ\t\nse\t un\t ka\t ‘ahed\t liya\t jo\t maiñ\t tum\t ko\t kitāb\t\naur\t hikmat\t dooñ\t phir\t tashreef\t lāye\t\ntumhāre\t pās\t woh\t Rasool\t ke\t tumhāri\t\nkitāboñ\tki\ttasdeeq\tfarmāye\tto\ttum\tzaroor\t\nzaroor\tus\tpar\tImān\tlāna\taur\tzaroor\tzaroor\t\nus\t ki\tmadad\t karna,\t farmāya:\t kyuñ\t tumne\t\niqrār\tkiya\taur\tus\tpar\tmera\tbhāri\tzimma\tliya?\tSab\tne\tarz\tki\tham\tne\tiqrār\tkiya,\t farmāya:\t to\tek\t\ndoosre\tpar\tgawah\tho\tjāo\taur\tmaiñ\tāap\ttumhāre\tsath\tgawāhoñ\tmeiñ\thooñ"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "81",
    "arabicText": "فَمَن تَوَلَّىٰ بَعْدَ ذَٰلِكَ فَأُو۟لَـٰٓئِكَ هُمُ ٱلْفَـٰسِقُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t remember\t when\t Allah took\t a\t\ncovenant\tfrom\tthe\tProphets;\t“If\tI\tgive\tyou\t\nthe\t Book\t and\t knowledge\t and\t the\t\n(promised)\t Noble\t Messenger\t (Prophet\t\nMuhammad - peace\tand\tblessings\tbe\tupon\t\nhim)\tcomes\t to\t you,\t confirming\t the\tBooks\t\nyou\t possess,\t you\t shall\t positively,\t\ndefinitely\tbelieve\tin\thim\tand\tyou\tshall\tpositively,\tdefinitely\thelp\thim”;\tHe\tsaid, “Do\tyou\tagree,\t\nand\taccept\tMy\tbinding\tresponsibility\tin\t this\tmatter?”\tThey\tall\tanswered,\t“We\tagree”;\tHe\tsaid,\t\n“Then\tbear\twitness\tamongst\tyourselves,\tand\tI\tMyself\tam\ta\twitness\twith\tyou.”\t",
    "romanUrduTranslationText": ". Aur\t yād\t karo\t jab\t Allah\t ne\t Paighambaroñ\t\nse\t un\t ka\t ‘ahed\t liya\t jo\t maiñ\t tum\t ko\t kitāb\t\naur\t hikmat\t dooñ\t phir\t tashreef\t lāye\t\ntumhāre\t pās\t woh\t Rasool\t ke\t tumhāri\t\nkitāboñ\tki\ttasdeeq\tfarmāye\tto\ttum\tzaroor\t\nzaroor\tus\tpar\tImān\tlāna\taur\tzaroor\tzaroor\t\nus\t ki\tmadad\t karna,\t farmāya:\t kyuñ\t tumne\t\niqrār\tkiya\taur\tus\tpar\tmera\tbhāri\tzimma\tliya?\tSab\tne\tarz\tki\tham\tne\tiqrār\tkiya,\t farmāya:\t to\tek\t\ndoosre\tpar\tgawah\tho\tjāo\taur\tmaiñ\tāap\ttumhāre\tsath\tgawāhoñ\tmeiñ\thooñ"
  }
]