[
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "145",
    "arabicText": "وَلَئِنْ أَتَيْتَ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَـٰبَ بِكُلِّ ءَايَةٍۢ مَّا تَبِعُوا۟ قِبْلَتَكَ ۚ وَمَآ أَنتَ بِتَابِعٍۢ قِبْلَتَهُمْ ۚ وَمَا بَعْضُهُم بِتَابِعٍۢ قِبْلَةَ بَعْضٍۢ ۚ وَلَئِنِ ٱتَّبَعْتَ أَهْوَآءَهُم مِّنۢ بَعْدِ مَا جَآءَكَ مِنَ ٱلْعِلْمِ ۙ إِنَّكَ إِذًۭا لَّمِنَ ٱلظَّـٰلِمِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t even\t if\t you\t were\t to\t bring\t all\t the\t signs\t to\t the\t People\t given\t the\t Book(s),\t they\t would\t not\t\nfollow\tyour\tqiblah;\tnor\tshould\tyou\t follow\t their\tqiblah;\tnor\tdo\t they\t follow\teach\tothers\tqiblah;\t\nand\t were\t you\t (the\t followers\t of\t this\t Prophet)\t to\t follow\t their\t desires\t after\t having\t received\t\nknowledge,\tyou\twould\tthen\tsurely\tbe\tunjust.",
    "romanUrduTranslationText": "Aur\tagar\ttum\tun\tkitābiyoñ\tke\tpās\thar\tnishāni\tlekar\tāao\twoh\ttumhāre\tqibla\tki\tpairwi\tna\tkareñge\t\naur\tna\ttum\tunke\tqible\tki\tpairwi\tkaro\taur\twoh\tāpas\tmeiñ\tbhi\tek\tdoosre\tke\tqibla\tke\ttābe'\tnahi\taur\t\n(aey\tsun\tne\twāle\tkase\tbāshad\t)\tagar\t tu\tunki\tkhuwahishoñ\tpar\tchala\tbād\tiske\tke\t tujhe\tilm\tmil\t\nchuka\tto\tus\twaqt\ttu\tzaroor\tsitamghār\t(zālim)\thoga"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "146",
    "arabicText": "ٱلَّذِينَ ءَاتَيْنَـٰهُمُ ٱلْكِتَـٰبَ يَعْرِفُونَهُۥ كَمَا يَعْرِفُونَ أَبْنَآءَهُمْ ۖ وَإِنَّ فَرِيقًۭا مِّنْهُمْ لَيَكْتُمُونَ ٱلْحَقَّ وَهُمْ يَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Those\t to\t whom\t We\t gave\t the\t Book(s)\t\nrecognise\t the\t Prophet\t (Muhammad -\npeace\t and\t blessings\t be\t upon\t him)\t as\tmen\t\n(or\t they)\t recognise\t their\t own\t sons;\t and\t\nundoubtedly\t a\t group\t among\t them\t\npurposely\tconceals\tthe\ttruth.",
    "romanUrduTranslationText": "inheiñ\t hum\t ne\t kitāb\t ‘ata\t farmāyi\t woh\t is\t\nNabi\t ko\t aisa\t pahchānte\t haiñ\t jaise\t ādmi\t\napne\t betoñ\t ko\t pehchānta\t hai\t aur\t beshak\t\nun\t meiñ\t ek\t giroh\t jān\t boojh\t kar\t haq\t\nchupāte\thaiñ\t"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "147",
    "arabicText": "ٱلْحَقُّ مِن رَّبِّكَ ۖ فَلَا تَكُونَنَّ مِنَ ٱلْمُمْتَرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "This\t is\t the\t Truth\t from\t your\t Lord,\t\ntherefore\t(O\tthose\twho\tlisten)\tbeware\t- do\t\nnot\tbe\tin\tdoubt..",
    "romanUrduTranslationText": " (Aey\tsun\tne\twāle)\tyeh\thaq\thai\ttere\trab\tki\t\ntaraf\t se\t (ya\t haq\t wohi\t hai\t jo\t tere\t Rab\t ki\t\ntaraf\tse\tho\t)"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "148",
    "arabicText": "وَلِكُلٍّۢ وِجْهَةٌ هُوَ مُوَلِّيهَا ۖ فَٱسْتَبِقُوا۟ ٱلْخَيْرَٰتِ ۚ أَيْنَ مَا تَكُونُوا۟ يَأْتِ بِكُمُ ٱللَّهُ جَمِيعًا ۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t each\t one\t has\t a\t direction\t towards\t\nwhich\t he\t inclines,\t therefore\t strive\t to\t\nsurpass\t others\t in\t good\t deeds;\t Allah will\t\nbring\tyou\tall\ttogether,\twherever\tyou\tmay\t\nbe;\tindeed\tAllah may\tdo\tas\tHe\twills",
    "romanUrduTranslationText": "To\tkhabar-dār\ttu\tshak\tna\tkarna\tur\thar\tek\t\nke\tliye\ttawajjo\tki\tek\tsamt\thai\tke\twoh\tusi\tki\t\ntaraf\t muñh\t karta\t hai\t to\t yeh\t chāho\t ke\t\nnekiyoñ\t meiñ\t auroñ\t se\t āge\t nikal\t jāyeñ\ntum\tkaheeñ\tho\tAllah\ttum\tsab\tko\tikhat-tha\t\nle\tāye\tga\tbeshak\tAllah\tjo\tchāhe\tkare.\t"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "149",
    "arabicText": "وَمِنْ حَيْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ ٱلْمَسْجِدِ ٱلْحَرَامِ ۖ وَإِنَّهُۥ لَلْحَقُّ مِن رَّبِّكَ ۗ وَمَا ٱللَّهُ بِغَـٰفِلٍ عَمَّا تَعْمَلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". And\t wherever\t you\t come\t from, turn\t your\t\nface\t towards\t the\t Sacred\t Masjid;\t and\t\nindeed\tit\tis\tthe\ttruth\tfrom\tyour\tLord;\tand\t\nAllah is\tnot\tunaware\tof\tyour\tdeeds.\t",
    "romanUrduTranslationText": ". Aur\t jahāñ\t se\t āao\t apna\t muñh\t Masjid-e\u0002Harām ki\t taraf\t karo\t aur\t woh\t zaroor\t\ntumhāre\tRab\tki\t taraf\tse\thaq\thai\taur\tAllah\t\ntumhāre\tkāmoñ\tse\tghāfil\tnahi."
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "150",
    "arabicText": "وَمِنْ حَيْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ ٱلْمَسْجِدِ ٱلْحَرَامِ ۚ وَحَيْثُ مَا كُنتُمْ فَوَلُّوا۟ وُجُوهَكُمْ شَطْرَهُۥ لِئَلَّا يَكُونَ لِلنَّاسِ عَلَيْكُمْ حُجَّةٌ إِلَّا ٱلَّذِينَ ظَلَمُوا۟ مِنْهُمْ فَلَا تَخْشَوْهُمْ وَٱخْشَوْنِى وَلِأُتِمَّ نِعْمَتِى عَلَيْكُمْ وَلَعَلَّكُمْ تَهْتَدُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t O\t dear\t Prophet\t(Muhammad - peace\t\nand\t blessings\t be\tupon\t him)\twherever\t you\t\ncome\t from,\t turn\t your\t face\t towards\t the\t\nSacred\tMasjid;\tand\twherever\tyou\tmay\tbe,\t\nO\t Muslims,\t turn\t your\t faces\t towards\t it\t\nonly,\t so\t that\t people\t may\t not\t have\t an\t\nargument\t against\t you\t - except\t those\t\namong\t them\t who\t do\t injustice;\t therefore\t\ndo\tnot\tfear\tthem,\tand\tfear\tMe;\tand\tthis\tis\t\nin\torder\tthat\tI\tcomplete\tMy\tfavour\tupon\tyou\tand\tthat\tyou\tmay\tattain\tguidance.\t-\t",
    "romanUrduTranslationText": "Aur\taey\tMehboob!\tTum\tjahāñ\tse\tāao\tapna\t\nmuñh\tMasjid-e-Harām\t ki\t taraf\t \t karo.\t Aur\t\naey\t Musalmanoñ!\t Tum\t jahāñ\t kahiñ\t ho\t\napna\tmuñh\tusi\ttaraf\tkaro\tke\tlogoñ\tko\ttum\t\npar\t koi\t hujjat\t na\t rahe\t magar\t jo\t un\t meiñ\t\nna-insāfi\tkareñ\tto\tunse\tna\tdaro\taur\tmujh\tse\tdaro\taur\tyeh\tis\tliye\thai\tke\tmaiñ\tapni\tne'mat\ttum\tpar\t\npoori\tkarooñ\taur\tkisi\ttarah\ttum\thidāyat\tpāo"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "151",
    "arabicText": "كَمَآ أَرْسَلْنَا فِيكُمْ رَسُولًۭا مِّنكُمْ يَتْلُوا۟ عَلَيْكُمْ ءَايَـٰتِنَا وَيُزَكِّيكُمْ وَيُعَلِّمُكُمُ ٱلْكِتَـٰبَ وَٱلْحِكْمَةَ وَيُعَلِّمُكُم مَّا لَمْ تَكُونُوا۟ تَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "The\t way\t We\t have\t sent\t to\t you\t a\t Noble\t Messenger\t from\t among\t you,\t who\t recites\t to\t you\t Our\t\nverses\tand\tpurifies\tyou,\tand\tteaches\tyou\tthe\tBook\tand\tsound\twisdom*,\tand\tteaches\tyou\twhat\t\nyou\t did\t not\t know.\t(The\t traditions\t /\t sayings\t of\t the\tHoly\t Prophet\t- peace\t and\t blessings\t be\t upon\t\nhim).\t\t-\t",
    "romanUrduTranslationText": "Jaise\thum\tne\ttum\tmeiñ\tbheja\tek\tRasool\ttum\tmeiñ\tse\tke\ttum\tpar\thamāri\tāyateiñ\ttilāwat\tfarmāta\t\nhai\t aur\t tumheiñ\t pāk\t karta\t aur\t Kitāb\t aur\t pukhta\t ilm\t sikhāta\t hai\t aur\t tumheiñ\t woh\t ta'leem\t\nfarmāta\thai\tjiska\ttumheiñ\tilm\tna\ttha"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "152",
    "arabicText": "فَٱذْكُرُونِىٓ أَذْكُرْكُمْ وَٱشْكُرُوا۟ لِى وَلَا تَكْفُرُونِ",
    "urduTranslationText": "",
    "englishTranslationText": "Therefore\tremember\tMe,\t I\twill\tcause\tyou\tto\tbe\tspoken\tof\tand\tacknowledge\tMy\trights,\tand\tdo\t\nnot\tbe\tungrateful.",
    "romanUrduTranslationText": "To\tmeri\t yād\t karo\tmaiñ\t tumhāra\t charcha\t karoñga\t aur\tmera\t haq\tmāno\t aur\tmeri\t na-shukri\t na\t\nkar"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "153",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱسْتَعِينُوا۟ بِٱلصَّبْرِ وَٱلصَّلَوٰةِ ۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّـٰبِرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "O\t People\t who\t Believe!\t Seek\t help\t from\t patience\t and\t prayer;\t indeed\t Allah is\t with\t those\t who\t\npatiently\tendure.",
    "romanUrduTranslationText": "Aey\tImān\twālo\tsabr\taur\tNamāz\tse\tmadad\tchāho\tbeshak\tAllah\tsābiroñ\tke\tsāth\thai\t."
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "154",
    "arabicText": "وَلَا تَقُولُوا۟ لِمَن يُقْتَلُ فِى سَبِيلِ ٱللَّهِ أَمْوَٰتٌۢ ۚ بَلْ أَحْيَآءٌۭ وَلَـٰكِن لَّا تَشْعُرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tdo\tnot\tutter\tregarding\tthose\twho\tare\t\nslain\t in\t Allah's\t cause\t as\t “dead”;\t in\t fact\t\nthey\t are\t alive,\t but\t it\t is\t you\t who\t are\t\nunaware.",
    "romanUrduTranslationText": "Aur\t jo\t Khuda\t ki\t rāh\t meiñ\t māre\t jāyeiñ\t\nunheiñ\t murda\t na\t kaho\t balke\t woh\t zinda\t\nhaiñ\thān tumheiñ\tkhabar\tnahi"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "155",
    "arabicText": "وَلَنَبْلُوَنَّكُم بِشَىْءٍۢ مِّنَ ٱلْخَوْفِ وَٱلْجُوعِ وَنَقْصٍۢ مِّنَ ٱلْأَمْوَٰلِ وَٱلْأَنفُسِ وَٱلثَّمَرَٰتِ ۗ وَبَشِّرِ ٱلصَّـٰبِرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t We\t will\t surely\t test\t you\t with\t some\t\nfear\t and\t hunger,\t and\t with\t paucity\t of\t\nwealth\tand\tlives\tand\tcrops;\tand\tgive\tglad\t\ntidings\tto\tthose\twho\tpatiently\tendure.\t",
    "romanUrduTranslationText": "Aur\tzaroor\tham\ttumheiñ\tāzmāyeñge\tkuch\t\ndar\t aur\t bhook\t se\t aur\t kuch\t māloñ\t aur\t\njānoñ\t aur\t phaloñ\t ki\t kami\t se\t aur\t khush\t\nkhabri\tsuna\tun\tsabr\twāloñ\tko"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "156",
    "arabicText": "ٱلَّذِينَ إِذَآ أَصَـٰبَتْهُم مُّصِيبَةٌۭ قَالُوٓا۟ إِنَّا لِلَّهِ وَإِنَّآ إِلَيْهِ رَٰجِعُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Those\t who\t say\t when\t calamity\t befalls\t\nthem,\t “Indeed\t we\t belong\t to\t Allah and\t\nindeed\tit\tis\tto\tHim\twe\tare\tto\treturn.”\t",
    "romanUrduTranslationText": ". Ke\tjab\t un\t par\t koi\tmusibat\t pade\t to\t kaheñ\t\nham\tAllah\t ke\tmāl\t haiñ\taur\t ham\t ko\t usi\t ki\t\ntaraf\tphirna"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "157",
    "arabicText": "أُو۟لَـٰٓئِكَ عَلَيْهِمْ صَلَوَٰتٌۭ مِّن رَّبِّهِمْ وَرَحْمَةٌۭ ۖ وَأُو۟لَـٰٓئِكَ هُمُ ٱلْمُهْتَدُونَ ",
    "urduTranslationText": "",
    "englishTranslationText": "These\tare\t the\tpeople\tupon\twhom\tare\t the\t\nblessings\tfrom\ttheir\tLord,\tand\tmercy;\tand\t\nit\tis\tthey\twho\tare\ton\tguidance.\t\t",
    "romanUrduTranslationText": "Yeh\t log\t haiñ\t jin\t par\t unke\t Rab\t ki\t\nDuroodeiñ\t haiñ\t aur\t rahmat\t yahi\t log\t rāh\t\npar\thaiñ.\t"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "158",
    "arabicText": " إِنَّ ٱلصَّفَا وَٱلْمَرْوَةَ مِن شَعَآئِرِ ٱللَّهِ ۖ فَمَنْ حَجَّ ٱلْبَيْتَ أَوِ ٱعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَن يَطَّوَّفَ بِهِمَا ۚ وَمَن تَطَوَّعَ خَيْرًۭا فَإِنَّ ٱللَّهَ شَاكِرٌ عَلِيمٌ",
    "urduTranslationText": "",
    "englishTranslationText": "Undoubtedly\t Safa\t and\t Marwah\t *\t are\t\namong\tthe\tsymbols\tof\tAllah;\tso\tthere\tis\tno\t\nsin\ton\thim,\tfor\twhoever\tperforms\tthe\tHajj\t\n(pilgrimage)\tof\tthis\tHouse\t(of\tAllah)\tor\tthe\t\nUmrah\t(lesser\tpilgrimage),\tto\tgo\tback\tand\t\nforth\t between\t them;\t and\t whoever\t does\t\ngood\tof\this\town\taccord,\t then\t(know\t that)\t\nindeed\t Allah is\t Most\t Appreciative\t\n(rewards\t virtue),\tthe\t All\t Knowing.\t(These\t\nare\t2\thillocks\tnear\tthe\tHoly\tKa’aba)",
    "romanUrduTranslationText": "Beshak\t Safā\t aur Marwah Allah\t ki\t\nnishānoñ\t se\t haiñ\t to\t jo\t is ghar\t ka\t haj\t ya\t\nUmrah\tkare\tus\tpar\tkuch\tgunāh\tnahi\tke\tin\t\ndonoñ\t ke\t phere\t kare\t aur\tjo\t koi\t bhali\t bāt\t\napni\t taraf\t se\t kare\t to\t Allah\t neki\t ka\t sila\t\ndene\twāla\tkhabar-dār\thai\t."
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "159",
    "arabicText": " إِنَّ ٱلَّذِينَ يَكْتُمُونَ مَآ أَنزَلْنَا مِنَ ٱلْبَيِّنَـٰتِ وَٱلْهُدَىٰ مِنۢ بَعْدِ مَا بَيَّنَّـٰهُ لِلنَّاسِ فِى ٱلْكِتَـٰبِ ۙ أُو۟لَـٰٓئِكَ يَلْعَنُهُمُ ٱللَّهُ وَيَلْعَنُهُمُ ٱللَّـٰعِنُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Indeed\t those\t who\t hide\t the\t clear\t proofs\t\nand\t the\t guidance\t which\t We\t sent\t down,\t\nafter\tWe\tmade\tit\tclear\t to\tmankind\tin\t the\t\nBook\t- upon\tthem\tis\tthe\tcurse\tof\tAllah and\t\nthe\tcurse\tof\tthose\twho\tcurse",
    "romanUrduTranslationText": "Beshak\twoh\tjo\thamāri\tutāri\thuwi\traushan\t\nbātoñ\t aur\t hidāyat\t ko\t chupāte\t haiñ\t b'ād\t\niske\tke\tlogoñ\tke\tliye\tham\tusey\tkitāb\tmeiñ\t\nwāzeh\t farma\tchuke\tun\tpar\tAllah\tki\tla'nat\t\nhai\taur\tla'nat\tkarne\twāloñ\tki\tla'nat"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "160",
    "arabicText": "إِلَّا ٱلَّذِينَ تَابُوا۟ وَأَصْلَحُوا۟ وَبَيَّنُوا۟ فَأُو۟لَـٰٓئِكَ أَتُوبُ عَلَيْهِمْ ۚ وَأَنَا ٱلتَّوَّابُ ٱلرَّحِيمُ",
    "urduTranslationText": "",
    "englishTranslationText": "Except\t those\t who\t repent\t and\t do\t reform\t and\t disclose\t (the\t truth)\t - so\t I\t will\t accept\t their\t\nrepentance;\tand\tI\tonly\tam\tthe\tMost\tAcceptor\tof\tRepentance,\tthe\tMost\tMerciful",
    "romanUrduTranslationText": "Magar\twoh\tjo\ttauba\tkareiñ\taur\tsawāreiñ (Islāh\tkareñ) aur\tzāhir\tkardeiñ\tto\tmaiñ\thi\thooñ\tbada\t\ntauba\tqabool\tfarmāne\twāla\tmaherbān"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "161",
    "arabicText": "إِنَّ ٱلَّذِينَ كَفَرُوا۟ وَمَاتُوا۟ وَهُمْ كُفَّارٌ أُو۟لَـٰٓئِكَ عَلَيْهِمْ لَعْنَةُ ٱللَّهِ وَٱلْمَلَـٰٓئِكَةِ وَٱلنَّاسِ أَجْمَعِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Indeed\t upon\t those\twho\t disbelieved,\tand\t died\tas\t disbelievers,\tis\t the\t curse\t of\tAllah and\t of\t the\t\nangels\tand\tof\tmen\tcombined.",
    "romanUrduTranslationText": "Beshak\twoh\tjinhoñ\tne\tkufr\tkiya\taur\tkāfir\thi\tmare\tun\tpar\tla'nat\thai\tAllah\taur\tuske\tFarishtoñ\taur\t\nādmiyoñ\tsab\tki"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "162",
    "arabicText": "خَـٰلِدِينَ فِيهَا ۖ لَا يُخَفَّفُ عَنْهُمُ ٱلْعَذَابُ وَلَا هُمْ يُنظَرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "They\twill\tremain\tin\tit\tforever;\tneither\twill\tthe\tpunishment\tbe\tlightened\tfor\tthem,\tnor\twill\tthey\t\nbe\tgiven\trespite.\t",
    "romanUrduTranslationText": "Hamesha\traheñ\tge\tus\tmeiñ\tna\tun\tpar\tse\tazāb\thalka\tho\taur\tna\tunheiñ\tmohlat\tdi\tjāye\t"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "163",
    "arabicText": "وَإِلَـٰهُكُمْ إِلَـٰهٌۭ وَٰحِدٌۭ ۖ لَّآ إِلَـٰهَ إِلَّا هُوَ ٱلرَّحْمَـٰنُ ٱلرَّحِيمُ",
    "urduTranslationText": "",
    "englishTranslationText": "Your\tGod\tis\tOne\tGod;\tthere\tis\tno\tGod\texcept\tHim\t- the\tMost\tGracious,\tthe\tMost\tMerciful.\t",
    "romanUrduTranslationText": "Aur\ttumhāra\tMa'bood\tek\tMa'bood\thai\tuske\tsiwa\tkoi\tMa'bood\tnahi\tmagar\twohi\tbadi\trahmat\twāla\t\nmaherbān"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "164",
    "arabicText": "إِنَّ فِى خَلْقِ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ وَٱخْتِلَـٰفِ ٱلَّيْلِ وَٱلنَّهَارِ وَٱلْفُلْكِ ٱلَّتِى تَجْرِى فِى ٱلْبَحْرِ بِمَا يَنفَعُ ٱلنَّاسَ وَمَآ أَنزَلَ ٱللَّهُ مِنَ ٱلسَّمَآءِ مِن مَّآءٍۢ فَأَحْيَا بِهِ ٱلْأَرْضَ بَعْدَ مَوْتِهَا وَبَثَّ فِيهَا مِن كُلِّ دَآبَّةٍۢ وَتَصْرِيفِ ٱلرِّيَـٰحِ وَٱلسَّحَابِ ٱلْمُسَخَّرِ بَيْنَ ٱلسَّمَآءِ وَٱلْأَرْضِ لَـَٔايَـٰتٍۢ لِّقَوْمٍۢ يَعْقِلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Indeed\tin\tthe\tcreation\tof\tthe\theavens\tand\t\nthe\t earth,\t and\t in\t the\t continuous\t\nalternation\tof\tnight\tand\tday,\tand\tthe\tships\t\nwhich\tsail\tthe\tseas\tcarrying\twhat\tis\tof\tuse\t\nto\tmen,\tand\t the\twater\twhich\tAllah sends\t\ndown\t from\t the\t sky\t thereby\t reviving\t the\t\ndead\t earth\t and dispersing\t all\t kinds\t of\t\nbeasts\t in\t it,\t and\t the\t movement\t of\t the\t\nwinds,\t and\t the\t obedient\t clouds\t between\t\nheaven\t and\t earth\t - certainly\t in\t all\t these\t\nare\tsigns\tfor\tthe\tintelligent.\t",
    "romanUrduTranslationText": "Beshak\t āsmānoñ\t aur\t zameen\t ki\t paidāish\t\naur\trāt\to\tdin\tka\tbadalte\tāana\taur\tkashti\tke\t\ndarya\t meiñ\t logoñ\t ke\t fāyede\t lekar\t chalti\t\nhai\t aur\t woh jo\t Allah\t ne\t āsmān\t se\t pāni\t\nutār\tkar\tmurda\tzameen\tko\tus\tse\tjila\tdiya\t\naur\t zameen\t meiñ\t har\t qism\t ke\t Jānwar\t\nphailāye\t aur\t hawaoñ\t ki\t gardish\t aur\t woh\t\nbādal\tke\tāasmān-o-zameen\tke\tbeech\tmeiñ\t\nhukm\t ka\t bāñdha\t hai\t in\t sab\t meiñ\t aql\u0002mandoñ\tke\tliye\tzaroor\tnishāniyāñ\thaiñ"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "165",
    "arabicText": "وَمِنَ ٱلنَّاسِ مَن يَتَّخِذُ مِن دُونِ ٱللَّهِ أَندَادًۭا يُحِبُّونَهُمْ كَحُبِّ ٱللَّهِ ۖ وَٱلَّذِينَ ءَامَنُوٓا۟ أَشَدُّ حُبًّۭا لِّلَّهِ ۗ وَلَوْ يَرَى ٱلَّذِينَ ظَلَمُوٓا۟ إِذْ يَرَوْنَ ٱلْعَذَابَ أَنَّ ٱلْقُوَّةَ لِلَّهِ جَمِيعًۭا وَأَنَّ ٱللَّهَ شَدِيدُ ٱلْعَذَابِ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t some\t people\t create\t for\t themselves\t\nGods\t(objects\tof\tworship)\tother\tthan\tAllah,\t\nwith\tdevotion\t(love)\tequal\tto\tthe\tdevotion\t\nof\t Allah;\t and\t the\t believers\t do\t not\t love\t\nanybody\t with\t love\t equal\t to\t the\t love\t of\t\nAllah;\t and\twhat\twill\t be\t their\t state,\twhen\t\nthe\tpunishment\twill\tbe\tbefore\tthe\teyes\tof\t\nthe\t unjust\t (disbelievers)?\t For\t all\t power\t\nbelongs wholly\t to\t Allah,\t and\t because\t\nAllah’s\tpunishment\tis\tvery\tsevere\t",
    "romanUrduTranslationText": "Aur\t kuch\t log\t Allah\t ke\t siwa\t aur\t ma'bood\t\nbana\t lete\t haiñ\t ke\t unheiñ\t Allah\t ki\t tarah\t\nmehboob rakhte\thaiñ\taur\t Imān\twāloñ\t ko\t\nAllah\t ke\t barābar\t kisi\t ki\t mohabbat\t nahi\t\naur\tkaisi\tho\tagar\tdekheiñ\tzālim\twoh\twaqt\t\njab\tki\t'azāb\tunki\tānkhoñ\tke\tsāmne\tāye\tga\t\nis\tliye\tke\tsāra\tzor Khuda\tko\thai\taur\tis\tliye\t\nke\tAllah\tka\tazāb\tbahut\tsakht\thai"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "166",
    "arabicText": "إِذْ تَبَرَّأَ ٱلَّذِينَ ٱتُّبِعُوا۟ مِنَ ٱلَّذِينَ ٱتَّبَعُوا۟ وَرَأَوُا۟ ٱلْعَذَابَ وَتَقَطَّعَتْ بِهِمُ ٱلْأَسْبَابُ",
    "urduTranslationText": "",
    "englishTranslationText": "(The\t day)\t when\t the\t leaders\t will\t be\t\ndisgusted\twith\t their\t followers\t- and\t they\t\nshall\t see\t their\t punishment,\t and\t all\t their\t\nlinks\twill\tbe\tcut\toff.\t\t",
    "romanUrduTranslationText": "Jab\tbezār\thoñge\tpeshwa\tapne\tpairwoñ\tse\t\naur\tdekheñge\tazāb\taur\tkat\tjāyeñgi\tun\tsab\t\nki\tdoreiñ.\t"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "167",
    "arabicText": "وَقَالَ ٱلَّذِينَ ٱتَّبَعُوا۟ لَوْ أَنَّ لَنَا كَرَّةًۭ فَنَتَبَرَّأَ مِنْهُمْ كَمَا تَبَرَّءُوا۟ مِنَّا ۗ كَذَٰلِكَ يُرِيهِمُ ٱللَّهُ أَعْمَـٰلَهُمْ حَسَرَٰتٍ عَلَيْهِمْ ۖ وَمَا هُم بِخَـٰرِجِينَ مِنَ ٱلنَّارِ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tthe\t followers\twill\tsay,\t“If\twe\twere\tto\t\nreturn\t(to\tearth),\twe\twould\tbreak\toff\tfrom\t\nthem\tlike\t they\t have\t broken\t off\t from\t us”;\t\nthis\t is\t how\t Allah will\t show\t them\t their\t\ndeeds\tas\tdespair\tfor\tthem;\tand\tthey\twill\tnever\tcome\tout\tfrom\tthe\tfire\t(hell).\t",
    "romanUrduTranslationText": "Aur\tkaheñge\tpairao\tkāsh\thameiñ\tlaut\tkar\t\njāna\thota\t (duniya\tmeiñ)\t to\tham\tunse\t tod\t\n(Juda\tho\tjāte)\tdete\tjaise\tunhoñ\tne\tham\tse\t\ntod\t di\t yooñ\t hi\t Allah\t unheiñ\t dikhāye\t ga\t\nunke\tkām\tun\tpar\thasrateiñ\thokar\taur\twoh\tdozakh\tse\tnikalne\twāle\tnahi"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "168",
    "arabicText": "يَـٰٓأَيُّهَا ٱلنَّاسُ كُلُوا۟ مِمَّا فِى ٱلْأَرْضِ حَلَـٰلًۭا طَيِّبًۭا وَلَا تَتَّبِعُوا۟ خُطُوَٰتِ ٱلشَّيْطَـٰنِ ۚ إِنَّهُۥ لَكُمْ عَدُوٌّۭ مُّبِينٌ",
    "urduTranslationText": "",
    "englishTranslationText": "O\tmankind!\tEat\t from\twhat\tis\tlawful\tand\tclean\tin\t the\tearth; and\tdo\tnot\t follow\t the\t footsteps\tof\t\nthe\tdevil;\tundoubtedly\the\tis\tyour\topen\tenemy.\t\t",
    "romanUrduTranslationText": "Aey\tlogoñ! Khao\tjo\t kuch\tzameen\tmeiñ\t halāl\t pākizah\t hai\taur\t shaitān\t ke\t qadam\t par\t qadam\t na\t\nrakho\tbeshak\twoh\ttumhāra\tkhula\tdushman\thai"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "169",
    "arabicText": "إِنَّمَا يَأْمُرُكُم بِٱلسُّوٓءِ وَٱلْفَحْشَآءِ وَأَن تَقُولُوا۟ عَلَى ٱللَّهِ مَا لَا تَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "For\the\twill\tonly\tinstruct\tyou\ttowards\tthe\tevil\tand\tthe\tshameful,\tand\tthat\tyou\tfabricate\tmatters\t\nconcerning\tAllah,\twhat\tyou\tdo\tnot\tknow.\t",
    "romanUrduTranslationText": "Woh\tto\ttumheiñ\tyahi\thukm\tdega\tbadi\taur\tbe-hayāi\tka\taur\tyeh\tke\tAllah\tpar\twoh\tbāt\tjodo\tjiski\t\ntumheiñ\tkhabar\tnahi"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "170",
    "arabicText": "وَإِذَا قِيلَ لَهُمُ ٱتَّبِعُوا۟ مَآ أَنزَلَ ٱللَّهُ قَالُوا۟ بَلْ نَتَّبِعُ مَآ أَلْفَيْنَا عَلَيْهِ ءَابَآءَنَآ ۗ أَوَلَوْ كَانَ ءَابَآؤُهُمْ لَا يَعْقِلُونَ شَيْـًۭٔا وَلَا يَهْتَدُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\twhen\tit\tis\tsaid\tto\tthem,\t“Follow\twhat\t\nAllah has\t sent\t down”,\t they\t say,\t “On\t the\t\ncontrary,\t we\t shall\t follow\t what\t we\t found\t\nour\tforefathers\tupon”;\tWhat!\tEven\tif\ttheir\t\nforefathers\t had\t no\t intelligence,\t or\t\nguidance?!\t",
    "romanUrduTranslationText": "Aur\tjab\tunse\tkaha\tjāye\tAllah\tke\tutāre\tpar\t\nchalo\t to\t kaheñ\t balke\t ham\t to\t us\t par\t\nchaleñge\t jis\t par\t apne\t bāp\t dāda\t ko\t pāya,\nkya\t agarche\t unke\t bāp\t dāda\t na\t kuchh\t aql\t\nrakhte\thoñ\tna\thidāyat"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "171",
    "arabicText": "وَمَثَلُ ٱلَّذِينَ كَفَرُوا۟ كَمَثَلِ ٱلَّذِى يَنْعِقُ بِمَا لَا يَسْمَعُ إِلَّا دُعَآءًۭ وَنِدَآءًۭ ۚ صُمٌّۢ بُكْمٌ عُمْىٌۭ فَهُمْ لَا يَعْقِلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t the\t example\t of\t the\t disbelievers\t is\t\nsimilar\t to\t one\t who\t calls\t upon\t one\t that\t\nhears\t nothing\t except\t screaming\t and\t\nyelling;\tdeaf,\tdumb,\tblind\t- so\tthey\tdo\tnot\t\nhave\tsense",
    "romanUrduTranslationText": "Aur\t kāfiroñ\t ki\t kahāwat\t us\t ki\t si\t hai\t jo\t\npukāre\t aise\t ko\t ke\t khāli\t cheekh\t pukār\t ke\t\nsiwa\tkuch\tna\tsune\tbehre\tgooñge\tandhe, to\t\nunheiñ\tsamjh\tnahi\t"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "172",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ كُلُوا۟ مِن طَيِّبَـٰتِ مَا رَزَقْنَـٰكُمْ وَٱشْكُرُوا۟ لِلَّهِ إِن كُنتُمْ إِيَّاهُ تَعْبُدُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "O\t People\t who\t Believe!\t Eat\t of\t the\t good\t\nthings\t We\t have\t provided\t you,\t and\t be\t\ngrateful\t to\t Allah if\t it\t is\t only\t Him\t you\t\nworship.",
    "romanUrduTranslationText": "Aey\t Imān\t wālo\t khao\t hamāri\t di\t huwi\t\nsuthri\t cheezeñ\t Aur\t Allah\t ka\t ehsān\t māno\t\nagar\ttum\tusi\tko\tpoojte\tho\t"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "173",
    "arabicText": "إِنَّمَا حَرَّمَ عَلَيْكُمُ ٱلْمَيْتَةَ وَٱلدَّمَ وَلَحْمَ ٱلْخِنزِيرِ وَمَآ أُهِلَّ بِهِۦ لِغَيْرِ ٱللَّهِ ۖ فَمَنِ ٱضْطُرَّ غَيْرَ بَاغٍۢ وَلَا عَادٍۢ فَلَآ إِثْمَ عَلَيْهِ ۚ إِنَّ ٱللَّهَ غَفُورٌۭ رَّحِيمٌ",
    "urduTranslationText": "",
    "englishTranslationText": "He\thas\tforbidden\tfor\tyou\tonly\tthe\tcarrion,\t\nand\t blood,\t and\t flesh\t of\t swine,\t and\t the\t\nanimal\t that\t has\t been\t slaughtered\t while\t\nproclaiming\t the\t name\t of\t anyone\t other\t\nthan\tAllah;\tso\tthere\tis\tno\tsin\ton\thim\twho\t\nis\t compelled\t and\t does\t not\t eat\t out\t of\t\ndesire,\t nor\t eats\t more\t than\t what\t is\t\nnecessary;\t indeed\t Allah is\t Oft\t Forgiving,\t\nMost\tMerciful.",
    "romanUrduTranslationText": ". Usne\t yahi\t tum\t par\t harām\t kiye\t haiñ\t\nmurdār\taur\tkhoon\taur\tsuwar\tka\tgosht\taur\t\nwoh\t jānwar\t jo\t ghair-e-khuda\t ka\t name\t\nlekar\t zibah\t kiya\t gaya\t to\tjo\t na-chār\t ho\t ya\t\nyuñ\t ke\t khuwahish\t se\t khāye\t aur\t na\t yooñ\t\nke\tzaroorat\tse\tāge\tbadhe\tto\tus\tpar\tgunah\t\nnahi\t beshak\t Allah\t bakhsh\t ne\t wāla\t\nmaherbān\thai.\t"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "174",
    "arabicText": "إِنَّ ٱلَّذِينَ يَكْتُمُونَ مَآ أَنزَلَ ٱللَّهُ مِنَ ٱلْكِتَـٰبِ وَيَشْتَرُونَ بِهِۦ ثَمَنًۭا قَلِيلًا ۙ أُو۟لَـٰٓئِكَ مَا يَأْكُلُونَ فِى بُطُونِهِمْ إِلَّا ٱلنَّارَ وَلَا يُكَلِّمُهُمُ ٱللَّهُ يَوْمَ ٱلْقِيَـٰمَةِ وَلَا يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ",
    "urduTranslationText": "",
    "englishTranslationText": "Those\t who\t hide\t the\t Book\t sent\t down\t by\t\nAllah and\texchange\tit\tfor\tan\tabject\tprice\t-\nthey\t only\t fill\t their\t bellies\t with\t fire\t and\t\nAllah will\tnot\tspeak\tto\tthem\ton\tthe\tDay\tof\t\nResurrection\tnor\twill\tHe\tpurify\tthem;\tand\tfor\tthem\tis\ta\tpainful\tpunishment",
    "romanUrduTranslationText": "Woh\t jo\t chupāte\t haiñ\t Allah\t ki\t utāri\t kitāb\t\naur\t uske\t badle\t zaleel\t qeemat\tle\tlete\t haiñ\t\nwoh\tapne\tpet\tmeiñ\tāag\thi\tbharte\thaiñ\taur\t\nAllah\tQayāmat\tke\tdin\tunse\tbāt\tna\tkarega\taur\tna\tunheiñ\tsuthra\tkare\taur\tunke\tliye\tdard-nāk\tazāb\t\nhai\t"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "175",
    "arabicText": "أُو۟لَـٰٓئِكَ ٱلَّذِينَ ٱشْتَرَوُا۟ ٱلضَّلَـٰلَةَ بِٱلْهُدَىٰ وَٱلْعَذَابَ بِٱلْمَغْفِرَةِ ۚ فَمَآ أَصْبَرَهُمْ عَلَى ٱلنَّارِ",
    "urduTranslationText": "",
    "englishTranslationText": "They\tare\tthe\tpeople\twho\tpurchased\terror\tin\texchange\tof\tguidance,\tand\ttorment\tin\texchange\tof\t\npardon;\tso\thow\tmuch\tcan\tthey\tbear\tthe\tfire?\t",
    "romanUrduTranslationText": ". Woh\tlog\t haiñ\tjinhoñ\t ne\t hidāyat\t ke\t badle\t gumrahi\tmol\tli\tAur\t bakhshish\t ke\t badle\t ‘azāb\t to\t kis\t\ndarja\tunheiñ\tāag\tki\tsahār (bardāsht) hai\t"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "176",
    "arabicText": "ذَٰلِكَ بِأَنَّ ٱللَّهَ نَزَّلَ ٱلْكِتَـٰبَ بِٱلْحَقِّ ۗ وَإِنَّ ٱلَّذِينَ ٱخْتَلَفُوا۟ فِى ٱلْكِتَـٰبِ لَفِى شِقَاقٍۭ بَعِيدٍۢ",
    "urduTranslationText": "",
    "englishTranslationText": "This\t is\t because\tAllah has\t sent\t down\t the\t Book\t with\t the\t truth;\t and\t indeed\t those\t who\t caused\t\ndisagreement\tin\tthe\tBook\tare,\tsurely,\tdisputants\tin\tthe\textreme.\t",
    "romanUrduTranslationText": "Yeh\tis\tliye\tke\tAllah\tne\tkitāb\thaq\tke\tsāth\tutāri\taur\tbeshak\tjo\tlog\tkitāb\tmeiñ\tikhtilāf\tdālne\tlage\t\nwoh\tzaroor\tparle\tsire\tke\tjhagdālu\thaiñ\t"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "177",
    "arabicText": "۞ لَّيْسَ ٱلْبِرَّ أَن تُوَلُّوا۟ وُجُوهَكُمْ قِبَلَ ٱلْمَشْرِقِ وَٱلْمَغْرِبِ وَلَـٰكِنَّ ٱلْبِرَّ مَنْ ءَامَنَ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ وَٱلْمَلَـٰٓئِكَةِ وَٱلْكِتَـٰبِ وَٱلنَّبِيِّـۧنَ وَءَاتَى ٱلْمَالَ عَلَىٰ حُبِّهِۦ ذَوِى ٱلْقُرْبَىٰ وَٱلْيَتَـٰمَىٰ وَٱلْمَسَـٰكِينَ وَٱبْنَ ٱلسَّبِيلِ وَٱلسَّآئِلِينَ وَفِى ٱلرِّقَابِ وَأَقَامَ ٱلصَّلَوٰةَ وَءَاتَى ٱلزَّكَوٰةَ وَٱلْمُوفُونَ بِعَهْدِهِمْ إِذَا عَـٰهَدُوا۟ ۖ وَٱلصَّـٰبِرِينَ فِى ٱلْبَأْسَآءِ وَٱلضَّرَّآءِ وَحِينَ ٱلْبَأْسِ ۗ أُو۟لَـٰٓئِكَ ٱلَّذِينَ صَدَقُوا۟ ۖ وَأُو۟لَـٰٓئِكَ هُمُ ٱلْمُتَّقُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Basic\tvirtue\tis\tnot\tjust\tto\tturn\tfaces\tto\tthe\t\nEast\tand\tthe\tWest,\tbut\ttrue\trighteousness\t\nis\t that\t one\tmust\t believe\tin\tAllah and\t the\t\nLast\tDay\tand\tthe\tangels\tand\tthe\tBook\tand\t\nthe\tProphets;\tand\tout\tof\tlove\tfor\tAllah,\tto\t\ngive\t treasured\t wealth\t to\t relatives\t and\t to\nthe\t orphans\t and\t the\t needy\t and\t the\t\ntraveller,\tand\tto\tthose\twho\task,\tand\tto\tset\t\nslaves\t free;\t and\t to\t keep\t the\t prayer\t\nestablished\t and\t to\t pay\t the\t charity;\t and\t\nthose\t who\t fulfil\t their\t obligations\t when\t\nthey\tmake\tan\tagreement;\tand\t the\tpatient\t\nduring\ttimes\tof\tcalamity,\tin\thardships\tand\t\nduring\t holy\t war;\t it\t is\t they\t who\t have\t\nproved\t true\t to\t their\tword;\tit\tis\t they\twho\t\nare\tthe\tpious.\t",
    "romanUrduTranslationText": ". Kuch\tasl\tneki\tyeh\tnahi\tke\tmooñh\tmashriq\t\nya\tmaghrib\tki\t taraf\tkaro\thāñ\tasl\tneki\tyeh\t\nke\t Imān\t lāye\t Allah\t aur\t Qayāmat\t aur\t\nFirishtoñ\taur\tKitāb\taur\tPaighambaroñ\tpar\t\naur\t Allah\t ki\t mohabbat\t meiñ\t apna\t azeez\t\nmāl\t de\t risht-e-dāroñ\t aur\t yateemoñ\t aur\t\nmiskeenoñ\taur\trāh-geer\taur\tsāiloñ\tko\taur\t\ngardaneñ\tchhudāne\tmeiñ\taur\tnamāz\tqāim\t\nrakhe\t aur\t zakāt\t de\t aur\t apna\t qaul\t poora\t\nkarne\twāle\tjab\tahed\tkareiñ\taur\tsabr\twāle\t\nmusibat\t aur\t sakhti\t meiñ\t aur\t jihād\t ke\t\nwaqt,\tyehi\thaiñ\tjinhoñ\tne\tapni\tbāt\tsachhi\t\nki\taur\tyehi\tparhez-gār\thaiñ.\t"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "178",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ كُتِبَ عَلَيْكُمُ ٱلْقِصَاصُ فِى ٱلْقَتْلَى ۖ ٱلْحُرُّ بِٱلْحُرِّ وَٱلْعَبْدُ بِٱلْعَبْدِ وَٱلْأُنثَىٰ بِٱلْأُنثَىٰ ۚ فَمَنْ عُفِىَ لَهُۥ مِنْ أَخِيهِ شَىْءٌۭ فَٱتِّبَاعٌۢ بِٱلْمَعْرُوفِ وَأَدَآءٌ إِلَيْهِ بِإِحْسَـٰنٍۢ ۗ ذَٰلِكَ تَخْفِيفٌۭ مِّن رَّبِّكُمْ وَرَحْمَةٌۭ ۗ فَمَنِ ٱعْتَدَىٰ بَعْدَ ذَٰلِكَ فَلَهُۥ عَذَابٌ أَلِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "O\t People\t who\t Believe!\t Retribution\t is\t\nmade\t obligatory\t for\t you\tin\t the\tmatter\t of\t\nthose\t killed\t unjustly;\t a\t freeman\t for\t a\t\nfreeman,\t and\t a\t slave\t for\t a\t slave,\t and\t a\t\nfemale\t for\t a\t female;\t and\t for\t him\t who\t is\t\npartly\t forgiven\t by\t his\t brother,\t seek\t\ncompensation\t with\t courtesy\t and\t make\t\npayment\tin\tproper\tmanner;\tthis\tis\ta\trelief\t\nand\ta\tmercy\tupon\tyou,\tfrom\tyour\tLord;\tso\t\nafter\t this,\t a\t painful\t punishment\t is\t for\t\nwhoever\texceeds\tthe\tlimits",
    "romanUrduTranslationText": "Aey\tImān\twālo!\tTum\tpar\tfarz\thai\tke\tjo\tna\u0002haq\t māre\t jāyeñ\t unke\t khoon\t ka\t badla\t lo\t\nazād\t ke\t badle\t azād\t aur\t ghulām\t ke\t badle\t\nghulām\t aur\t aurat\t ke\t badle\t aurat\t to\t jiske\t\nliye\t uske\t bhai\t ki\t taraf\t se\t kuchh\t mu'āfi\t\nhuwi\t to\t bhalāi\t se\t taqāza\t ho\t aur\t achhi\t\ntarah\t ada\t yeh\t tumhāre\t rab\t ki\t taraf\t se\t\ntumhāra\tbojh\thalka\tkarna\thai\taur\ttum\tpar\t\nrahmat\tto\tuske\tb’ad\tjo\tziyadati\tkare\tuske\t\nliye\tdard-nāk\tazāb\thai.\t"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "179",
    "arabicText": "وَلَكُمْ فِى ٱلْقِصَاصِ حَيَوٰةٌۭ يَـٰٓأُو۟لِى ٱلْأَلْبَـٰبِ لَعَلَّكُمْ تَتَّقُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t there\tis\tlife\t for\t you\tin\t retribution,\tO\t\nmen\t of\t understanding,\t so\t that\t you\t may\t\navoid.",
    "romanUrduTranslationText": "Aur\t khoon\t ka\t badla\t lene\t meiñ\t tumhāri\t\nzindagi\t hai\t aey\t aql-mandoñ\t ke\t tum\t\nkaheeñ\tbachho"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "180",
    "arabicText": "كُتِبَ عَلَيْكُمْ إِذَا حَضَرَ أَحَدَكُمُ ٱلْمَوْتُ إِن تَرَكَ خَيْرًا ٱلْوَصِيَّةُ لِلْوَٰلِدَيْنِ وَٱلْأَقْرَبِينَ بِٱلْمَعْرُوفِ ۖ حَقًّا عَلَى ٱلْمُتَّقِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "It\tis\tordained\tfor\tyou\tthat\twhen\tdeath\tapproaches\tone\tof\tyou,\tand\the\tleaves\tbehind\twealth,\the\t\nmust\tbequeath\tit\tto\tparents\tand\tnear\trelatives\tin\taccordance\twith\ttradition;\tthis\tis\ta\tduty\tupon\t\nthe\tpious.\t",
    "romanUrduTranslationText": "Tum\tpar\tfarz\thuwa\tke\tjab\ttum\tmeiñ\tkisi\tko\tmaut\tāaye\tagar\tkuch\tmāl\tchhode\tto\twasiyat\tkar jāye\t\napne\t māñ\t bāp\t aur\t qareeb\t ke\t risht-e-dāroñ\t ke\t liye\t mawafiq-e-dastoor\t yeh\t wājib\t hai\t parhez\u0002gāroñ\tpar"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "181",
    "arabicText": "فَمَنۢ بَدَّلَهُۥ بَعْدَ مَا سَمِعَهُۥ فَإِنَّمَآ إِثْمُهُۥ عَلَى ٱلَّذِينَ يُبَدِّلُونَهُۥٓ ۚ إِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "So\twhoever\t changes\t the\twill\tafter\t he\t has\t heard\tit\t- its\t sin\tis\t only\t upon\t those\twho\t change\tit;\t\nindeed\tAllah is\tthe\tAll\tHearing,\tthe\tAll\tKnowing\t",
    "romanUrduTranslationText": "To\tjo\twasiyat\tko\tsun\tsuna\tkar\tbadal\tde\tiska\tgunāh\tunheiñ\tbadalne\twāloñ\tpar\thai\tbeshak\tAllah\t\nsunta\tjānta\thai"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "182",
    "arabicText": "فَمَنْ خَافَ مِن مُّوصٍۢ جَنَفًا أَوْ إِثْمًۭا فَأَصْلَحَ بَيْنَهُمْ فَلَآ إِثْمَ عَلَيْهِ ۚ إِنَّ ٱللَّهَ غَفُورٌۭ رَّحِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "Then\tif\tone\t fears\tthat\tthe\twill\tmaker\t(the\t\ndeceased)\thas\tdone\tinjustice\tor\tsin,\tand\the\t\nmakes\t a\t reconciliation\t between\t the\t\nparties,\t there\t shall\t be\t no\t sin\t upon\t him;\t\nindeed\t Allah is\t Oft\t Forgiving,\t Most\t\nMerciful.\t",
    "romanUrduTranslationText": ". Phir\tjise\tandesha\t huwa\t ke\twasiyat\t karne\t\nwāle\t ne\t kuchh\t be-insāfi\t ya\tgunah\t kiya\t to\t\nusne\t un\t meiñ\t sulah\t kardi\t us\t par\t kuchh\t\ngunah\t nahi\t beshak\t Allah\t bakhsh\t ne\t wāla\t\nmaherbān\thai"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "183",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ كُتِبَ عَلَيْكُمُ ٱلصِّيَامُ كَمَا كُتِبَ عَلَى ٱلَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". O\t People\t who\t Believe!\t Fasting\t is\t made\t\ncompulsory\t for\t you,\t like\t it\t was\t ordained\t\nfor\t those\t before\t you,\t so\t that\t you\t may\t\nattain\tpiety.",
    "romanUrduTranslationText": "Aey\t Imān\t wālo\t tum\t par\t roze\t farz\t kiye\t\ngaye\t jaise\t agloñ\t par\t farz\t kiye\t farz\t huwe\t\nthey\tke\tkaheeñ\ttumheñ\tparhez-gāri\tmile"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "184",
    "arabicText": "أَيَّامًۭا مَّعْدُودَٰتٍۢ ۚ فَمَن كَانَ مِنكُم مَّرِيضًا أَوْ عَلَىٰ سَفَرٍۢ فَعِدَّةٌۭ مِّنْ أَيَّامٍ أُخَرَ ۚ وَعَلَى ٱلَّذِينَ يُطِيقُونَهُۥ فِدْيَةٌۭ طَعَامُ مِسْكِينٍۢ ۖ فَمَن تَطَوَّعَ خَيْرًۭا فَهُوَ خَيْرٌۭ لَّهُۥ ۚ وَأَن تَصُومُوا۟ خَيْرٌۭ لَّكُمْ ۖ إِن كُنتُمْ تَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "For\t a\t certain\t number\t of\t days\t only;\t so\t\nwhoever\t is\t sick\t among\t you,\t or\t on\t a\t\njourney,\t the\t same\t number\tin\t other\t days;\t\nand\t those\t who\t do\t not\t have\t the\t strength\t\nfor\tit\tmust\tgive\ta redemption\tby\tfeeding\ta\t\nneedy\t person;\t so\t whoever\t increases\t the\t\ngood\t of\t his\t own\t accord,\t it\t is\t better\t for\t\nhim;\t and\t fasting\tis\t better\t for\t you,\tif\t only\t\nyou\trealise.",
    "romanUrduTranslationText": "Ginti\tke\tdin\thaiñ\tto\ttum\tmeiñ\tjo\tkoi\tbimār\t\nya\t safar\t meiñ\t ho\t to\t utne\t roze\t aur\t dinoñ\t\nmeiñ\t aur\t jinheiñ\t is\t ki\t tāqat\t na\t ho\t woh\t\nbadla\t deñ\t ek\t miskeen ka\t khāna\t phir\t jo\t\napni\t taraf\t se\t neki\t ziyada\t kare\t to\t woh\t us\t\nke\t liye\t behtar\t hai\t aur\t roza\t rakhna\t\ntumhāre\t liye\t ziyāda\t bhala\t hai\t agar\t tum\t\njāno"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "185",
    "arabicText": "شَهْرُ رَمَضَانَ ٱلَّذِىٓ أُنزِلَ فِيهِ ٱلْقُرْءَانُ هُدًۭى لِّلنَّاسِ وَبَيِّنَـٰتٍۢ مِّنَ ٱلْهُدَىٰ وَٱلْفُرْقَانِ ۚ فَمَن شَهِدَ مِنكُمُ ٱلشَّهْرَ فَلْيَصُمْهُ ۖ وَمَن كَانَ مَرِيضًا أَوْ عَلَىٰ سَفَرٍۢ فَعِدَّةٌۭ مِّنْ أَيَّامٍ أُخَرَ ۗ يُرِيدُ ٱللَّهُ بِكُمُ ٱلْيُسْرَ وَلَا يُرِيدُ بِكُمُ ٱلْعُسْرَ وَلِتُكْمِلُوا۟ ٱلْعِدَّةَ وَلِتُكَبِّرُوا۟ ٱللَّهَ عَلَىٰ مَا هَدَىٰكُمْ وَلَعَلَّكُمْ تَشْكُرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "The\tmonth\tof\tRamadan\tin\twhich\twas\tsent\t\ndown\t the\t Qur’an\t - the\t guidance\t for\t\nmankind,\t the\t direction\t and\t the\t clear\t\ncriteria\t (to\t judge\t between\t right\t and\t\nwrong);\tso\twhoever\tamong\tyou\twitnesses\t\nthis\t month,\t must\t fast\t for\t the\t (whole)\t\nmonth;\t and\t whoever\t is\t sick\t or\t on\t a\t\njourney,\tmay\tfast\tthe\tsame\tnumber\tin\tother\tdays;\tAllah desires\tease\tfor\tyou\tand\tdoes\tnot\tdesire\t\nhardship\t for\t you\t- so\t that\t you\t complete\t the\t count\t(of\tfasts),\t and\tglorify\tAllah’s\tgreatness\t for\t\nhaving\tguided\tyou,\tand\tso\tthat\tyou\tmay\tbe\tgrateful\t\n",
    "romanUrduTranslationText": "Ramzan\t ka\t mahina\t jis\t meiñ\t Qur'ān\t utra\t\nlogoñ\t ke\tliye\t hidāyat\taur\t rahnumāi\taur\t faisle\t ki\t raushn\t bāteiñ\t to\t tum\tmeiñ\tjo\t koi\t ye\tmahina\t\npāye\tzaroor\tiske\troze\trakhe\taur\tjo\tbimār\tya\tsafar\tmeiñ\tho\tto\titne\troze\taur\tdinoñ\tmeiñ\tAllah\ttum\t\npar\tasāni\tchāhta\thai\taur\t tum\tpar\tdushwāri\tnahi\tchāhta\taur\tisliye\tke\t tum\tginti\tpoori\tkaro\taur\t\nAllah\tki\tbadāi\tbolo\tis\tpar\tke\tusne\ttumheñ\thidāyat\tki\taur\tkaheeñ\ttum\thaq\tguzār\tho."
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "186",
    "arabicText": "وَإِذَا سَأَلَكَ عِبَادِى عَنِّى فَإِنِّى قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ ٱلدَّاعِ إِذَا دَعَانِ ۖ فَلْيَسْتَجِيبُوا۟ لِى وَلْيُؤْمِنُوا۟ بِى لَعَلَّهُمْ يَرْشُدُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t O\t dear\t Prophet\t (Muhammad - peace\t and\t blessings\t be\t upon\t him),\t when\t My\t bondmen\t\nquestion\tyou\tconcerning\tMe,\tthen\tsurely\tI\tam\tclose;\tI\tanswer\tthe\tprayer\tof\tthe\tsupplicant\twhen\t\nhe\tcalls\ton\tMe,\tso\tthey\tmust\tobey\tMe\tand\tbelieve\tin\tMe,\tso\tthat\tthey\tmay\tattain\tguidance.\t\n",
    "romanUrduTranslationText": "Aur\t aey\tMehboob jab\t tum\t se\t mere\t bande\t mujhe\t poocheñ\t to\t maiñ\t nazdeek\t hooñ\t dua\t qubool\t\nkarta\thooñ\tpukār\tne\twāle\tki\tjab\tmujhe\tpukāre\tto\tunheiñ\tchāhiye\tmera\thukm\tmāneñ\taur\tmujh\t\npar\tImān\tlāyeñ\tke\tkaheeñ\trāh\tpāyeñ"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "187",
    "arabicText": "أُحِلَّ لَكُمْ لَيْلَةَ ٱلصِّيَامِ ٱلرَّفَثُ إِلَىٰ نِسَآئِكُمْ ۚ هُنَّ لِبَاسٌۭ لَّكُمْ وَأَنتُمْ لِبَاسٌۭ لَّهُنَّ ۗ عَلِمَ ٱللَّهُ أَنَّكُمْ كُنتُمْ تَخْتَانُونَ أَنفُسَكُمْ فَتَابَ عَلَيْكُمْ وَعَفَا عَنكُمْ ۖ فَٱلْـَٔـٰنَ بَـٰشِرُوهُنَّ وَٱبْتَغُوا۟ مَا كَتَبَ ٱللَّهُ لَكُمْ ۚ وَكُلُوا۟ وَٱشْرَبُوا۟ حَتَّىٰ يَتَبَيَّنَ لَكُمُ ٱلْخَيْطُ ٱلْأَبْيَضُ مِنَ ٱلْخَيْطِ ٱلْأَسْوَدِ مِنَ ٱلْفَجْرِ ۖ ثُمَّ أَتِمُّوا۟ ٱلصِّيَامَ إِلَى ٱلَّيْلِ ۚ وَلَا تُبَـٰشِرُوهُنَّ وَأَنتُمْ عَـٰكِفُونَ فِى ٱلْمَسَـٰجِدِ ۗ تِلْكَ حُدُودُ ٱللَّهِ فَلَا تَقْرَبُوهَا ۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ ءَايَـٰتِهِۦ لِلنَّاسِ لَعَلَّهُمْ يَتَّقُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". Going\t to\t your\t wives\t during\t the\t nights\t of\t\nthe\t fast\t is\t made\t lawful\t for\t you;\t they\t are\t\ncoverings\t for\t you\t and\t you\t are\t coverings\t\nfor\t them;\t Allah knows\t that\t you\t were\t\ndeceiving\t yourselves\t (in\t this\t respect),\t so\t\nHe\t accepted\t your\t penance\t and\t forgave\t\nyou;\tso\tcohabit\twith\t them\tand\tseek\twhat\t\nAllah has\t destined\t for\t you\t- and\t eat\t and\t\ndrink\t until\t the\t white\t thread\t becomes\t\ndistinct\t to\t you\t from\t the\t black\t thread\t at\t\ndawn\t - then\t complete\t the\t fast\t till\t\nnightfall;\t and\t do\t not\t touch\t women\t while\t\nstaying\t in\t seclusion\t for\t worship\t in\t the\t\nmasjids;\t these\t are\t the\t limits\t imposed\t by\t\nAllah,\tso\tdo\tnot\tgo\tnear\tthem;\tthis\tis\thow\t\nAllah explains\t His\t verses\t to\t mankind\t so\t\nthat\tthey\tmay\tattain\tpiety.\t\t\n",
    "romanUrduTranslationText": "Rozoñ\t ki\t rātoñ\t meiñ\t apni\t aurtoñ\t ke\t pās\t\njāna\t tumhāre\t liye\t halāl\t huwa\t woh\t\ntumhāri\tlibās\thaiñ\taur\ttum\tunke\tjānoñ\tko\t\nkhayanat\tmeiñ\tdālte\tthey\tto\tusne\ttumhāri\t\ntauba\t qabool\t ki\t aur\t tumheiñ\t mu'āf\t\nfarmāya\t to\tab\tunse\tsohbat\tkaro\taur\t talab\t\nkaro\t jo\t Allah\t ne\t tumhāre\t naseeb\t meiñ\t\nlikha\t ho\t aur\t khāo\t aur\t piyo\t yahāñ\t tak\t ke\t\ntumhāre\tliye\tzāhir\tho\tjāye\tsafedi\tka\tdora\t\nsiyāhi\t ke\t dore\t se\t (pau\t phat\t kar)\t phir\t rāt\t\nāne\t tak\t roze\t poore\t karo\t aur\t aurtoñ\t ko\t\nhāth\t na\t lagāo\t jab\t tum\t Masjidoñ\t meiñ\t\na'itekāf\t se\t ho\t yeh\t Allah\t ki\t hadeiñ\t haiñ\t\nunke\tpās\tna\tjao\tAllah\tyooñ\thi\tbayān\tkar\tta\t\nhai\t logoñ\t se\t apni\t āyateiñ\t ke\t kaheeñ\t\nunheiñ\tparhez-gāri\tmile.\t"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "188",
    "arabicText": "وَلَا تَأْكُلُوٓا۟ أَمْوَٰلَكُم بَيْنَكُم بِٱلْبَـٰطِلِ وَتُدْلُوا۟ بِهَآ إِلَى ٱلْحُكَّامِ لِتَأْكُلُوا۟ فَرِيقًۭا مِّنْ أَمْوَٰلِ ٱلنَّاسِ بِٱلْإِثْمِ وَأَنتُمْ تَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". And\t do\t not\t unjustly\t devour\t the\t property\t\nof\t each\t other,\t nor\t take\t their\t cases\t to\t\njudges\t in\t order\t that\t you\t may\t wrongfully\t\ndevour\t a\t portion\t of\t other\t peoples’\t\nproperty\ton\tpurpose.\t\t\n",
    "romanUrduTranslationText": "Aur\t āpas\t meiñ\t ek\t doosre\t ka\t māl\t na-haq\t\nna\t khāo\t aur\t na\t hākimoñ\t ke\t pās\t unka\t\nmuqaddama\tisliye\tpahuñchao\tke\tlogoñ\tka\t\nkuch\tmāl\tna-jāiz\ttaur\tpar\tkha\tlo\tjān\tboojh\t\nkar\t"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "189",
    "arabicText": "۞ يَسْـَٔلُونَكَ عَنِ ٱلْأَهِلَّةِ ۖ قُلْ هِىَ مَوَٰقِيتُ لِلنَّاسِ وَٱلْحَجِّ ۗ وَلَيْسَ ٱلْبِرُّ بِأَن تَأْتُوا۟ ٱلْبُيُوتَ مِن ظُهُورِهَا وَلَـٰكِنَّ ٱلْبِرَّ مَنِ ٱتَّقَىٰ ۗ وَأْتُوا۟ ٱلْبُيُوتَ مِنْ أَبْوَٰبِهَا ۚ وَٱتَّقُوا۟ ٱللَّهَ لَعَلَّكُمْ تُفْلِحُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "They\task\tyou,\t(O\tdear\tProphet\tMuhammad\n- peace\t and\t blessings\t be\t upon\t him),\t\nregarding\t the\t crescents;\t say,\t “They\t are\t\nindicators\t of\t time\t for\t mankind\t and\t for\t\nHajj\t (the\t pilgrimage)”;\t and\t it\t is\t not\t a\t\nvirtue\tat\tall\t that\t you\tenter\t the\thouses\tby\t\ndemolishing\ttheir\tback\tportions,\tbut\tin\treality\tvirtue\tis\tpiety;\tand\tenter\tthe\thouses\tusing\ttheir\t\ngates\t- and\tkeep\tfearing\tAllah,\thoping\tthat\tyou\tachieve\tsuccess.\t\t\t\n",
    "romanUrduTranslationText": "Tum\tse\tnaye\tchāñd\tko\tpoochte\thaiñ\tfarmā\t\ndo\twoh\twaqt\tki\talāmateiñ\thaiñ\tlogoñ\taur\t\nhaj\t ke\t liye\t aur\t yeh\t kuchh\t bhalāi\t nahi\t ke\t\ngharoñ\tmeiñ\tpacheet (makān\t ke\tpeeche\t ki\tdiwār)\t tord\t kar\tāao,\thāñ\tbhalāi\t to\tparhez-gāri\thai\t\naur\tgharoñ\tmeiñ\tdarwāzoñ\tse\tāao\taur\tAllah\tse\tdarte\traho\tis\tummid\tpar\tke\tfalāh\tpāo."
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "190",
    "arabicText": "وَقَـٰتِلُوا۟ فِى سَبِيلِ ٱللَّهِ ٱلَّذِينَ يُقَـٰتِلُونَكُمْ وَلَا تَعْتَدُوٓا۟ ۚ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلْمُعْتَدِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t fight\tin\tAllah's\tcause\tagainst\t those\twho\t fight\tyou\tand\tdo\tnot\texceed\t the\tlimits;\tand\tAllah\ndoes\tnot\tlike\tthe\ttransgressors.\t\t\n",
    "romanUrduTranslationText": "Aur\tAllah\t ki\t rāh\tmeiñ\tlado\t unse\tjo\t tum\t se\tladte\t haiñ\taur\t had\t se\t na\t badho\tAllah\t pasand\t nahi\t\nrakhta\thad\tse\tbadhne\twāloñ\tko."
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "191",
    "arabicText": "وَٱقْتُلُوهُمْ حَيْثُ ثَقِفْتُمُوهُمْ وَأَخْرِجُوهُم مِّنْ حَيْثُ أَخْرَجُوكُمْ ۚ وَٱلْفِتْنَةُ أَشَدُّ مِنَ ٱلْقَتْلِ ۚ وَلَا تُقَـٰتِلُوهُمْ عِندَ ٱلْمَسْجِدِ ٱلْحَرَامِ حَتَّىٰ يُقَـٰتِلُوكُمْ فِيهِ ۖ فَإِن قَـٰتَلُوكُمْ فَٱقْتُلُوهُمْ ۗ كَذَٰلِكَ جَزَآءُ ٱلْكَـٰفِرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t slay\t the\t disbelievers\t wherever\t you\t\nfind\tthem,\tand\tdrive\tthem\tout\tfrom\twhere\t\nthey\t drove\t you\t out,\tand\t the\t turmoil\t they\t\ncause\t is\t worse\t than\t slaying;\t and\t do\t not\t\nfight\t them\t near\t the\t Sacred\t Masjid until\t\nthey\t fight\t you\t there;\t so\tif\t they\t fight\t you,\t\nslay\t them;\t this\t is\t the\t punishment\t of\t the\t\ndisbelievers\t\n",
    "romanUrduTranslationText": "Aur\tkāfiroñ\tko\tjahāñ\tpāo\tmāro\taur\tunheiñ\t\nnikāl\tdo\tjahāñ\tse\tunhoñ\tne\ttumheiñ\tnikāla\t\ntha\taur\tunka\tfasād\tto\tqatl\tse\tbhi\tsakht\thai\t\naur\t Masjid-e-Harām ke\t pās\t unse\t na\t lado\t\njab\ttak\t woh\t tum\t se\t wahāñ\t na\t ladeiñ\t aur\t\nagar\t tum\t se\t ladeiñ\t to\t unheiñ\t qatl\t karo\t\nkāfiroñ\tki\tyahi\tsaza\thai"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "192",
    "arabicText": "فَإِنِ ٱنتَهَوْا۟ فَإِنَّ ٱللَّهَ غَفُورٌۭ رَّحِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "Then\t if\t they\t desist,\t then\t indeed\t Allah is\t\nOft\tForgiving,\tMost\tMerciful.\t\t\n",
    "romanUrduTranslationText": "Phir\tagar\twoh\tb'az\traheiñ\tto\tbeshak\tAllah\t\nbakhsh\tne\twāla\tmaherbān\thai"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "193",
    "arabicText": "وَقَـٰتِلُوهُمْ حَتَّىٰ لَا تَكُونَ فِتْنَةٌۭ وَيَكُونَ ٱلدِّينُ لِلَّهِ ۖ فَإِنِ ٱنتَهَوْا۟ فَلَا عُدْوَٰنَ إِلَّا عَلَى ٱلظَّـٰلِمِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tfight\tthem\tuntil\tno\tmischief\tremains,\t\nand\tonly\tAllah is\tworshipped;\tthen\tif\tthey\t\ndesist,\t do\t not\t harm\t them,\t except\t the\t\nunjust.\t\n",
    "romanUrduTranslationText": "Aur\t unse\t lado\t yahāñ\t tak\t ke\t koi\t fitna\t na\t\nrahe\t aur\t ek\t Allah\t ki\t pooja\t ho\t phir\t agar\t\nwoh\t b'az\t āyeiñ\t to\t ziyadati\t nahi\t magar\t\nzālimoñ\tpar.\t"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "194",
    "arabicText": "ٱلشَّهْرُ ٱلْحَرَامُ بِٱلشَّهْرِ ٱلْحَرَامِ وَٱلْحُرُمَـٰتُ قِصَاصٌۭ ۚ فَمَنِ ٱعْتَدَىٰ عَلَيْكُمْ فَٱعْتَدُوا۟ عَلَيْهِ بِمِثْلِ مَا ٱعْتَدَىٰ عَلَيْكُمْ ۚ وَٱتَّقُوا۟ ٱللَّهَ وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ مَعَ ٱلْمُتَّقِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "The\t sacred\t month\t for\t the\t sacred\t month,\t\nand\t respect\t in\t lieu\t of\t respect;\t harm\t the\t\none\t who\t harms\t you,\t to\t the\t extent\t as\t he\t\ndid\t - and\t keep\t fearing\t Allah,\t and\t know\t\nwell\tthat\tAllah is\twith\tthe\tpiou\t\n",
    "romanUrduTranslationText": "Māhe\t harām\t ke\t badle\t māhe\t harām\t aur\t\nadab\t ke\t badle\t adab\t hai\t to\t jo\t tum\t par\t\nziyadati\t kare\t tum\t us\t par\t ziyadati\t karo\t\nutni\thi\tjitni\tusne\tki\taur\tAllah\tse\tdarte\traho\t\naur\tjān\t rakho\t ke\tAllah\tdar\twāloñ\t ke\t sāth\t\nhai"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "195",
    "arabicText": "وَأَنفِقُوا۟ فِى سَبِيلِ ٱللَّهِ وَلَا تُلْقُوا۟ بِأَيْدِيكُمْ إِلَى ٱلتَّهْلُكَةِ ۛ وَأَحْسِنُوٓا۟ ۛ إِنَّ ٱللَّهَ يُحِبُّ ٱلْمُحْسِنِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t spend\t your\t wealth\t in\t Allah's\t cause,\t\nand\t do\t not\t fall\t into\t ruin\t with\t your\t own\t\nhands;\t and\t be\t virtuous;\t undoubtedly\t the\t\nrighteous\tare\tthe\tbeloved\tof\tAllah\n",
    "romanUrduTranslationText": "Aur Allah\t ki\t rāh\t meiñ\t kharch\t karo\t aur\t\napne\t hāthoñ\t halākat\t meiñ\t na\t pado\t aur\t\nbhalāi\t wāle\t ho\t jāo\t beshak\t bhalāi\t wāle\t\nAllah\tke\tmehboob\thaiñ"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "196",
    "arabicText": "وَأَتِمُّوا۟ ٱلْحَجَّ وَٱلْعُمْرَةَ لِلَّهِ ۚ فَإِنْ أُحْصِرْتُمْ فَمَا ٱسْتَيْسَرَ مِنَ ٱلْهَدْىِ ۖ وَلَا تَحْلِقُوا۟ رُءُوسَكُمْ حَتَّىٰ يَبْلُغَ ٱلْهَدْىُ مَحِلَّهُۥ ۚ فَمَن كَانَ مِنكُم مَّرِيضًا أَوْ بِهِۦٓ أَذًۭى مِّن رَّأْسِهِۦ فَفِدْيَةٌۭ مِّن صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍۢ ۚ فَإِذَآ أَمِنتُمْ فَمَن تَمَتَّعَ بِٱلْعُمْرَةِ إِلَى ٱلْحَجِّ فَمَا ٱسْتَيْسَرَ مِنَ ٱلْهَدْىِ ۚ فَمَن لَّمْ يَجِدْ فَصِيَامُ ثَلَـٰثَةِ أَيَّامٍۢ فِى ٱلْحَجِّ وَسَبْعَةٍ إِذَا رَجَعْتُمْ ۗ تِلْكَ عَشَرَةٌۭ كَامِلَةٌۭ ۗ ذَٰلِكَ لِمَن لَّمْ يَكُنْ أَهْلُهُۥ حَاضِرِى ٱلْمَسْجِدِ ٱلْحَرَامِ ۚ وَٱتَّقُوا۟ ٱللَّهَ وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ شَدِيدُ ٱلْعِقَابِ",
    "urduTranslationText": "",
    "englishTranslationText": ". And\t perform\t Hajj\t (greater\t pilgrimage)\t\nand\t Umrah\t (lesser\t pilgrimage)\t for\t Allah;\t\nand\t if\t you\t are\t prevented,\t send\t sacrifice\t\nwhatever\t is\t available;\t and\t do\t not\t shave\t\nyour\t heads\t until\t the\t sacrifice\t reaches\t its\t\ndestination;\tso\twhoever\tamong\tyou\tis\tsick\t\nor\thas\tan\tailment\tin\tthe\thead,\tmust\tpay a\t\ncompensation\t by\t fasting\t or\t charity\t or\t\nsacrifice;\t then\t when\t you\t are\t in\t peace\t -\nand\t whoever\t takes\t the\t advantage\t of\t\ncombining\tthe\tHajj\tand\tUmrah,\tit\tis\tcompulsory\tfor\thim\tto\tsacrifice\twhatever\tis\tavailable;\tand\t\nwhoever\tcannot\tafford\tit,\tmust\tfast\tfor\tthree days\twhile\ton\tthe\tpilgrimage,\tand\tseven\twhen\tyou\t\nhave\treturned\tto\tyour\thomes;\tthese\tare\tten\tin\tall;\tthis\tdecree\tis\tfor\thim\twho\tis\tnot\ta\tresident\tof\t\nMecca;\tand\tkeep\tfearing\tAllah and\tknow\twell\tthat\tAllah’s\tpunishment\tis\tsevere.\t\n",
    "romanUrduTranslationText": ". Aur\t Haj aur\t Umrah Allah\t ke\t liye\t poora\t\nkaro\t phir\t agar\t tum\t roke\t jāo\t to\t Qurbani\t\nbhejo\t jo\t mayassar\t āaye\t aur\t apne\t sar\t na\t\nmundhāo\tjab\ttak\tQurbāni\tapne\tthikāne\tna\t\npahoñch\t jāye\t phir\t jo\t tum\tmeiñ\t bimār\t ho\t\nya\tuske\tsar\tmeiñ\tkuch\ttakleef\thai\tto\tbadla\t\nde\troze\tya\tkhairāt\tya\tQurbāni\tphir\tjab\ttum\titmenān\tse\tho\tto\tjo\tHaj se\tUmrah milāne\tka\tfaidah\t\nuthāye\tus\tpar\tQurbāni\thai\tjaisi\tmayassar\tāaye\tphir\tjise\tmaqdoor\tna\tho\tto\tteen\troze\tHaj\tke\tdinoñ\t\nmeiñ\trakhe\taur\tsāt\tjab\tapne\tghar\tpalat\tkar\tjāo\tyeh\tpoore\tDas\thuwe\tyeh\thukm\tuske\tliye\thai\tjo\t\nMakkāh ka\trahne\twāla\tna\tho\taur\tAllah\tse\tdarte\traho\taur\tjān\trakho\tke\tAllah\tka\t‘azāb\tsakht\thai"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "197",
    "arabicText": "ٱلْحَجُّ أَشْهُرٌۭ مَّعْلُومَـٰتٌۭ ۚ فَمَن فَرَضَ فِيهِنَّ ٱلْحَجَّ فَلَا رَفَثَ وَلَا فُسُوقَ وَلَا جِدَالَ فِى ٱلْحَجِّ ۗ وَمَا تَفْعَلُوا۟ مِنْ خَيْرٍۢ يَعْلَمْهُ ٱللَّهُ ۗ وَتَزَوَّدُوا۟ فَإِنَّ خَيْرَ ٱلزَّادِ ٱلتَّقْوَىٰ ۚ وَٱتَّقُونِ يَـٰٓأُو۟لِى ٱلْأَلْبَـٰبِ",
    "urduTranslationText": "",
    "englishTranslationText": "The\t Hajj\t is\t during\t the\t well-known\t\nmonths;\t and\t for\t one\t who\t intends\t to\t\nperform\tthe\tHajj\tin\tit\t- neither\tis\tthere\tto\t\nbe\t mention\t of\t cohabitation\t in\t the\t\npresence\t of\t women,\t nor\t any\t sin,\t nor\t a\t\nfight\t with\t anyone\t till\t the\t completion\t of\t\nHajj;\t and\t whatever\t good\t you\t do,\t Allah\nknows\t it;\t and\t take\t provision\t along\t with\t\nyou\t for\t the\t best\t provision\t is\t piety;\t and\t\nkeep\tfearing\tMe,\tO\tmen\tof\tunderstanding!\n",
    "romanUrduTranslationText": " Haj\tke\tkai\tmaheene\thai\tjāne\thuwe\tto\tjo\tun\t\nmeiñ\t Haj\t ki\t niyat\t kare\t to\t na\t aurtoñ\t ke\t\nsāmne\tsohbat\tka\t tazkira\tho\tna\tkoi\tgunāh\t\nna\tkisi\tse\tjhagda\tHaj\tke\twaqt\ttak\taur\ttum\t\njo\t bhalāi\t karo\t Allah\t use\t jānta\t hai\t aur\t\ntosha (safar\t ka\t kharch) sāth\tlo\t ke\t sab\t se\t\nbehtar\t tosha\t parhez-gāri\t hai\taur\tmujh\t se\t\ndarte\traho\taey\taql\twālo"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "198",
    "arabicText": "لَيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَبْتَغُوا۟ فَضْلًۭا مِّن رَّبِّكُمْ ۚ فَإِذَآ أَفَضْتُم مِّنْ عَرَفَـٰتٍۢ فَٱذْكُرُوا۟ ٱللَّهَ عِندَ ٱلْمَشْعَرِ ٱلْحَرَامِ ۖ وَٱذْكُرُوهُ كَمَا هَدَىٰكُمْ وَإِن كُنتُم مِّن قَبْلِهِۦ لَمِنَ ٱلضَّآلِّينَ",
    "urduTranslationText": "",
    "englishTranslationText": "It\t is\t no\t sin\t for\t you\t that\t you\t seek\t the\t\nbounty\tof\tyour\tLord;\tso\twhen\tyou\treturn\t\nfrom\t Arafat,\t remember\t Allah near\t the\t\nSacred\t Symbol\t(Mash’ar\t al\t Haram)\t- and\t\nremember\t Him\t in\t the\t manner\t He\t has\t\nguided\t you;\t and\t indeed,\t before\t this,\t you\t\nwere\tof\tthe\tastray.\t\t\n\n",
    "romanUrduTranslationText": "Tum\t par\t koi\t gunāh\t nahi\t ke\t apne\t Rab\t ka\t\nfazl\t talāsh\t karo\t to\t jab\t arafāt\t se\t palto\t to\t\nAllah\t ki\t yād\t karo\tmash'are\t harām\t ke\tpās\t\naur\t uska\t zikr\t karo\t jaise\t usne\t tumheiñ\t\nhidāyat\t farmāyi\t aur\t beshak\t is\t se\t pahle\t\ntum\tbahke\thuwe\tthey"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "199",
    "arabicText": "ثُمَّ أَفِيضُوا۟ مِنْ حَيْثُ أَفَاضَ ٱلنَّاسُ وَٱسْتَغْفِرُوا۟ ٱللَّهَ ۚ إِنَّ ٱللَّهَ غَفُورٌۭ رَّحِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": ". Then,\t O\t people\t of\t Quraish,\t you\t too\t must\t\nreturn\t from\t the\t place\t where\t the\t people\t\nreturn\t from,\t and\t ask\t forgiveness\t from\t\nAllah;\tindeed\tAllah is\tOft\t Forgiving,\tMost\t\nMerciful.\t\t\n\n",
    "romanUrduTranslationText": ". Phir\t bāt\t yeh\t hai\t ke\t aey\t Quraishiyo\t tum\t\nbhi\t wahiñ\t se\t palto\t jahāñ\t se\t log\t palat\t te\t\nhaiñ\taur\tAllah\tse\tmu'āfi\tmāñgo\tbeshak\tAllah\tbakhsh\tne\twāla\tmaherbān\thai"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "200",
    "arabicText": "فَإِذَا قَضَيْتُم مَّنَـٰسِكَكُمْ فَٱذْكُرُوا۟ ٱللَّهَ كَذِكْرِكُمْ ءَابَآءَكُمْ أَوْ أَشَدَّ ذِكْرًۭا ۗ فَمِنَ ٱلنَّاسِ مَن يَقُولُ رَبَّنَآ ءَاتِنَا فِى ٱلدُّنْيَا وَمَا لَهُۥ فِى ٱلْـَٔاخِرَةِ مِنْ خَلَـٰقٍۢ",
    "urduTranslationText": "",
    "englishTranslationText": "So\t when\t you\t have\t completed\t your\t Hajj\t\nrites,\t remember\t Allah as\t you\t used\t to\t\nremember\t your\t forefathers,\tin\t fact\tmore\t than\t that;\tand\tamong\t the\tpeople\tare\t some\t that\t say,\t\n“Our\tLord!\tGive\tus\tin\tthis\tworld”\t- and\the\tdoes\tnot\thave\ta\tportion\tin\tthe\tHereafter.\n\n",
    "romanUrduTranslationText": " Phir\tjab\t apne\tHaj ke\t kām\t poore\t kar\t chuko\t to\t Allah\t ka\t zikr\t karo\tjaise\t apne\t bāp\t dāda\t ka\t zikr\t\nkarte\t they\t balke\tis\t se\tziyada\taur\t koi\tādmi\t yooñ\t kahta\thai\t ke\taey\tRab\thamāre\thameiñ\tduniya\t\nmeiñ\tde\taur\tākhirat\tmeiñ\tuska\tkuchh\thissa\tnahi"
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "201",
    "arabicText": " وَمِنْهُم مَّن يَقُولُ رَبَّنَآ ءَاتِنَا فِى ٱلدُّنْيَا حَسَنَةًۭ وَفِى ٱلْـَٔاخِرَةِ حَسَنَةًۭ وَقِنَا عَذَابَ ٱلنَّارِ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t among\t them\t are\t some\t that\t say,\t “Our\t Lord!\t Give\t us\t good\t in\t the\t world\t and\t good\t in\t the\t\nHereafter,\tand\tsave\tus\tfrom\tthe\tpunishment\tof\tfire!”\n\n",
    "romanUrduTranslationText": ". Aur\tkoi\tyooñ\tkahta\thai\tke\taey\tRab\thamāre\thameiñ\tduniya\tmeiñ\tbhalāi\tde\taur\thameiñ\tākhirat\t\nmeiñ\tbhalāi\tde\taur\thameiñ\t‘azāb-e-dozakh\tse\tbacha."
  },
  {
    "juz": {
      "id": "2"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "202",
    "arabicText": "أُو۟لَـٰٓئِكَ لَهُمْ نَصِيبٌۭ مِّمَّا كَسَبُوا۟ ۚ وَٱللَّهُ سَرِيعُ ٱلْحِسَابِ",
    "urduTranslationText": "",
    "englishTranslationText": "For\tsuch\tis\ta\tportion\tfrom\twhat\tthey\thave\tearned;\tand\tAllah is\tSwift\tAt\tTaking Account.\n\n",
    "romanUrduTranslationText": "Aisoñ\tko\tunki\tkamāyi\tse\tbhāg\thai\taur\tAllah\tjald\thisāb\tkarne\twāla\thai."
  }
]