[
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "86",
    "arabicText": "وَإِذَا حُيِّيتُم بِتَحِيَّةٍۢ فَحَيُّوا۟ بِأَحْسَنَ مِنْهَآ أَوْ رُدُّوهَآ ۗ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَىْءٍ حَسِيبًا",
    "urduTranslationText": "",
    "englishTranslationText": "And\twhen\tyou\tare\tgreeted\twith\tsome\twords,\tgreet\tback\twith\twords\tbetter\tthan\tit\tor\twith\tthe\t\nsame;\tindeed\tAllah will\ttake\taccount\tof\teverything.",
    "romanUrduTranslationText": "Aur\tjab\ttumheiñ\tkoi\tkisi\tlafz\tse\tSalām\tkare\tto\ttum\tus\tse\tbehtar\tlafz\tjawāb\tmeiñ\tkaho\tya\twohi\t\nkah\tdo\tbeshak\tAllah\thar\tcheez\tpar\thisāb\tlene\twāla\thai."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "87",
    "arabicText": "ٱللَّهُ لَآ إِلَـٰهَ إِلَّا هُوَ ۚ لَيَجْمَعَنَّكُمْ إِلَىٰ يَوْمِ ٱلْقِيَـٰمَةِ لَا رَيْبَ فِيهِ ۗ وَمَنْ أَصْدَقُ مِنَ ٱللَّهِ حَدِيثًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "Allah!\t There\t is\t none\t worthy\t of\t worship\t\nexcept\tHim;\tHe\twill\t surely\tgather\t you\tall\t\non\tthe\tDay\tof\tResurrection\tin\twhich\tthere\t\nis\t no\t doubt;\t and\t whose\tWords\t are\t more\t\ntrue\t than\t those\t of\t Allah?\t(Allah does\t not\t\nlie.)\t",
    "romanUrduTranslationText": "Allah\thai\tke\tuske\tsiwā\tkisi\tki\tbandagi\tnahi\t\naur\twoh\tzaroor\ttumheiñ\tikhat-tha\tkarega\t\nQayāmat\t ke\t din\t jis\t meiñ\t kuch\t shak\t nahi\t\naur\tAllah\tse\tziyāda\tkis\tki\tbāt\tsachchi."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "88",
    "arabicText": "۞ فَمَا لَكُمْ فِى ٱلْمُنَـٰفِقِينَ فِئَتَيْنِ وَٱللَّهُ أَرْكَسَهُم بِمَا كَسَبُوٓا۟ ۚ أَتُرِيدُونَ أَن تَهْدُوا۟ مَنْ أَضَلَّ ٱللَّهُ ۖ وَمَن يُضْلِلِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ سَبِيلًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "So\t what\t is\t the\t matter\t with\t you\t that\t you\t\ngot\t divided\t into\t two\t groups\t concerning\t\nthe\t hypocrites,\t whereas\t Allah has\t\ninverted\tthem\tbecause\tof\ttheir\tmisdeeds?\t\nDo\tyou\twish\tto\tguide\tone\twhom\tAllah has\t\nsent\t astray?\t And\t for\t one\t whom\t Allah\nsends\tastray,\tyou\twill\tnot find\ta\tway.\t\t",
    "romanUrduTranslationText": "To\t tumheiñ\t kiya\t huwa\t ke\t munāfiqoñ\t ke\t\nbāre\tmeiñ\tdo\tfareeq\tho\tgaye\taur\tAllah\tne\t\nunheiñ\t auñdha\t kar\t diya\t un\t ke\t kotakoñ\t\n(Bure\tA'amal)\tke\tsabab\tkya\t ye\tchāhte\tho\t\nke\t usey\t rāh\t dikhāo\t jise\t Allah\t ne\t gumrāh\t\nkiya\taur\tjise\tAllah\tgumrah\t kare\t to\thargiz\t\ntu\tuske\tliye\tkoi\trāh\tna\tpāye\tga."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "89",
    "arabicText": "وَدُّوا۟ لَوْ تَكْفُرُونَ كَمَا كَفَرُوا۟ فَتَكُونُونَ سَوَآءًۭ ۖ فَلَا تَتَّخِذُوا۟ مِنْهُمْ أَوْلِيَآءَ حَتَّىٰ يُهَاجِرُوا۟ فِى سَبِيلِ ٱللَّهِ ۚ فَإِن تَوَلَّوْا۟ فَخُذُوهُمْ وَٱقْتُلُوهُمْ حَيْثُ وَجَدتُّمُوهُمْ ۖ وَلَا تَتَّخِذُوا۟ مِنْهُمْ وَلِيًّۭا وَلَا نَصِيرًا",
    "urduTranslationText": "",
    "englishTranslationText": "They\t wish\t that\t you\t too\t should\t turn\t\ndisbelievers\tthe\tway\tthey\tdid,\tso\tthat\tyou\t\nall\tmay\tbecome\tequal\t- so\tdo\tnot\tbefriend\t\nany\t of\t them\t until\t they\t forsake\t their\t\nhomes\tand\t families\tin\tAllah’s\tcause;\t then\t\nif\tthey\tturn\tback,\tseize\tthem\tand\tkill\tthem\nwherever\tyou\t find\t them;\tand\tdo\tnot\t take\t\nany\tof\tthem\tas\ta\tfriend\tnor\tas\ta\tsupporter.\t\t\t",
    "romanUrduTranslationText": "Woh\t jo\t yeh\t chāhte\t haiñ\t ke\t kaheeñ\t tum\t\nbhi\t kāfir\t ho\t jāo\t jaise\t woh\t kāfir\t huwe\t to\t\ntum\t sab\t ek\t se\t ho\t jāo\t to un\t meiñ\t kisi\t ko\t\napna\t dost\t na\t banāo\t jab\t tak\t Allah\t ki\t rāh\t\nmeiñ\tghar-bār\tna\tchordeiñ\tphir\tagar\twoh\t\nmuñh\tphereiñ\tto\tunheiñ\tpakrdo\taur\tjahāñ\t\npāo\tqatl\tkaro\taur\tun\tmeiñ\tkisi\tko\tna\tdost\t\nthahrāo\tna\tmadad-gār"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "90",
    "arabicText": "إِلَّا ٱلَّذِينَ يَصِلُونَ إِلَىٰ قَوْمٍۭ بَيْنَكُمْ وَبَيْنَهُم مِّيثَـٰقٌ أَوْ جَآءُوكُمْ حَصِرَتْ صُدُورُهُمْ أَن يُقَـٰتِلُوكُمْ أَوْ يُقَـٰتِلُوا۟ قَوْمَهُمْ ۚ وَلَوْ شَآءَ ٱللَّهُ لَسَلَّطَهُمْ عَلَيْكُمْ فَلَقَـٰتَلُوكُمْ ۚ فَإِنِ ٱعْتَزَلُوكُمْ فَلَمْ يُقَـٰتِلُوكُمْ وَأَلْقَوْا۟ إِلَيْكُمُ ٱلسَّلَمَ فَمَا جَعَلَ ٱللَّهُ لَكُمْ عَلَيْهِمْ سَبِيلًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "Except\t those\t who\t are\t related\t to\t the\t\npeople\tbetween\twhom\tand\tyou\tis\ta\ttreaty,\t\nor\twho\tcome\t to\t you\twith\t their\thearts\tno\t\nlonger\t having\t the\t will\t to\t fight\t you\t or\t to\t\nfight\t their own\t people;\t had\t Allah willed,\t\nHe\t would\t certainly\t have\t given\t them\t\npower\t over\t you\t so\t that\t they\twould\t have\t\nsurely\t fought\t you;\t then\tif\t they\tavoid\t you\t\nand\tdo\tnot\twage\twar\tagainst\tyou\tand\tmake\tan\toffer\tof\tpeace\t- then\tAllah has\tnot\tkept\tfor\tyou\ta\t\nway\tagainst\tthem.\t",
    "romanUrduTranslationText": "Magar\t woh\t jo\t aisi\t qaum\t se\t alāqa\t\n(Ta'alluq)\t rakhte\t haiñ\t ke\t tum\t meiñ\t un\t\nmeiñ\tmu‘āhda\thai\tya\ttumhāre\tpās\tyuñ\tāye\t\nke\tunke\tdiloñ\tmeiñ\tsakat\t (Tāqat)\tna\trahi\t\nke\t tum\t se\tladeiñ\t ya\t apni\t qaum\t se\tladeiñ\t\naur\tAllah\tchāhta\tto\tzaroor\tunheiñ\ttum\tpar\t\nqābu\t deta\t to\t woh\t beshak\t tum\t se\t lardte\t\nphir\tagar\twoh\ttum\tse\tkināra\tkareiñ\taur\tna\t\nladeiñ\taur\tsulāh\tka\tpayām\tdāleiñ\tto\tAllah\tne\ttumheiñ\tun\tpar\tkoi\trāh\tna\trakhi\t"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "91",
    "arabicText": "سَتَجِدُونَ ءَاخَرِينَ يُرِيدُونَ أَن يَأْمَنُوكُمْ وَيَأْمَنُوا۟ قَوْمَهُمْ كُلَّ مَا رُدُّوٓا۟ إِلَى ٱلْفِتْنَةِ أُرْكِسُوا۟ فِيهَا ۚ فَإِن لَّمْ يَعْتَزِلُوكُمْ وَيُلْقُوٓا۟ إِلَيْكُمُ ٱلسَّلَمَ وَيَكُفُّوٓا۟ أَيْدِيَهُمْ فَخُذُوهُمْ وَٱقْتُلُوهُمْ حَيْثُ ثَقِفْتُمُوهُمْ ۚ وَأُو۟لَـٰٓئِكُمْ جَعَلْنَا لَكُمْ عَلَيْهِمْ سُلْطَـٰنًۭا مُّبِينًۭا",
    "urduTranslationText": "",
    "englishTranslationText": ". You\twill\tnow\tfind\tothers\twho\tdesire\tthat\tthey\tshould\tbe\tsafe\tfrom\tyou\tand\talso\tsafe\tfrom\ttheir\t\nown\tpeople;\twhenever\ttheir\tpeople\tturn\tthem\ttowards\twar,\tthey\tfall\theadlong\tinto\tit;\tso\tif\tthey\t\ndo\tnot\tavoid\t(confronting)\tyou\tnor\tsubmit\tan\toffer\tof\tpeace\tnor\trestrain\ttheir\thands,\tseize\tthem\t\nand\tkill\tthem\twherever\tyou\tfind\tthem;\tand\tthey\tare\tthe\tones\tagainst\twhom\tWe\thave\tgiven\tyou\t\nclear\tauthority",
    "romanUrduTranslationText": "Ab\tkuch\taur\ttum\taise\tpāo\tge\tjo\tyeh\tchāhte\thaiñ\tke\ttum\tse\tbhi\tamān\tmeiñ\traheiñ\taur\tapni\tqaum\t\nse\tbhi\tamān\tmeiñ\traheiñ\tjab\tkabhi\tun\tki\tqaum\tunheiñ\tfasād\tki\ttaraf\tphere\tus\tpar\tauñdhe\tgirte\t\nhaiñ\t phir\t agar\t woh\t tum\t se\t kināra\t na\t kareiñ\t aur\t sulāh\t ki\t gardan\t na\t dāleiñ\t aur\t apne\t hāth\t na\t\nrokeiñ\t to\t unheiñ\t pakdo\taur\tjahāñ\t pāo\t qatl\t karo\taur\t yeh\t haiñ\tjin\t par\t ham\t ne\t tumheiñ\t sareeh\t\n(Khula)\tikhtiyār\tdiya\t"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "92",
    "arabicText": "وَمَا كَانَ لِمُؤْمِنٍ أَن يَقْتُلَ مُؤْمِنًا إِلَّا خَطَـًۭٔا ۚ وَمَن قَتَلَ مُؤْمِنًا خَطَـًۭٔا فَتَحْرِيرُ رَقَبَةٍۢ مُّؤْمِنَةٍۢ وَدِيَةٌۭ مُّسَلَّمَةٌ إِلَىٰٓ أَهْلِهِۦٓ إِلَّآ أَن يَصَّدَّقُوا۟ ۚ فَإِن كَانَ مِن قَوْمٍ عَدُوٍّۢ لَّكُمْ وَهُوَ مُؤْمِنٌۭ فَتَحْرِيرُ رَقَبَةٍۢ مُّؤْمِنَةٍۢ ۖ وَإِن كَانَ مِن قَوْمٍۭ بَيْنَكُمْ وَبَيْنَهُم مِّيثَـٰقٌۭ فَدِيَةٌۭ مُّسَلَّمَةٌ إِلَىٰٓ أَهْلِهِۦ وَتَحْرِيرُ رَقَبَةٍۢ مُّؤْمِنَةٍۢ ۖ فَمَن لَّمْ يَجِدْ فَصِيَامُ شَهْرَيْنِ مُتَتَابِعَيْنِ تَوْبَةًۭ مِّنَ ٱللَّهِ ۗ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "It\t is\t not\t rightful\t for\t a\t Muslim\t to\t kill\t\nanother\t Muslim,\t unless\t it\t occurs\t by\t\nmistake;\tand\tthe\tone\twho\tmistakenly\tkills\t\na\tMuslim\tmust\tset\tfree\ta\tMuslim\tslave\tand\t\npay\t blood-money\t to\t the\t family\t of\t the\t\nslain,\t except\t if\t they\t forego\t it;\t and\t if\t the\t\nvictim\t is\t of\t a\t people\t who\t are\t hostile\t to\t\nyou,\tand\t the\tkiller\tis\ta\tMuslim,\t then\tonly\t\nthe\t setting\t free\t of\t a\t Muslim\t slave\t (is\t\nobligatory);\t and\t if\t the\t victim\t is\t from\t a\t\npeople\tbetween\twhom\tand\tyou\tthere\tis\ta\t\ntreaty,\tthen\tblood-money\tmust\tbe\tpaid\tto\t\nhis\tfamily\tand\tthe\tsetting\tfree\tof\ta\tMuslim\t\nslave;\t therefore\t one\t who\t has\t no\t means\t\nmust\t fast\t for\t two\t consecutive\t months;\t\nthis\tis\this\tpenance\tbefore\tAllah;\tand\tAllah\nis\tAll\tKnowing,\tWise",
    "romanUrduTranslationText": "Aur\t Musalmānoñ\t ko\t nahi\t pahuñchta\t ke\t\nMusalman\t ka\t khoon\t kare\t magar\t hāth\t\nbahek\t kar\t aur\t jo\t kisi\t Musalman\t ka\t na\u0002dānista\t qatl\t kare\t us\t par\t ek\t mamlook\t\nMusalman\t (Muslim\t Ghulām)\t ka\t azād\t\nkarna\t hai\t aur\t khoon\t bahā\t ke\tmaqtool\t ke\t\nlogoñ\tko\tsapurd\tki\tjāye\tmagar\tyeh\tke\twoh\t\nmu'āf\tkar\tdeiñ\tphir\tagar\twoh\tus\tqaum\tse\t\nho\t jo\t tumhāri\t dushman\t hai\t aur\t khud\t\nMusalman\t hai\t to\t sirf\t ek\t mamlook\t\nMusalman\tka\tazād\tkarna\taur\tagar\twoh\tus\t\nqaum\t meiñ\t ho\t ke\t tum\t meiñ\t un\t meiñ\t\nmu‘āhda\thai\tto\tuske\tlogoñ\tko\tkhoon\tbahā\t\nsupurd\tki\tjāye\taur\tek\tMusalman\tmamlook\t\nāzad\tkarna\tto\tjiska\thāth\tna\tpahuñche\twoh\t\nlagātār\tdo\tmahine\tke\troze\trakhe\tyeh\tAllah\t\nke\tyahāñ\tus\tki\ttauba\thai\taur\tAllah\tjān\tne\twāla\tHikmat\twāla\thai."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "93",
    "arabicText": "وَمَن يَقْتُلْ مُؤْمِنًۭا مُّتَعَمِّدًۭا فَجَزَآؤُهُۥ جَهَنَّمُ خَـٰلِدًۭا فِيهَا وَغَضِبَ ٱللَّهُ عَلَيْهِ وَلَعَنَهُۥ وَأَعَدَّ لَهُۥ عَذَابًا عَظِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\twhoever\tslays\ta\tMuslim\ton\tpurpose,\t\nhis\treward\twill\tbe\thell\t- to\tremain\tin\tit\tfor\t\nages\t- and\tAllah has\twreaked\twrath\tupon\t\nhim\t and\t has\t cursed\t him\t and\t kept\t\nprepared\ta\tterrible\tpunishment\tfor\thim.\t",
    "romanUrduTranslationText": "Aur\tjo\t koi\tMusalman\t ko\tjān\t boojh\t kar\t qatl\t kare\t to\t uska\t badla\tJahannam\t hai\t ke\tmuddatoñ\t us\t\nmeiñ\trahe\taur\tAllah\tne\tus\tpar\tghazab\tkiya\taur\tus\tpar\tla'nat\tki\taur\tuske\tliye\ttayyār\trakha\tbadā\t\n‘azāb."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "94",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِذَا ضَرَبْتُمْ فِى سَبِيلِ ٱللَّهِ فَتَبَيَّنُوا۟ وَلَا تَقُولُوا۟ لِمَنْ أَلْقَىٰٓ إِلَيْكُمُ ٱلسَّلَـٰمَ لَسْتَ مُؤْمِنًۭا تَبْتَغُونَ عَرَضَ ٱلْحَيَوٰةِ ٱلدُّنْيَا فَعِندَ ٱللَّهِ مَغَانِمُ كَثِيرَةٌۭ ۚ كَذَٰلِكَ كُنتُم مِّن قَبْلُ فَمَنَّ ٱللَّهُ عَلَيْكُمْ فَتَبَيَّنُوٓا۟ ۚ إِنَّ ٱللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "O\tPeople\twho\tBelieve!\tWhen\tyou\tgo\tforth\t\nto\tfight\tin\tholy\twar,\tmake\ta\tproper\tstudy,\t\nand\tdo\tnot\tsay\tto\tthe\tone\twho\tgreets\tyou,\t“You\tare\tnot\ta\tMuslim,”\t- you seek\tthe\tmeans\tof\tthis\t\nworldly\tlife;\tso\twith\tAllah are\tthe\tbounties\tin\tplenty;\tyou\ttoo\twere\tlike\tthis\tbefore,\tthen\tAllah\nbestowed\t His\t favour\t on\t you,\t therefore\t you\t must\t make\t a\t proper\t study;\t indeed\t Allah knows\t\nwhatever\tyou\tdo.\t",
    "romanUrduTranslationText": ". Aey\tImān\twālo!\tJab\ttum\tJihād\tko\tchalo\tto\ttahqeeq\tkarlo\taur\tjo\ttumheiñ\tSalām\tkare\tus\tse\tyeh\tna\t\nkaho\t ke\t tu\t Masalmān\t nahi\t tum\t jeeti\t duniya\t ka\t asbāb\t chāhte\t ho\t to\t Allah\t ke\t pās\t bahuteri\t\nghanimateiñ\t haiñ\t pahle\t tum\t bhi\t aise\t hi\t they\t phir\t Allah\t ne\t tum\t par\t ehsān\t kiya\t to\t tum\t par\t\ntahqeeq\tkarna\tlāzim\thai\tbeshak\tAllah\tko\ttumhāre\tkāmoñ\tki\tkhabar\thai."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "95",
    "arabicText": "لَّا يَسْتَوِى ٱلْقَـٰعِدُونَ مِنَ ٱلْمُؤْمِنِينَ غَيْرُ أُو۟لِى ٱلضَّرَرِ وَٱلْمُجَـٰهِدُونَ فِى سَبِيلِ ٱللَّهِ بِأَمْوَٰلِهِمْ وَأَنفُسِهِمْ ۚ فَضَّلَ ٱللَّهُ ٱلْمُجَـٰهِدِينَ بِأَمْوَٰلِهِمْ وَأَنفُسِهِمْ عَلَى ٱلْقَـٰعِدِينَ دَرَجَةًۭ ۚ وَكُلًّۭا وَعَدَ ٱللَّهُ ٱلْحُسْنَىٰ ۚ وَفَضَّلَ ٱللَّهُ ٱلْمُجَـٰهِدِينَ عَلَى ٱلْقَـٰعِدِينَ أَجْرًا عَظِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "The\tMuslims\twho\tstay\tback\tfrom\tholy\twar\t\nwithout\t proper\t excuse,\t are\t not\t equal\t to\t\nthe\t Muslims\t who\t fight\t in\t Allah's\t cause\t\nwith\t their\t wealth\t and\t lives;\t Allah has\t\nbestowed\t higher\t ranks\t to\t the\t warriors\t\nwho\t strive\t with\t their\t wealth\t and\t lives,\t\nthan\t those\t who\t stay\t back;\t and\tAllah has\t\npromised\t good\t to\t all;\t and\t Allah has\t\nfavoured\t the\t warriors\t upon\t those\t who\t\nstay\tback,\twith\ta\tgreat\treward.\t\t",
    "romanUrduTranslationText": "Barābar\t nahi\t woh\t Musalman\t ke\t be-uzr\t\nJihād\t se\t baith\t raheiñ\t aur\t woh\t ke\t Rāh-e\u0002Khuda\t meiñ\t apne\t māloñ\t aur\t jānoñ\t se\t\nJihād\tkarte\thaiñ\tAllah\tne\tapne\tmāloñ\taur\t\njānoñ\t ke\t sāth\t jihād\t wāloñ\t ka\t darja\t baith\t\nne\twāloñ\tse\tbada\tkiya\taur\tAllah\tne\tsab\tse\t\nbhalāi\t ka\t w'ada\t farmāya\t aur\t Allah\t ne\t\nJihād\t wāloñ\t ko\t baith\t ne\t wāloñ\t par\t bade\t\nsawāb\tse\tfazilat\tdi\thai."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "96",
    "arabicText": "دَرَجَـٰتٍۢ مِّنْهُ وَمَغْفِرَةًۭ وَرَحْمَةًۭ ۚ وَكَانَ ٱللَّهُ غَفُورًۭا رَّحِيمًا",
    "urduTranslationText": "",
    "englishTranslationText": "Ranks\t (of\t honour)\t from\t Him, and\t\nforgiveness,\t and\t mercy;\t and\t Allah is\t Oft\t\nForgiving,\tMost\tMerciful.\t\t\t",
    "romanUrduTranslationText": "Uski\t taraf\t se\t darje\t aur\t bakhshish\t aur\t\nrahmat\t aur\t Allah\t bakhsh ne\t wāla\t\nmaherbān\thai."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "97",
    "arabicText": "إِنَّ ٱلَّذِينَ تَوَفَّىٰهُمُ ٱلْمَلَـٰٓئِكَةُ ظَالِمِىٓ أَنفُسِهِمْ قَالُوا۟ فِيمَ كُنتُمْ ۖ قَالُوا۟ كُنَّا مُسْتَضْعَفِينَ فِى ٱلْأَرْضِ ۚ قَالُوٓا۟ أَلَمْ تَكُنْ أَرْضُ ٱللَّهِ وَٰسِعَةًۭ فَتُهَاجِرُوا۟ فِيهَا ۚ فَأُو۟لَـٰٓئِكَ مَأْوَىٰهُمْ جَهَنَّمُ ۖ وَسَآءَتْ مَصِيرًا",
    "urduTranslationText": "",
    "englishTranslationText": "The\t angels\t ask\t the\t people\t whose\t souls\t\nthey\t remove\t while\t they\t were\t wronging\t\nthemselves,\t“What\twere\tyou\tengaged\tin?”\t\nThey\t reply,\t “We\t were\t powerless\t in\t the\t\nland”;\t the\t angels\t say,\t “Was\t Allah’s\t earth\t\nnot\t spacious\t enough\t for\t you\t to\t have\t\nmigrated\t in\t it?”\t The\t destination\t for\t such\t\nis\t hell;\t and\t a\t very\t wretched\t place\t to\t\nreturn\t",
    "romanUrduTranslationText": "Woh\tlog\tjinki\tjān\tFirishte\tnikāl\t te\thaiñ\tis\t\nhāl\t meiñ\t ke\t woh\t apne\t upar\t zulm\t karte\t\nthey\t un\t se\t Firishte\t kahte\t haiñ\t tum\t kāhe\t\nmeiñ\t they\t kahte\t hain\t ke\t ham\t zameen\t\nmeiñ\tkamzor\tthey\tkahte\thaiñ\tkiya\tAllah\tki\t\nzameen\t kushādah\t na\t thi\t ke\t tum\t us\tmeiñ\t\nhijrat\tkarte\tto\taisoñ\tka\tthikāna\tJahannam\t\nhai\taur\tbahut\tburi\tjagah\tpalatne\tki."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "98",
    "arabicText": "إِلَّا ٱلْمُسْتَضْعَفِينَ مِنَ ٱلرِّجَالِ وَٱلنِّسَآءِ وَٱلْوِلْدَٰنِ لَا يَسْتَطِيعُونَ حِيلَةًۭ وَلَا يَهْتَدُونَ سَبِيلًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "Except\t those\t who\t were\t forcibly\t subdued\t\namong\tmen,\tand\tthe\twomen\tand\tchildren,\t\nunable\t to\t devise\t a\t plan\t and\t unaware\t of\t\nthe\tway.\t",
    "romanUrduTranslationText": "Magar\t woh\t jo\t dabā\t liye\t gaye\t mard\t aur\t\naurteiñ\t aur\t bachche\t jinheiñ\t na\t koi\t\ntadbeer\tban\tpade\tna\trāsta\tjāneiñ.\t\n"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "99",
    "arabicText": "فَأُو۟لَـٰٓئِكَ عَسَى ٱللَّهُ أَن يَعْفُوَ عَنْهُمْ ۚ وَكَانَ ٱللَّهُ عَفُوًّا غَفُورًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "So\t for\t such,\t it\t is\t likely\t that\t Allah will\t\npardon\t them;\t and\t Allah is\t Most\t\nPardoning,\tOft\tForgiving.\t",
    "romanUrduTranslationText": "To\t qareeb\t hai\t ke\t Allah\t aisoñ\t ko\t mu'āf\t\nfarmāye\t aur\t Allah\t mu'āf\t farmāne\t wāla\t\nbakhsh\tne\twāla\thai."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "100",
    "arabicText": "۞ وَمَن يُهَاجِرْ فِى سَبِيلِ ٱللَّهِ يَجِدْ فِى ٱلْأَرْضِ مُرَٰغَمًۭا كَثِيرًۭا وَسَعَةًۭ ۚ وَمَن يَخْرُجْ مِنۢ بَيْتِهِۦ مُهَاجِرًا إِلَى ٱللَّهِ وَرَسُولِهِۦ ثُمَّ يُدْرِكْهُ ٱلْمَوْتُ فَقَدْ وَقَعَ أَجْرُهُۥ عَلَى ٱللَّهِ ۗ وَكَانَ ٱللَّهُ غَفُورًۭا رَّحِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "Whoever\t migrates\t for\t Allah's\t cause\t will\t\nfind\tmuch\t shelter\t and\t abundant\t capacity\t\nin\t the\t earth;\t and\t whoever\t leaves\t his\t\nhome,\tmigrating\ttowards\tAllah and\tHis\tNoble\tMessenger,\tand\tdeath\tseizes\thim,\this\treward\tthen\t\nlies\tentrusted\twith\tAllah;\tand\tAllah is\tOft\tForgiving,\tMost\tMerciful.",
    "romanUrduTranslationText": "Aur\t jo\t Allah\t ki\t rāh\t meiñ\t ghar-bār\t chord\t\nkar\tniklega\twoh\tzameen\tmeiñ\tbahut\tjagah\taur\tgunjāish\tpāyega\taur\tjo\tapne\tghar\tse\tnikla\tAllah\u0002o-Rasool\tki\ttaraf\tHijrat\tkarta\tphir\tusey\tmaut\tne\tā liya\tto\tuska\tsawāb\tAllah\tke\tzimme\tpar\tho\tgaya\t\naur\tAllah bakhsh\tne\twāla\tmaherbān\thai."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "101",
    "arabicText": "وَإِذَا ضَرَبْتُمْ فِى ٱلْأَرْضِ فَلَيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَقْصُرُوا۟ مِنَ ٱلصَّلَوٰةِ إِنْ خِفْتُمْ أَن يَفْتِنَكُمُ ٱلَّذِينَ كَفَرُوٓا۟ ۚ إِنَّ ٱلْكَـٰفِرِينَ كَانُوا۟ لَكُمْ عَدُوًّۭا مُّبِينًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\twhen\tyou\ttravel\tin\tthe\tland,\tit\tis\tno\tsin\tfor\tyou\tto\tcurtail\tsome\tof\tyour\tobligatory\tprayers;\tif\t\nyou\tfear\tthat\tdisbelievers\tmay\tcause\tyou\tharm;\tundoubtedly\tthe\tdisbelievers\tare\topen\tenemies\t\nto\tyou.\t\n",
    "romanUrduTranslationText": "\nAur\tjab\ttum\tzameen\tmeiñ\tsafar\tkaro\t to\t tum\tpar\tgunāh\tnahi\tke\tb'az\tNamāzeiñ\tQasr\tse\tpadho\t\nagar\t tumheiñ\t andesha\t ho\t ke\t kāfir\t tumheiñ\tizā\t deñge\t beshak\t kuffar\t tumhāre\t khule\t dushman\t\nhaiñ"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "102",
    "arabicText": "وَإِذَا كُنتَ فِيهِمْ فَأَقَمْتَ لَهُمُ ٱلصَّلَوٰةَ فَلْتَقُمْ طَآئِفَةٌۭ مِّنْهُم مَّعَكَ وَلْيَأْخُذُوٓا۟ أَسْلِحَتَهُمْ فَإِذَا سَجَدُوا۟ فَلْيَكُونُوا۟ مِن وَرَآئِكُمْ وَلْتَأْتِ طَآئِفَةٌ أُخْرَىٰ لَمْ يُصَلُّوا۟ فَلْيُصَلُّوا۟ مَعَكَ وَلْيَأْخُذُوا۟ حِذْرَهُمْ وَأَسْلِحَتَهُمْ ۗ وَدَّ ٱلَّذِينَ كَفَرُوا۟ لَوْ تَغْفُلُونَ عَنْ أَسْلِحَتِكُمْ وَأَمْتِعَتِكُمْ فَيَمِيلُونَ عَلَيْكُم مَّيْلَةًۭ وَٰحِدَةًۭ ۚ وَلَا جُنَاحَ عَلَيْكُمْ إِن كَانَ بِكُمْ أَذًۭى مِّن مَّطَرٍ أَوْ كُنتُم مَّرْضَىٰٓ أَن تَضَعُوٓا۟ أَسْلِحَتَكُمْ ۖ وَخُذُوا۟ حِذْرَكُمْ ۗ إِنَّ ٱللَّهَ أَعَدَّ لِلْكَـٰفِرِينَ عَذَابًۭا مُّهِينًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t when\t you\t (O\t dear\t Prophet\t\nMuhammad - peace\tand\tblessings\tbe\tupon\t\nhim)\t are\t among\t them\t and\t lead\t them\t in\t\nprayer,\t only\t a\t group\t of\t them\t should\t be\t\nwith\t you,\t and\t they\t must\t keep\t their\t\nweapons\t with\t them;\t so\t when\t they\t have\t\nperformed\t their\tprostrations\t they\tshould\t\nmove\t away\t behind\t you;\t and\t the\t other\t\ngroup\t that\t had\t not\t prayed,\t must\t come\nand\t offer\t prayers\t in\t your\t leadership,\t\nkeeping\t their\t guard\t and\t weapons\t with\t\nthem;\t the\t disbelievers\t wish\t that\t you\t\nneglect\tyour\tarms\tand\tyour\tmeans\tso\tthey\t\nmay\t overpower\t you\twith\t a\t single\t attack;\t\nit\tis\tno\tsin\t for\tyou\tto\tlay\taside\tyour\tarms\t\ndue\t to\t rain\t or\t if\t you\t are\t sick;\t and\t keep\t\nyour\t guard;\t undoubtedly\t Allah has\t kept\t\nprepared\ta\tdisgraceful\tpunishment\tfor\tthe\t\ndisbelievers.\t",
    "romanUrduTranslationText": "Aur\t aey\t Mahboob jab\t tum\t un\t meiñ\t\ntashreef\t farmā\t ho\t phir\tNamāz\tmeiñ\t unki\t\nImāmat\t karo\t to\t chāhiye\t ke\t un\t meiñ\t ek\t\njam'at\t tumhāre\t sāth\t ho\t aur\t woh\t apne\t\nhathiyār\t liye\t raheiñ\t phir\t jab\t woh\t Sajda\t\nkar\tleiñ\tto\that\tkar\ttum\tse\tpeeche\tho\tjāyeiñ\t\naur\t ab\t doosri\t jam'at\t āye\t jo\t us\t waqt\t tak\t\nNamāz\t meiñ\t shareek\t na\t thi\t ab\t woh\t\ntumhāre\tmuqtadi\thoñ\taur\tchāhiye\tke\tapni\t\npanāh\t aur\t apne\t hathiyār\t liye\t raheiñ\t\nkāfiroñ\t ki\t tamanna\t hai\t ke\t kaheeñ\t tum\t\napne\thathiyāroñ\taur\tapne\tasbāb\tse\tghāfil\t\nho\tjāo\tto\tek\tdafa'\ttum\tpar\tjhuk\tpadeiñ\taur\t\ntum\tpar\tmuzāiqa\tnahi\tagar\ttumheiñ\tmeñh\t\n(Barish)\t ke\t sabab\t takleef\t ho\t ya\t bimār\t ho\t\nke\t apne\t hathiyār\t khol\t rakho\t aur\t apni\t\npanāh\t liye\t raho\t beshak\t Allah\t ne\t kāfiroñ\t\nke\tliye\tkhuwāri\t(Zillat)\tka\t‘azāb\ttayyār\tkar\t\nrakha\tha"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "103",
    "arabicText": "فَإِذَا قَضَيْتُمُ ٱلصَّلَوٰةَ فَٱذْكُرُوا۟ ٱللَّهَ قِيَـٰمًۭا وَقُعُودًۭا وَعَلَىٰ جُنُوبِكُمْ ۚ فَإِذَا ٱطْمَأْنَنتُمْ فَأَقِيمُوا۟ ٱلصَّلَوٰةَ ۚ إِنَّ ٱلصَّلَوٰةَ كَانَتْ عَلَى ٱلْمُؤْمِنِينَ كِتَـٰبًۭا مَّوْقُوتًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "So\t when\t you\t have\t offered\t your\t prayers\t\nremember\t Allah while\t standing,\t sitting\t\nand\t reclining;\t and\t when\t you\t feel\t secure,\t\noffer\tprayers\tin\tthe\tusual\tmanner;\tindeed\t\nprayers\tare\ta\ttime\tbound\tobligatory\tduty\t\nupon\tthe\tMuslims.\t.\t",
    "romanUrduTranslationText": "Phir\tjab\t tum\tNamāz\tpadh\tchuko\t to\tAllah\tki\t yād\tkaro\tkhade\taur\tbaithe\taur\tkarwatoñ\tpar\tlete\t\nphir\tjab\tmutma‘in\tho\tjāo\tto\thasb-e-dastoor\tNamāz\tqāim\tkaro\tbeshak\tNamāz\tMusalmanoñ\tpar\t\nwaqt\tbāñdha\thuwa\tfarz\thai."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "103",
    "arabicText": "فَإِذَا قَضَيْتُمُ ٱلصَّلَوٰةَ فَٱذْكُرُوا۟ ٱللَّهَ قِيَـٰمًۭا وَقُعُودًۭا وَعَلَىٰ جُنُوبِكُمْ ۚ فَإِذَا ٱطْمَأْنَنتُمْ فَأَقِيمُوا۟ ٱلصَّلَوٰةَ ۚ إِنَّ ٱلصَّلَوٰةَ كَانَتْ عَلَى ٱلْمُؤْمِنِينَ كِتَـٰبًۭا مَّوْقُوتًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "So\t when\t you\t have\t offered\t your\t prayers\t\nremember\t Allah while\t standing,\t sitting\t\nand\t reclining;\t and\t when\t you\t feel\t secure,\t\noffer\tprayers\tin\tthe\tusual\tmanner;\tindeed\t\nprayers\tare\ta\ttime\tbound\tobligatory\tduty\t\nupon\tthe\tMuslims.\t.\t",
    "romanUrduTranslationText": "Phir\tjab\t tum\tNamāz\tpadh\tchuko\t to\tAllah\tki\t yād\tkaro\tkhade\taur\tbaithe\taur\tkarwatoñ\tpar\tlete\t\nphir\tjab\tmutma‘in\tho\tjāo\tto\thasb-e-dastoor\tNamāz\tqāim\tkaro\tbeshak\tNamāz\tMusalmanoñ\tpar\t\nwaqt\tbāñdha\thuwa\tfarz\thai."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "104",
    "arabicText": "وَلَا تَهِنُوا۟ فِى ٱبْتِغَآءِ ٱلْقَوْمِ ۖ إِن تَكُونُوا۟ تَأْلَمُونَ فَإِنَّهُمْ يَأْلَمُونَ كَمَا تَأْلَمُونَ ۖ وَتَرْجُونَ مِنَ ٱللَّهِ مَا لَا يَرْجُونَ ۗ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمًا",
    "urduTranslationText": "",
    "englishTranslationText": "Do\tnot\trelax\tin\tpursuit\tof\tthe\tdisbelievers;\t\nif\tyou\tare\tsuffering,\tthey\talso\tsuffer\tas\tyou\tdo;\tand\tyou\texpect\tfrom\tAllah what\tthey\tdo\tnot;\tand\t\nAllah is\tAll\tKnowing,\tWise.\t",
    "romanUrduTranslationText": "Aur\t kāfiroñ\t ki\t talash\t meiñ\t susti\t na\t karo\t agar\t tumheiñ\t dukh\t pahuñchta\t hai\t jaisa\t tumheiñ\t\npahuñchta\t hai\taur\t tum\tAllah\t se\twoh\t ummeed\t rakhte\t ho\tjo\twoh\t nahi\t rakhte\taur\tAllah\tjān-ne\t\nwāla\thikmat\twāla\thai."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "105",
    "arabicText": "إِنَّآ أَنزَلْنَآ إِلَيْكَ ٱلْكِتَـٰبَ بِٱلْحَقِّ لِتَحْكُمَ بَيْنَ ٱلنَّاسِ بِمَآ أَرَىٰكَ ٱللَّهُ ۚ وَلَا تَكُن لِّلْخَآئِنِينَ خَصِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "We\thave\tindeed\tsent\tdown\tthe\ttrue\tBook\ttowards\tyou\t(O\tdear\tProphet\tMuhammad - peace\tand\t\nblessings\tbe\tupon\thim),\tso\t that\tyou\tmay\tjudge\tbetween\tmen,\tin\t the\tway\tAllah may\tshow\tyou;\t\nand\tdo\tnot\tplead\ton\tbehalf\tof\tthe\ttreacherous.\t",
    "romanUrduTranslationText": "Aey\tMehboob!\tBeshak\tham\tne\ttumhāri\ttaraf\tsachchi\tKitāb\tutāri\tke\ttum\tlogoñ\tmeiñ\tfaisla\tkaro\tjis\t\ntarah\ttumheiñ\tAllah\tdikhāye\taur\tdghā\twāloñ\tki\ttaraf\tse\tna\tjhagdo."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "106",
    "arabicText": "وَٱسْتَغْفِرِ ٱللَّهَ ۖ إِنَّ ٱللَّهَ كَانَ غَفُورًۭا رَّحِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t seek\t forgiveness\t from\t Allah;\t indeed\t\nAllah is\tOft\tForgiving,\tMost\tMerciful.",
    "romanUrduTranslationText": "Aur\t Allah\t se\t mu'āfi\t chāho\t beshak\t Allah\t\nbakhsh\tne\twāla\tmaherbān\thai."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "107",
    "arabicText": "وَلَا تُجَـٰدِلْ عَنِ ٱلَّذِينَ يَخْتَانُونَ أَنفُسَهُمْ ۚ إِنَّ ٱللَّهَ لَا يُحِبُّ مَن كَانَ خَوَّانًا أَثِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\tdo\tnot\tplead\t on\t behalf\t of\t those\twho\t\ndeceive\tthemselves;\tindeed\tAllah does\tnot\t\nlike\tany\ttreacherous,\texcessive\tsinner.\t",
    "romanUrduTranslationText": "Aur\tun\tki\ttaraf\tse\tna\tjhagdo\tjo\tapni\tjānoñ\t\nko\tkhiyānat\tmeiñ\tdālte\thaiñ\tbeshak\tAllah\t\t\nnahi\tchāhta\tkisi\tbade\tdghā-bāz\tguneh-gār\t\nko"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "108",
    "arabicText": "يَسْتَخْفُونَ مِنَ ٱلنَّاسِ وَلَا يَسْتَخْفُونَ مِنَ ٱللَّهِ وَهُوَ مَعَهُمْ إِذْ يُبَيِّتُونَ مَا لَا يَرْضَىٰ مِنَ ٱلْقَوْلِ ۚ وَكَانَ ٱللَّهُ بِمَا يَعْمَلُونَ مُحِيطًا",
    "urduTranslationText": "",
    "englishTranslationText": "They\thide\tfrom\tmen\tand\tdo\tnot\thide\tfrom\t\nAllah,\t whereas\t Allah is\t with\t them\t when\t\nthey\t plan\t in\t their\t hearts\t that\t which\t\ndispleases\tHim;\tand\tAllah has\ttheir\tdeeds\t\nencompassed.\t",
    "romanUrduTranslationText": "Ādmiyoñ\tse\tchupte\thaiñ\taur\tAllah\tse\tnahi\t\nchupte\taur\tAllah\tunke\tpās\thai\tjab\tdil\tmeiñ\t\nwoh\tbāt\ttajweez\tkarte\thaiñ\tjo\tAllah\tko\tna\u0002pasand\t hai\t aur\t Allah\t unke\t kāmoñ\t ko\t\nghere\thuwe\thai"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "109",
    "arabicText": "هَـٰٓأَنتُمْ هَـٰٓؤُلَآءِ جَـٰدَلْتُمْ عَنْهُمْ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا فَمَن يُجَـٰدِلُ ٱللَّهَ عَنْهُمْ يَوْمَ ٱلْقِيَـٰمَةِ أَم مَّن يَكُونُ عَلَيْهِمْ وَكِيلًۭا",
    "urduTranslationText": "",
    "englishTranslationText": ". Pay\theed!\tIt\tis\tyou\tpeople\twho\targued\ton\t\ntheir\t behalf\t in\t the\t life\t of\t this\t world;\t so\t\nwho\t will\t fight\t on\t their\t behalf\t with\t Allah\non\tthe\tDay\tof\tResurrection,\tor\twho\twill\tbe\t\ntheir\tpleader?\t",
    "romanUrduTranslationText": ". Sunte\tho\tyeh\tjo\t tum\tho\tduniyā\tki\tzindagi\t\nmeiñ\tto\tunki\ttaraf\tse\tjhagde\tto\tun\tki\ttaraf\t\nse\tkaun\tjhagde\tga\tAllah\tse\tQayāmat\tke\tdin\t\nya\tkaun\tunka\twakeel\thoga."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "110",
    "arabicText": "وَمَن يَعْمَلْ سُوٓءًا أَوْ يَظْلِمْ نَفْسَهُۥ ثُمَّ يَسْتَغْفِرِ ٱللَّهَ يَجِدِ ٱللَّهَ غَفُورًۭا رَّحِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\twhoever\tdoes\tevil\tor\twrongs\this\town\t\nsoul\t and\t then\t seeks\t forgiveness\t from\t\nAllah,\t will\t find\t Allah Oft\t Forgiving,\t Most\t\nMerciful",
    "romanUrduTranslationText": "Aur\t jo\t koi\t burāyi\t ya\t apni\t jān\t par\t zulm\t\nkare\tphir\tAllah\tse\tbakhshish\tchāhe\tto\tAllah\tko\tbakhsh\tne\twāla\tmaherbān\tpāyega"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "111",
    "arabicText": "وَمَن يَكْسِبْ إِثْمًۭا فَإِنَّمَا يَكْسِبُهُۥ عَلَىٰ نَفْسِهِۦ ۚ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": ". And\t whoever\t earns\t sin,\t his\t earnings\t will\t\nonly\t be\t against\t himself;\t and\t Allah is\t the\t\nKnowing,\tWise.\t",
    "romanUrduTranslationText": "aur\tjo\tgunāh\tkamāye\tto\tuski\tkamāyi\tusi\tki\tjān\tpar\tpade\taur\tAllah\tIlm-o-Hikmat\twāla\thai"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "112",
    "arabicText": "وَمَن يَكْسِبْ خَطِيٓـَٔةً أَوْ إِثْمًۭا ثُمَّ يَرْمِ بِهِۦ بَرِيٓـًۭٔا فَقَدِ ٱحْتَمَلَ بُهْتَـٰنًۭا وَإِثْمًۭا مُّبِينًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\twhoever\tcommits\ta\tmistake\tor\ta\tsin,\t\nthen\t blames\t it\t on\t someone\t innocent\t has\t\nindeed\tburdened\thimself\twith\tinfamy\tand\ta\tmanifest\tcrime.",
    "romanUrduTranslationText": "Aur\tjo\tkoi\tkhtā\tya\tgunāh\tkamāye\tphir\tusey\tkisi\tbe-gunāh\tpar\tthop\tde\tusne\tzaroor\tbohtān\taur\t\nkhulā\tgunāh\tuthāya"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "113",
    "arabicText": "وَلَوْلَا فَضْلُ ٱللَّهِ عَلَيْكَ وَرَحْمَتُهُۥ لَهَمَّت طَّآئِفَةٌۭ مِّنْهُمْ أَن يُضِلُّوكَ وَمَا يُضِلُّونَ إِلَّآ أَنفُسَهُمْ ۖ وَمَا يَضُرُّونَكَ مِن شَىْءٍۢ ۚ وَأَنزَلَ ٱللَّهُ عَلَيْكَ ٱلْكِتَـٰبَ وَٱلْحِكْمَةَ وَعَلَّمَكَ مَا لَمْ تَكُن تَعْلَمُ ۚ وَكَانَ فَضْلُ ٱللَّهِ عَلَيْكَ عَظِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t O\t dear\t Prophet,\t were\t it\t not\t for\t Allah’s\t munificence\t and\t His\t mercy\t upon\t you,\t a\t group\t\namong\tthem\twould\thave\twished\tto\tdeceive\tyou;\tand\tthey\tonly\tmislead\tthemselves\tand\twill\tnot\t\nharm\tyou\tat\tall;\tand\tAllah has\tsent\tdown\tupon\tyou\t the\tBook\tand\twisdom,\tand\t taught\tyou\tall\t\nwhat\tyou\tdid\tnot\tknow*;\tand\tupon\tyou\tis\tAllah’s\tgreat\tmunificence.\t(Allah gave\tthe\tknowledge\t\nof\tthe\thidden\tto\tthe\tHoly\tProphet\t– peace\tand\tblessings\tbe\tupon\thim.)\t",
    "romanUrduTranslationText": "Aur\t aey\tMehboob!\tAgar\t Allah\t ka\tFazl-o-Rahmat\t tum\t par\t na\t hota\t to\t un\tmeiñ\t ke\t kuch log\t yeh\t\nchāhte\tke\ttumheiñ\tdhoka\tde\tdeiñ\taur\twoh\tapne\thi\tāp\tko\tbehka\trahe\thaiñ\taur\ttumhāra\tkuch\tna\t\nbigādeñ\tge\taur\tAllah\tne\ttum\tpar\tKitāb\taur\tHikmat\tutāri\taur\ttumheiñ\tsikha\tdiya\tjo\tkuch\ttum\tna\t\njānte\tthey\taur\tAllah\tka\ttum\tpar\tbadā\tfazl\thai."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "114",
    "arabicText": "۞ لَّا خَيْرَ فِى كَثِيرٍۢ مِّن نَّجْوَىٰهُمْ إِلَّا مَنْ أَمَرَ بِصَدَقَةٍ أَوْ مَعْرُوفٍ أَوْ إِصْلَـٰحٍۭ بَيْنَ ٱلنَّاسِ ۚ وَمَن يَفْعَلْ ذَٰلِكَ ٱبْتِغَآءَ مَرْضَاتِ ٱللَّهِ فَسَوْفَ نُؤْتِيهِ أَجْرًا عَظِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "Most\t of\t their\t discussions\t do\t not\t contain\t\nany\t good,\t except\t of\t the\t one\t who\t enjoins\t\ncharity\t or\t goodness\t or\t peace-making\t\namong\tpeople;\twhoever\tdoes\tthat\tto\tseek\t\nthe\tpleasure\tof\tAllah - We\tshall\tsoon\tgive\t\nhim\ta\tgreat\treward\t",
    "romanUrduTranslationText": "Unke\taksar\tmashwaroñ\tmeiñ\tkuch\tbhalāi\t\nnahi\tmagar\tjo\thukm\tde\tkhairāt\t ya\tachchi\t\nbāt\t ya\t logoñ\t meiñ\t sulāh\t karne\t ka\t aur\t jo\t\nAllah\tki\traza\tchāhne\tko\taisa\tkare\tusey\tan\u0002qareeb\tham\tbadā\tsawāb\tdeñge"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "115",
    "arabicText": "وَمَن يُشَاقِقِ ٱلرَّسُولَ مِنۢ بَعْدِ مَا تَبَيَّنَ لَهُ ٱلْهُدَىٰ وَيَتَّبِعْ غَيْرَ سَبِيلِ ٱلْمُؤْمِنِينَ نُوَلِّهِۦ مَا تَوَلَّىٰ وَنُصْلِهِۦ جَهَنَّمَ ۖ وَسَآءَتْ مَصِيرًا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t whoever\t opposes\t the\t Noble\t\nMessenger\t after\t the\t right\t path\t has\t been\t\nmade\t clear\t to\t him,\t and\t follows\t a\t way\t\nother\t than\t that\t of\t the\t Muslims,\tWe\t shall\t\nleave\thim\tas\the\tis,\tand\tput\thim\tin\thell;\tand\t\nwhat\ta\twretched\tplace\tto\treturn!\t",
    "romanUrduTranslationText": "Aur\tjo\tRasool\t ka\t khilāf\t kare\tb'ad\tiske\t ke\t\nhaq\t rāsta\t us\t par\t khul\t chukā\t aur\t\nMusalmānoñ\tki\trāh\tse\tjudā\trāh\tchale\tham\t\nusey\t us\t ke\t hāl\t par\t chord\t deñge\t aur\t usey\t\ndozakh\t meiñ\t dākhil\t kareñge\t aur\t kiya\t hi\t\nburi\tjagah\tpalatne\tki"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "116",
    "arabicText": "إِنَّ ٱللَّهَ لَا يَغْفِرُ أَن يُشْرَكَ بِهِۦ وَيَغْفِرُ مَا دُونَ ذَٰلِكَ لِمَن يَشَآءُ ۚ وَمَن يُشْرِكْ بِٱللَّهِ فَقَدْ ضَلَّ ضَلَـٰلًۢا بَعِيدًا",
    "urduTranslationText": "",
    "englishTranslationText": "Allah does\t not\t forgive\t (the\t greatest\t sin)\t\nthat\tpartners\tbe\tascribed\twith\tHim\t- and\t\nHe\tforgives\tall\tthat\tis\tbelow\t(lesser\tsins)\tit,\t\nto\t whomever\t He\t wills;\t and\t whoever\t\nascribes\t partners\t with\t Allah has\t indeed\t\nwandered\tfar\tastray\t",
    "romanUrduTranslationText": ". Allah\t usey\t nahi\t bakhshtā\t ke\t uskā\t koi\t\nshareek\tthahrāya\tjāye\taur\tus\tse\tneeche\tjo\t\nkuch hai\t jise\t chāhe\tmu'āf\t farmā\t detā\t hai\t\naur\t jo\t Allah\t ka\t shareek\t thahrāye\t woh\t\ndoor\tki\tgumrāhi\tmeiñ\tpadā."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "117",
    "arabicText": "إِن يَدْعُونَ مِن دُونِهِۦٓ إِلَّآ إِنَـٰثًۭا وَإِن يَدْعُونَ إِلَّا شَيْطَـٰنًۭا مَّرِيدًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "The\t polytheists\t do\t not\t worship\t Allah,\t\nexcept\t some\t females;\t and\t they\t do\t not\t\nworship\t anyone\t except\t the\t rebellious\t\nSatan.\t",
    "romanUrduTranslationText": "Yeh\t shirk\twāle\tAllah\t ke\t siwa\t nahi\t poojte\t\nmagar\t kuch\t aurtoñ\t ko\t aur\t nahi\t poojte\t\nmagar\tsarkash\tshaitān\tko."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "118",
    "arabicText": "لَّعَنَهُ ٱللَّهُ ۘ وَقَالَ لَأَتَّخِذَنَّ مِنْ عِبَادِكَ نَصِيبًۭا مَّفْرُوضًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "The\t one\twhom\tAllah has\tcursed;\tand\t the\t\ndevil\tsaid,\t“I\tswear,\tI\twill\tcertainly\ttake\tan\t\nappointed\tportion\tof\tYour\tbondmen,”\t-\t",
    "romanUrduTranslationText": "Jis\t par\t Allah\t ne\t la'nat\t ki\t aur\t bolā\t qasam\t\nhai\tmaiñ\tzaroor\ttere\tbandoñ\tmeiñ\tse\tkuch\t\nthahrāya\thua\thissa\tlooñga."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "118",
    "arabicText": "لَّعَنَهُ ٱللَّهُ ۘ وَقَالَ لَأَتَّخِذَنَّ مِنْ عِبَادِكَ نَصِيبًۭا مَّفْرُوضًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "The\t one\twhom\tAllah has\tcursed;\tand\t the\t\ndevil\tsaid,\t“I\tswear,\tI\twill\tcertainly\ttake\tan\t\nappointed\tportion\tof\tYour\tbondmen,”\t-\t",
    "romanUrduTranslationText": "Jis\t par\t Allah\t ne\t la'nat\t ki\t aur\t bolā\t qasam\t\nhai\tmaiñ\tzaroor\ttere\tbandoñ\tmeiñ\tse\tkuch\t\nthahrāya\thua\thissa\tlooñga."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "119",
    "arabicText": "وَلَأُضِلَّنَّهُمْ وَلَأُمَنِّيَنَّهُمْ وَلَـَٔامُرَنَّهُمْ فَلَيُبَتِّكُنَّ ءَاذَانَ ٱلْأَنْعَـٰمِ وَلَـَٔامُرَنَّهُمْ فَلَيُغَيِّرُنَّ خَلْقَ ٱللَّهِ ۚ وَمَن يَتَّخِذِ ٱلشَّيْطَـٰنَ وَلِيًّۭا مِّن دُونِ ٱللَّهِ فَقَدْ خَسِرَ خُسْرَانًۭا مُّبِينًۭا",
    "urduTranslationText": "",
    "englishTranslationText": ". “And\t I\t will\t surely\t lead\t them\t astray,\t and\t I\t will\t certainly\t arouse\t desires\t in\t them,\t and\t I\t will\t\ndefinitely\torder\tthem\tso\tthey\twill\tpierce\tanimals’\tears,\tand\tI\twill\tdefinitely\torder\tthem\tso\tthey\t\nwill\t alter\t Allah’s\t creation”;\t and\t whoever\t chooses\t the\t devil\t for\t a\t friend\t instead\t of\t Allah,\t has\t\nindeed\tsuffered\ta\tmanifest\tloss.\t-\t",
    "romanUrduTranslationText": "Qasam\thai\tmaiñ\tzaroor\tunheiñ\tdikha\tduñga\taur\tzaroor\tunheiñ\tārzūyeiñ\tdilāuñ\tga\taur\tzaroor\t\nunheiñ\tkahuñ\tga\tke\twoh\tchaupāyoñ\tke\tkān\tcheereñge\taur\tzaroor\tunheiñ\tkahuñ\tga\tke\twoh\tAllah\t\nki\tpaida\t ki\thuwi\tcheezeiñ\tbadal\tdeñge\taur\tjo\tAllah\t ko\tchord\t kar\t shaitān\t ko\tdost\tbanāye\twoh\t\nsareeh\ttote\t(Khule\tNuqsān)\tmeiñ\tpadā"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "120",
    "arabicText": "يَعِدُهُمْ وَيُمَنِّيهِمْ ۖ وَمَا يَعِدُهُمُ ٱلشَّيْطَـٰنُ إِلَّا غُرُورًا",
    "urduTranslationText": "",
    "englishTranslationText": "The\t devil\t promises\t them\t and\t arouses\t desires\t in\t them;\t and\t the\t devil\t does\t not\t give\t them\t\npromises\texcept\tof\tdeceit\t",
    "romanUrduTranslationText": "Shaitān\t unheiñ\twa’āde\t deta\t hai\t aur\t ārzūyeiñ\t dilāta\t hai\t aur\t shaitān\t unheiñ\twa’āde nahi\t deta\t\nmagar\tfareb\tke."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "121",
    "arabicText": "أُو۟لَـٰٓئِكَ مَأْوَىٰهُمْ جَهَنَّمُ وَلَا يَجِدُونَ عَنْهَا مَحِيصًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "The\tdestination\tfor\tsuch\tis\thell;\tthey\twill\tnot\tfind\tany\trefuge\tfrom\tit.",
    "romanUrduTranslationText": "Unka\tthikāna\tdozakh\thai\tus\tse\tbachne\tki\tjagah\tna\tpāyeñ\tge."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "122",
    "arabicText": "وَٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ سَنُدْخِلُهُمْ جَنَّـٰتٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَآ أَبَدًۭا ۖ وَعْدَ ٱللَّهِ حَقًّۭا ۚ وَمَنْ أَصْدَقُ مِنَ ٱللَّهِ قِيلًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t those\t who\t believed\t and\t did\t good\t\ndeeds\t - We\t shall\t soon\t admit\t them\t into\t\nGardens\t beneath\t which\t rivers\t flow,\t\nabiding\tin\t them\t for\tever\tand\tever;\ta\t true\t\npromise\t from\t Allah;\t and\t whose\t Words\t\nare\tmore\t true\t than\t those\tof\tAllah?\t(Allah\ndoes\tnot\tlie.)\t",
    "romanUrduTranslationText": "Aur\t jo\t Imān\t lāye\t aur\t achche\t kām\t kiye\t\nkuch der\t jāti\t hai\t ke\t ham\t unheiñ\t bāghoñ\t\nmeiñ\t le\t jāyeñ\t ge\t jinke\t neeche\t nahreiñ\t\nbaheiñ\thamesha\thamesha\tun\tmeiñ\traheiñ\t\nAllah\t ka\t Sachcha\t Wa’āda aur\t Allah\t se\t\nziyāda\tkis\tki\tbāt\tSachchi?"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "123",
    "arabicText": "لَّيْسَ بِأَمَانِيِّكُمْ وَلَآ أَمَانِىِّ أَهْلِ ٱلْكِتَـٰبِ ۗ مَن يَعْمَلْ سُوٓءًۭا يُجْزَ بِهِۦ وَلَا يَجِدْ لَهُۥ مِن دُونِ ٱللَّهِ وَلِيًّۭا وَلَا نَصِيرًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "The\taffair\tdoes\tnot\trest\ton\tyour\tthoughts,\t\nnor\t the\t cravings\t of\t the\t People\t given\t the\t\nBook(s);\twhoever\tdoes\twrong\twill\tget\tthe\t\nrecompense\tof\tit\t- and\twill\tnot\tfind,\tother\t\nthan\tAllah,\tany\tfriend\tor\tany\tsupporter.",
    "romanUrduTranslationText": "Kām\t na\t kuch\t tumhāre\t khāyāloñ\t par\t hai\t\naur\tna\tKitāb\twāloñ\tki\thawas\tpar\tjo\tburāi\t\nkarega\t us\t ka\t badla\t pāyega\t aur\t Allah\t ke\t\nsiwa\t na\t koi\t apna\t himāyati\t pāyega\t na\t\nmadad-gār"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "124",
    "arabicText": "وَمَن يَعْمَلْ مِنَ ٱلصَّـٰلِحَـٰتِ مِن ذَكَرٍ أَوْ أُنثَىٰ وَهُوَ مُؤْمِنٌۭ فَأُو۟لَـٰٓئِكَ يَدْخُلُونَ ٱلْجَنَّةَ وَلَا يُظْلَمُونَ نَقِيرًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\twhoever\tdoes\tsome\tgood\tdeeds,\tbe\tit\t\na\tman\tor\twoman,\tand\tis\ta\tMuslim,\twill\tbe\t\nadmitted\tto\tParadise\tand\tthey\twill\tnot\tbe\t\nwronged\t even\t to\t the\t extent\t of\t one\t\nsesame",
    "romanUrduTranslationText": "Aur\tjo\tkuch\tbhale\tkām\tkarega\tmard\tho\tya\t\naurat\t aur\t ho\t Musalman\t to\t woh\t Jannat\t\nmeiñ\t dākhil\t kiye\t jāyeñ\t ge\t aur\t unheiñ\t til\t\nbhar\tnuqsān\tna\tdiya\tjāyega"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "125",
    "arabicText": "وَمَنْ أَحْسَنُ دِينًۭا مِّمَّنْ أَسْلَمَ وَجْهَهُۥ لِلَّهِ وَهُوَ مُحْسِنٌۭ وَٱتَّبَعَ مِلَّةَ إِبْرَٰهِيمَ حَنِيفًۭا ۗ وَٱتَّخَذَ ٱللَّهُ إِبْرَٰهِيمَ خَلِيلًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t whose\t religion\t is\t better\t than\t one\t\nwho\t submits\t his\t self\t to\t Allah and\t is\t\nvirtuous\t and\t follows\t the\t religion\t of\t\nIbrahim,\t who\t was\t far\t removed\t from\t all\t\nfalsehood?\t And\t Allah made\t Ibrahim\t His\t\nclose\tfriend",
    "romanUrduTranslationText": "Aur\t us\t se\t behtar\t kiska\t Deen\t jis\t ne\t apna\t\nmuñh\t Allah\t ke\t liye\t jhukā\t diya\t aur\t woh\t\nneki\t wāla\t hai\t aur\tIbrāheem ke\tDeen\t par\t\nchala\tjo\thar\tbātil\tse\tjuda\ttha\taur\tAllah\tne\t\nIbrāheem ko\tapna\tgehrā\tdost\tbanāya."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "126",
    "arabicText": "وَلِلَّهِ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۚ وَكَانَ ٱللَّهُ بِكُلِّ شَىْءٍۢ مُّحِيطًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t to\tAllah only\tbelongs\tall\twhatever\tis\t\nin\t the\t heavens\tand\tall\twhatever\tis\tin\t the\t\nearth;\t and\t Allah has\t control\t over\t all\t\nthings",
    "romanUrduTranslationText": "Aur\tAllah\thi\tka\thai\tjo\tkuch\tāsmānoñ\tmeiñ\t\nhai\t aur\t jo\t kuch\t zameen\t meiñ\t aur\t har\t\ncheez\tpar\tAllah\tka\tqābu\thai."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "127",
    "arabicText": "وَيَسْتَفْتُونَكَ فِى ٱلنِّسَآءِ ۖ قُلِ ٱللَّهُ يُفْتِيكُمْ فِيهِنَّ وَمَا يُتْلَىٰ عَلَيْكُمْ فِى ٱلْكِتَـٰبِ فِى يَتَـٰمَى ٱلنِّسَآءِ ٱلَّـٰتِى لَا تُؤْتُونَهُنَّ مَا كُتِبَ لَهُنَّ وَتَرْغَبُونَ أَن تَنكِحُوهُنَّ وَٱلْمُسْتَضْعَفِينَ مِنَ ٱلْوِلْدَٰنِ وَأَن تَقُومُوا۟ لِلْيَتَـٰمَىٰ بِٱلْقِسْطِ ۚ وَمَا تَفْعَلُوا۟ مِنْ خَيْرٍۢ فَإِنَّ ٱللَّهَ كَانَ بِهِۦ عَلِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\tthey\task\tyou\tthe\tdecree\tconcerning\twomen;\tsay,\t“Allah gives\tyou\ta\tdecree\tconcerning\tthem\t\n- and\twhat\tis\t recited\t to\t you\t from\t the\tQur’an\tconcerning\torphan\tgirls,\t that\t you\tare\tnot\tgiving\t\nthem\twhich\tis\t ordained\t for\t them,\t and\t you\t are\t avoiding\tmarrying\t them\t- and\t concerning\t the\t\nweak\t children,\tand\t that\t you\tmust\t firmly\testablish\tjustice\tin\t dealing\twith\t the\t orphans’\t rights;\t\nand\twhatever\tgood\tdeeds\tyou\tdo,\tthen\tAllah is\tWell\tAware\tof\tit.”\t",
    "romanUrduTranslationText": "Aur\ttum\tse\taurtoñ\tke\tbāre\tmeiñ\tfatwa\tpoochhte\thaiñ\ttum\tfarmādo\tke\tAllah\ttumheiñ\tunka\tfatwā\t\ndeta\thai\taur\twoh\tjo\t tum\tpar\tQur'ān\tmeiñ\tpadhā\tjāta\thai\tun\tyateem\tladkiyoñ\tke\tbāre\tmeiñ\tke\t\ntum\tunheiñ\tnahi\tdete\tjo\tun\tka\tmuqarrar\thai\taur\tunheiñ\tnikāh\tmeiñ\tbhi\tlāne\tse\tmuñh\tpherte\tho\t\naur\tkamzor\tbachchoñ\tke\tbāre\tmeiñ\taur\tyeh\tke\tyateemoñ\tke\thaq\tmeiñ\tinsāf\tpar\tqāim\traho\taur\t\ntum\tjo\tbhalāi\tkaro\tto\tAllah\tko\tuski\tkhabar\thai"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "128",
    "arabicText": "وَإِنِ ٱمْرَأَةٌ خَافَتْ مِنۢ بَعْلِهَا نُشُوزًا أَوْ إِعْرَاضًۭا فَلَا جُنَاحَ عَلَيْهِمَآ أَن يُصْلِحَا بَيْنَهُمَا صُلْحًۭا ۚ وَٱلصُّلْحُ خَيْرٌۭ ۗ وَأُحْضِرَتِ ٱلْأَنفُسُ ٱلشُّحَّ ۚ وَإِن تُحْسِنُوا۟ وَتَتَّقُوا۟ فَإِنَّ ٱللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t if\t a\t woman\t fears\t ill\t treatment\t from\t\nher\thusband\tor\tdisinterest,\tso\tit\tis\tno\tsin\t\nfor\t them\t if\t they\t reach\t an\t agreement\t of\t\npeace\t between\t themselves;\t and\t peace\t is\t\nbetter;\tand\t the\theart\tis\t trapped\tin\tgreed;\t\nand\t if\t you\t do\t good\t and\t practice\t piety,\t\nthen\tAllah is\tWell\tAware\tof\tit.\t\t",
    "romanUrduTranslationText": "Aur\t agar\t koi\t aurat\t apne\t shauhar\t ki\t\nziyādati\t ya\t be-raghbati\t ka\t andesha\t kare\t\nto\tun\tpar\tgunāh\tnahi\t ke\tāpas\tmeiñ\tsulāh\t\nkar\tleiñ\taur\tsulāh\tkhoob\thai\taur\tdil\tlālach\t\nke\t phande\t meiñ\t haiñ\t aur\t agar\t tum\t neki\t\naur\tparhez-gāri\tkaro\tto\tAllah\tko\ttumhāre\t\nkāmoñ\tki\tkhabar\thai"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "129",
    "arabicText": "وَلَن تَسْتَطِيعُوٓا۟ أَن تَعْدِلُوا۟ بَيْنَ ٱلنِّسَآءِ وَلَوْ حَرَصْتُمْ ۖ فَلَا تَمِيلُوا۟ كُلَّ ٱلْمَيْلِ فَتَذَرُوهَا كَٱلْمُعَلَّقَةِ ۚ وَإِن تُصْلِحُوا۟ وَتَتَّقُوا۟ فَإِنَّ ٱللَّهَ كَانَ غَفُورًۭا رَّحِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\tyou\twill\tnever\tbe\table\tto\tdeal\tequally\t\nbetween\twomen\thowever\tmuch\tyou\tmay\t\ndesire\t - therefore\t do\t not\t be\t totally\t\ninclined\t towards\tone\tleaving\t the\tother\tin\t\nuncertainty;\t and\t if\t you\t do\t good\t and\t\npractice\t piety,\t then\t (know\t that)\t Allah is\t\nOft\tForgiving,\tMost\tMerciful.\t",
    "romanUrduTranslationText": ". Aur\ttum\tse\thargiz\tna\tho\tsakega\tke\taurtoñ\t\nko\tbarābar\trakho\taur\tchāheiñ\tkitni\thi\thirs\t\nkaro\t to\t yeh\t to\t na\t ho\t ke\t ek\t taraf\t poora\t\njhuk\t jāo\t ke\t doosri\t ko\t adhar\t (Darmiyān)\t\nmeiñ\t latakti\t chord\t do\t aur\t agar\t tum\t neki\t\naur\t parhez-gāri\t karo\t to\t beshak\t Allah\t\nbakhsh\tne\twāla\tmaherbān\thai."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "130",
    "arabicText": "وَإِن يَتَفَرَّقَا يُغْنِ ٱللَّهُ كُلًّۭا مِّن سَعَتِهِۦ ۚ وَكَانَ ٱللَّهُ وَٰسِعًا حَكِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t if\t the\t two\t separate,\tAllah will\t make\t\neach\t one\t independent\t of\t the\t other,\t with\t\nHis\tCapability;\tand\tAllah is\tMost\tCapable,\t\nWise.\t",
    "romanUrduTranslationText": ". Aur\ttum\tse\thargiz\tna\tho\tsakega\tke\taurtoñ\t\nko\tbarābar\trakho\taur\tchāheiñ\tkitni\thi\thirs\t\nkaro\t to\t yeh\t to\t na\t ho\t ke\t ek\t taraf\t poora\t\njhuk\t jāo\t ke\t doosri\t ko\t adhar\t (Darmiyān)\t\nmeiñ\t latakti\t chord\t do\t aur\t agar\t tum\t neki\t\naur\t parhez-gāri\t karo\t to\t beshak\t Allah\t\nbakhsh\tne\twāla\tmaherbān\thai."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "130",
    "arabicText": "وَإِن يَتَفَرَّقَا يُغْنِ ٱللَّهُ كُلًّۭا مِّن سَعَتِهِۦ ۚ وَكَانَ ٱللَّهُ وَٰسِعًا حَكِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t if\t the\t two\t separate,\tAllah will\t make\t\neach\t one\t independent\t of\t the\t other,\t with\t\nHis\tCapability;\tand\tAllah is\tMost\tCapable,\t\nWise.",
    "romanUrduTranslationText": ". Aur\ttum\tse\thargiz\tna\tho\tsakega\tke\taurtoñ\t\nko\tbarābar\trakho\taur\tchāheiñ\tkitni\thi\thirs\t\nkaro\t to\t yeh\t to\t na\t ho\t ke\t ek\t taraf\t poora\t\njhuk\t jāo\t ke\t doosri\t ko\t adhar\t (Darmiyān)\t\nmeiñ\t latakti\t chord\t do\t aur\t agar\t tum\t neki\t\naur\t parhez-gāri\t karo\t to\t beshak\t Allah\t\nbakhsh\tne\twāla\tmaherbān\thai."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "131",
    "arabicText": "وَلِلَّهِ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۗ وَلَقَدْ وَصَّيْنَا ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَـٰبَ مِن قَبْلِكُمْ وَإِيَّاكُمْ أَنِ ٱتَّقُوا۟ ٱللَّهَ ۚ وَإِن تَكْفُرُوا۟ فَإِنَّ لِلَّهِ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۚ وَكَانَ ٱللَّهُ غَنِيًّا حَمِيدًۭا",
    "urduTranslationText": "",
    "englishTranslationText": ". And\t to\tAllah only\tbelongs\tall\twhatever\tis\t\nin\t the\t heavens\tand\tall\twhatever\tis\tin\t the\t\nearth;\t and indeed\t We\t have\t commanded\t\nthose\twho\treceived\tthe\tBooks\tbefore\tyou,\t\nand\t commanded\t you,\t that\t keep\t fearing\t\nAllah;\t and\tif\t you\t disbelieve,\t undoubtedly\t\nto\t Allah only\t belongs\t all\t whatever\t is\t in\t\nthe\t heavens\t and\t all\t whatever\t is\t in\t the\t\nearth;\t and\t Allah is\t Independent,\t Worthy\t\nOf\tAll\tPraise.\t",
    "romanUrduTranslationText": "Aur\tAllah\thi\tka\thai\tjo\tkuch\tāsmānoñ\tmeiñ\t\nhai\taur\tjo\tkuchh\tzameen\tmeiñ\taur\tbeshak\t\ntākeed\tfarmā\tdi\thai\tham\tne\tunse\tjo\ttum\tse\t\npahle\tkitāb\tdiye\tgaye\taur\ttum\tko\tke\tAllah\t\nse\tdarte\traho\taur\tagar\tkufr\tkaro\tto\tbeshak\tAllah\thi\tka\thai\tjo\tkuch\tāsmānoñ\tmeiñ\thai\taur\tjo\tkuch\t\nzameen\tmeiñ\taur\tAllah\tbe-niyāz\thai\tsab\tkhoobiyoñ\twāla"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "132",
    "arabicText": "وَلِلَّهِ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۚ وَكَفَىٰ بِٱللَّهِ وَكِيلًا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t to\tAllah only\tbelongs\tall\twhatever\tis\tin\t the\theavens\tand\tall\twhatever\tis\tin\t the\tearth;\tand\t\nAllah is\tSufficient\tas\ta\tTrustee\t(of\taffairs).\t",
    "romanUrduTranslationText": "Aur\tAllah\thi\tka\thai\tjo\tkuch\tāsmānoñ\tmeiñ\thai\taur\tjo\tkuch\tzameen\tmeiñ\taur\tAllah\tkāfi\thai\tkār\u0002sāz\t(Kām\tBanāne\tWāla)."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "133",
    "arabicText": "إِن يَشَأْ يُذْهِبْكُمْ أَيُّهَا ٱلنَّاسُ وَيَأْتِ بِـَٔاخَرِينَ ۚ وَكَانَ ٱللَّهُ عَلَىٰ ذَٰلِكَ قَدِيرًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "O\tpeople!\tHe\tcan\tremove\tyou\tand\tbring\tothers,\tif\tHe\twills;\tand\tAllah is\tAble\tto\tdo\tthat.\t\t",
    "romanUrduTranslationText": "Aey\tlogoñ\twoh\tchāhe\tto\ttumheiñ\tle\tjāye\taur\tauroñ\tko\tle\tāye\taur\tAllah\tko\tiski\tqudrat\thai"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "134",
    "arabicText": "مَّن كَانَ يُرِيدُ ثَوَابَ ٱلدُّنْيَا فَعِندَ ٱللَّهِ ثَوَابُ ٱلدُّنْيَا وَٱلْـَٔاخِرَةِ ۚ وَكَانَ ٱللَّهُ سَمِيعًۢا بَصِيرًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "Whoever\tdesires\t the\treward\tof\t this\tworld,\t then\twith\tAllah only\tlie\tboth\t- the\trewards\tof\t this\t\nworld\tand\tof\tthe\tHereafter;\tand\tAllah is\tAll\tHearing,\tAll\tSeeing.\t",
    "romanUrduTranslationText": "Jo\tDuniya\tka\tin‘ām\tchāhe\t to\tAllah\thi\tke\tpās\tduniya-o-Ākhirat\tdonoñ\tka\tin‘ām\thai\taur\tAllah\thi\t\nsunta\tdekhta\thai"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "135",
    "arabicText": "۞ يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ كُونُوا۟ قَوَّٰمِينَ بِٱلْقِسْطِ شُهَدَآءَ لِلَّهِ وَلَوْ عَلَىٰٓ أَنفُسِكُمْ أَوِ ٱلْوَٰلِدَيْنِ وَٱلْأَقْرَبِينَ ۚ إِن يَكُنْ غَنِيًّا أَوْ فَقِيرًۭا فَٱللَّهُ أَوْلَىٰ بِهِمَا ۖ فَلَا تَتَّبِعُوا۟ ٱلْهَوَىٰٓ أَن تَعْدِلُوا۟ ۚ وَإِن تَلْوُۥٓا۟ أَوْ تُعْرِضُوا۟ فَإِنَّ ٱللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًۭا",
    "urduTranslationText": "",
    "englishTranslationText": ". O\t People\t who\t Believe!\t Be\t firm\t in\t\nestablishing\t justice,\t giving\t witness\t for\t\nAllah,\teven\tif\tit\tis\tharmful\tto\tyourselves\tor\t\nparents\tor\trelatives;\twhether\tthe\tone\tyou\t\ntestify\t against\t is\t wealthy\t or\t poor,\t for\t in\t\nany\t case\tAllah has\t the\tgreater\t right\t over\t\nit;\tthen\tdo\tnot\tfollow\tyour\twishes\tfor\tyou\t\nmay\t stray\t from\t the\t truth;\t and\t if\t you\t\ndistort\ttestimony\tor\tturn\taway,\tthen\tAllah\nis\tWell\tAware\tof\tyour\tdeeds.\t",
    "romanUrduTranslationText": "Aey\t Imān\twālo!\tInsāf\t par\t khoob\tqāim\t ho\t\njāo\t Allah\t ke\t liye\t gawāhi\t dete\t chāhe\t is\t\nmeiñ\ttumhāra\tapna\tnuqsān\tho\tya\tmā\tbāp\t\nka\tya\trisht-e-dāroñ\tjis\tpar\tgawāhi\tdo\twoh\t\nghani\t ho\t ya\t faqeer\t ho\t baher\t hāl\tAllah\t ko\t\niska\t sab\t se\t ziyāda\t ikhtiyār\t hai\t to\t\nkhuwahish\t ke\t peeche\t na\t jāo\t ke\t haq\t se\t\nalag\tpado\taur\tagar\t tum\ther-pher\t karo\t ya\t\nmooñh\tphero\tto\tAllah\tko\ttumhāre\tkāmoñ\t\nki\tkhabar\thai"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "136",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ ءَامِنُوا۟ بِٱللَّهِ وَرَسُولِهِۦ وَٱلْكِتَـٰبِ ٱلَّذِى نَزَّلَ عَلَىٰ رَسُولِهِۦ وَٱلْكِتَـٰبِ ٱلَّذِىٓ أَنزَلَ مِن قَبْلُ ۚ وَمَن يَكْفُرْ بِٱللَّهِ وَمَلَـٰٓئِكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ وَٱلْيَوْمِ ٱلْـَٔاخِرِ فَقَدْ ضَلَّ ضَلَـٰلًۢا بَعِيدًا",
    "urduTranslationText": "",
    "englishTranslationText": "O\tPeople\twho\tBelieve!\tHave\tfaith\tin\tAllah\nand\tHis\tNoble\tMessenger\tand\tthe\tBook\tHe\t\nhas\tsent\tdown\tupon\tthis\tNoble\tMessenger\t\nof\tHis,\tand\tthe\tBook\tHe\tsent\tdown\tbefore;\t\nand\t whoever\t does\t not\t accept\t faith\t in\t\nAllah and\t His\t angels\t and\t His\t Books\t and\t\nHis\t Noble\t Messengers\t and\t the\t Last\t Day,\t\nhas\tundoubtedly\twandered\tfar\tastray\t",
    "romanUrduTranslationText": "Aey\t Imān\t wālo!\t Imān\t rakho\t Allah\t aur\t\nAllah\t ke\t Rasool\t par\t aur\t us\t kitāb\t par\t jo\t\napne\tun\tRasool\tpar\tutāri\taur\tus\tkitāb\tpar\t\njo\t pahle\t utāri\t aur\t jo\t na\t māne\t Allah\t aur\t\nuske\t Farishtoñ\t aur\t kitāboñ\t aur\t Rasooloñ\t\naur\t Qayāmat\t ko\t to\t woh\t zaroor\t door\t ki\t\ngumrāhi\tmeiñ\tpadā."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "137",
    "arabicText": "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ ثُمَّ كَفَرُوا۟ ثُمَّ ءَامَنُوا۟ ثُمَّ كَفَرُوا۟ ثُمَّ ٱزْدَادُوا۟ كُفْرًۭا لَّمْ يَكُنِ ٱللَّهُ لِيَغْفِرَ لَهُمْ وَلَا لِيَهْدِيَهُمْ سَبِيلًۢا",
    "urduTranslationText": "",
    "englishTranslationText": "Indeed\tthose\twho\tbelieve,\tthen\tdisbelieve\t\nand\t then\t again\t believe,\t then\t again\t\ndisbelieve,\t and\t go\t further\t in\t their\t\ndisbelief\t - Allah will\t never\t forgive\t them,\t\nnor\tever\tguide\tthem\tto\tthe\tpath.\t\t",
    "romanUrduTranslationText": "Beshak\t woh\t log\t jo\t Imān\t lāye\t phir\t kāfir\t\nhuwe\tphir\tImān\tlāye\tphir\tkāfir\thuwe\tphir\t\naur\t kufr\t meiñ\t badhe\t Allah\t hargiz\t Na\t\nunheiñ\tbakhshe\tna\tunheiñ\trāh\tdikhāye."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "138",
    "arabicText": "بَشِّرِ ٱلْمُنَـٰفِقِينَ بِأَنَّ لَهُمْ عَذَابًا أَلِيمًا",
    "urduTranslationText": "",
    "englishTranslationText": "Give\t glad\t tidings\t to\t the\t hypocrites,\t that\t\nfor\tthem\tis\ta\tpainful\tpunishment.\t\t\t",
    "romanUrduTranslationText": "Khush\t khabri\t do\t munāfiqoñ\t ko ke\t un\t ke\t\nliye\tdard-nāk\t‘azāb\thai."
  }
]