[
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "121",
    "arabicText": "وَلَا يُنفِقُونَ نَفَقَةًۭ صَغِيرَةًۭ وَلَا كَبِيرَةًۭ وَلَا يَقْطَعُونَ وَادِيًا إِلَّا كُتِبَ لَهُمْ لِيَجْزِيَهُمُ ٱللَّهُ أَحْسَنَ مَا كَانُوا۟ يَعْمَلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\twhatever\t they\tspend,\tsmall\tor\tgreat,\t\nor\tany\tvalley\tthey\tcross\t- it\tis\tall\trecorded\t\nfor\tthem,\tso\tthat\tAllah may\treward\tthem\tfor\ttheir\tbest\tdeeds.\t",
    "romanUrduTranslationText": ". Aur\tjo\tkuch\tkharch\tkarte\thaiñ\tchotā\tya\tbadā\taur\tjo\tnālā\ttay\tkarte\thaiñ\tSab\tunke\tliye\tlikhā\tjāta\t\nhai\ttāke\tAllāh\tun\tke\tsab\tse\tbehtar\tkamoñ\tka\tunheiñ\tsila\tde"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "122",
    "arabicText": "۞ وَمَا كَانَ ٱلْمُؤْمِنُونَ لِيَنفِرُوا۟ كَآفَّةًۭ ۚ فَلَوْلَا نَفَرَ مِن كُلِّ فِرْقَةٍۢ مِّنْهُمْ طَآئِفَةٌۭ لِّيَتَفَقَّهُوا۟ فِى ٱلدِّينِ وَلِيُنذِرُوا۟ قَوْمَهُمْ إِذَا رَجَعُوٓا۟ إِلَيْهِمْ لَعَلَّهُمْ يَحْذَرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tit\tis\tnot\tpossible\tfor\tthe\tMuslims\tthat\tall\tof\tthem\tgo\tout;\tso\tit\tshould\tbe\tthat\ta\tparty\tfrom\t\neach\t group\t goes\t forth\tin\t order\t to\t gain\t knowledge\tin\t religion,\t and\t upon\t returning\t they\twarn\t\ntheir\tpeople\tin\tthe\thope\tthat\tthey\tmay\tavoid.",
    "romanUrduTranslationText": "Aur\tMusalmānon\tse\tye\t to\tho\tnahiñ\tsaktā\tke\tsab\tke\tsab\tnikleiñ\t to\tkyuñ\tna\thuwa\tke\tun\tke\thar\t\ngiroh\tmeiñ\tse\tek\tjamā’at\tnikle\tke\tdeen\tki\tsamajh\thāsil\tkareiñ\taur\twāpas\tākar\tapni\tqaum\tko\tDar\t\nsunāyeiñ\tis\tummid\tpar\tke\twoh\tbacheiñ"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "123",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ قَـٰتِلُوا۟ ٱلَّذِينَ يَلُونَكُم مِّنَ ٱلْكُفَّارِ وَلْيَجِدُوا۟ فِيكُمْ غِلْظَةًۭ ۚ وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ مَعَ ٱلْمُتَّقِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "O\t People\t who\t Believe\t - fight\t the\t\ndisbelievers\twho\tare\tnear\t to\t you,\tand\tlet\t\nthem\t find\tseverity\tin\t you,\tand\tknow\twell\t\nthat\tAllah is\twith\tthe\tpious.\t",
    "romanUrduTranslationText": "Aye\tImān\twālo!\tjihād\tkaro\tun\tkāfiroñ\tse\tjo\t\ntumhāre\t qarib\t haiñ\t aur\t chahiye\t ki\t woh\t\ntum\tmeiñ\t sakhti\t payeiñ\taur\tjān\t rakho\t ke\t\nAllāh\tparhez-gāroñ\tke\tsath\thai."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "124",
    "arabicText": "وَإِذَا مَآ أُنزِلَتْ سُورَةٌۭ فَمِنْهُم مَّن يَقُولُ أَيُّكُمْ زَادَتْهُ هَـٰذِهِۦٓ إِيمَـٰنًۭا ۚ فَأَمَّا ٱلَّذِينَ ءَامَنُوا۟ فَزَادَتْهُمْ إِيمَـٰنًۭا وَهُمْ يَسْتَبْشِرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t whenever\t a\t chapter\t is\t sent\t down,\t\nsome\t of\t them\t say,\t “Whose\t faith\t among\t\nyou\t has\t this\t promoted?”\t So\t it\t has\t\npromoted\t the\t faith\t of\t the\t believers\t and\t\nthey\tare\trejoicing!\t\t",
    "romanUrduTranslationText": "And\t Aur\t jab\t koi\t soorat\t utarti\t hai\t to\t un\t\nmeiñ\t koi\t kahne\t lagtā\t hai\t ke\t us\t ne\t tum\t\nmeiñ\tkis\tke\t Imān\tko\t taraqqi\tdi\t to\twoh\tjo\t\nImān\t wale\t heiñ\t un\t ke\t Imān\t ko\t us\t ne\t\ntaraqqi\tdi\taur\twoh\t khushiyāñ\tmanā\t rahe\nhaiñ"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "125",
    "arabicText": "وَأَمَّا ٱلَّذِينَ فِى قُلُوبِهِم مَّرَضٌۭ فَزَادَتْهُمْ رِجْسًا إِلَىٰ رِجْسِهِمْ وَمَاتُوا۟ وَهُمْ كَـٰفِرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tfor\tthose\tin\twhose\thearts\tis\ta\tdisease,\t\nit\t has\t added\t filth\t to\t their\t filth,\t and\t they\t\ndied\tas\tdisbelievers.",
    "romanUrduTranslationText": "Aur\t jin\t ke\t diloñ\t meiñ\t āzār\t (bimāri)\t hai\t\nunheiñ\t aur\t palidi\t par\t palidi\t badhāi\t aur\t\nkufr\thi\tpar\tmar\tgaye"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "126",
    "arabicText": "أَوَلَا يَرَوْنَ أَنَّهُمْ يُفْتَنُونَ فِى كُلِّ عَامٍۢ مَّرَّةً أَوْ مَرَّتَيْنِ ثُمَّ لَا يَتُوبُونَ وَلَا هُمْ يَذَّكَّرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Do\t they\t not\t observe\t that\t they\t are\t tested\t\nonce\tor\ttwice\tevery\tyear?\tYet\tthey\tdo\tnot\t\nrepent,\tnor\tdo\tthey\theed\tadvice!\t",
    "romanUrduTranslationText": ". Kyā\t unheiñ\t nahi\t soojhtā\t ke\t har\t sāl\tek\t yā\t\ndo\tbār\tāzmāye jāte\thaiñ\tphir\tna\t to\t taubā\t\nkarte\thaiñ\taur\tna\tnasihat\tmānte\thaiñ"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "127",
    "arabicText": "وَإِذَا مَآ أُنزِلَتْ سُورَةٌۭ نَّظَرَ بَعْضُهُمْ إِلَىٰ بَعْضٍ هَلْ يَرَىٰكُم مِّنْ أَحَدٍۢ ثُمَّ ٱنصَرَفُوا۟ ۚ صَرَفَ ٱللَّهُ قُلُوبَهُم بِأَنَّهُمْ قَوْمٌۭ لَّا يَفْقَهُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\twhenever\ta\tchapter\tis\tsent\tdown,\tone\t\nof\t them\t looks\t at\t the\t other;\t “Is\t there\t\nsomeone\t watching\t you?”\t- and\t then\t they\t\nturn\taway;\tAllah has\tinverted\ttheir\thearts\t\nbecause\t they\t are\t a\t people\t who\t do\t not\t\nunderstand.\t",
    "romanUrduTranslationText": "Aur\tjab\t koi\t soorat\tutarti\t hai\t un\tmeiñ\t ek\t doosre\t ko\t dekhne\tlagtā\t hai\t ke\t koi\t tumhe\t dekhtā\t to\t\nnahiñ\tphir\tpalat\tjāte\thaiñ\tAllāh\tne\tunke\tdil\tpalat\tdiye\tke\twoh\tnā\tsamajh\tlog\thaiñ."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "128",
    "arabicText": "لَقَدْ جَآءَكُمْ رَسُولٌۭ مِّنْ أَنفُسِكُمْ عَزِيزٌ عَلَيْهِ مَا عَنِتُّمْ حَرِيصٌ عَلَيْكُم بِٱلْمُؤْمِنِينَ رَءُوفٌۭ رَّحِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "Indeed\t there\t has\t come\t to\t you\t a\t Noble\t\nMessenger\t from\tamong\tyou\t- your\t falling\t\ninto\t hardship\t aggrieves\t him,\t most\t concerned\t for\t your\t well\t being,\t for\t the\t Muslims\t most\t\ncompassionate,\tmost\tmerciful.",
    "romanUrduTranslationText": ". Beshak\t tumhāre\t pās\t tashrif\t laye\t tum\t meiñ\t se\t woh\t Rasool\t jin\t par\t tumhārā\t mashaqqat\t meiñ\t\npadnā\t girāñ\t hai,\t tumhāri\t bhalāi\t ke\t nihāyat\t chāhne\t wale\t musalmānoñ\t par\t kamāl\t meharbān\t\nmeharbān"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "129",
    "arabicText": "فَإِن تَوَلَّوْا۟ فَقُلْ حَسْبِىَ ٱللَّهُ لَآ إِلَـٰهَ إِلَّا هُوَ ۖ عَلَيْهِ تَوَكَّلْتُ ۖ وَهُوَ رَبُّ ٱلْعَرْشِ ٱلْعَظِيمِ",
    "urduTranslationText": "",
    "englishTranslationText": "Then\t if\t they\t turn\t away,\t say\t(O\t dear\t Prophet\tMuhammad - peace\t and\t blessings\t be\t upon\t him),\t\n“Allah suffices\tme;\tthere\tis\tno\tworship\texcept\t for\tHim;\tonly\tHim\thave\t I\ttrusted,\tand\tHe\tis\tthe\t\nLord\tOf\tThe\tGreat\tThrone.”\t",
    "romanUrduTranslationText": "Phir\tagar\twoh\tmuñh\tphereiñ\tto\ttum\tfarmā\tdo\tke\tmujhe\tAllāh\tkāfi\thai\tus\tke\tsiwā\tkisi\tki\tbandagi\t\nnahiñ\tmaiñ\tne\tusi\tpar\tbharosa\tkiyā\taur\twoh\tbade\t‘arsh\tkā\tmālik\thai."
  }
]