[
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "49",
    "arabicText": "وَإِذْ نَجَّيْنَـٰكُم مِّنْ ءَالِ فِرْعَوْنَ يَسُومُونَكُمْ سُوٓءَ ٱلْعَذَابِ يُذَبِّحُونَ أَبْنَآءَكُمْ وَيَسْتَحْيُونَ نِسَآءَكُمْ ۚ وَفِى ذَٰلِكُم بَلَآءٌۭ مِّن رَّبِّكُمْ عَظِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": ". (And\t remember)\t When\t We\t rescued\t you\t\nfrom\t Firaun’s\t people,\t for\t they\t were\t\ninflicting\t you\t with\t a\t dreadful\t torment,\t\nslaying\t your\t sons\t and\t sparing\t your\t\ndaughters;\t that\t was\t a\t tremendous\t trial\t\nfrom\tyour\tLord\t(or\ta\tgreat\treward).\t",
    "romanUrduTranslationText": "Aur\t yād\t karo\t jab\t ham\t ne\t tum\t ko\t fir'aun\t\nwālon\t se\t najāt\t bakhshi\t ke\t tum\t per\t bura\t\n‘azāb\t karte\t they\t tumhāre\t betoñ\t ko\t zibah\t\nkarte\taur\ttumhari\tbetiyoñ\tko\tzinda\trakhte\t\naur\t us\tmeiñ\t tumhāre\t rab\t ki\t taraf\t se\t badi\t\nbalā\tthi\tya\tbadā\tin‘ām"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "50",
    "arabicText": "وَإِذْ فَرَقْنَا بِكُمُ ٱلْبَحْرَ فَأَنجَيْنَـٰكُمْ وَأَغْرَقْنَآ ءَالَ فِرْعَوْنَ وَأَنتُمْ تَنظُرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". And\t when\t We\t split\t the\t sea\t for\t you\t\nthereby\t rescuing\t you,\t and\t drowned\t the\t\nFiraun's\tpeople\tin\tfront\tof\tyour\teyes.\t",
    "romanUrduTranslationText": "Aur\tjab\tHum\tne\ttumhāre\tliye\tdarya\tphārd\t\ndiya\t to\t tumheiñ\t bacha\t liya\t aur\t fir'aun\t\nwālon\tko\ttumhāri\tāñkhoñ\tke\tsāmne\tdubo\t\ndiya"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "51",
    "arabicText": "وَإِذْ وَٰعَدْنَا مُوسَىٰٓ أَرْبَعِينَ لَيْلَةًۭ ثُمَّ ٱتَّخَذْتُمُ ٱلْعِجْلَ مِنۢ بَعْدِهِۦ وَأَنتُمْ ظَـٰلِمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". And\t when\t We\t made\t a\t commitment\t with\t\nMoosa\t (Moses)\t for\t forty\t nights\t - then\t\nbehind\t him\t you\t started\t worshipping\t the\t\ncalf,\tand\tyou\twere\tunjust.\t",
    "romanUrduTranslationText": "Aur\t jab\t ham\t ne\t Mūsā se\t chālees\t rāt\t ka\t\nw'ada\t farmaya\tphir\tuske\tpeechhe\t tum\tne\t\nbachrde\t ki\t pooja\t shuru\t kardi\t aur\t tum\t\nzālim\tthey\t"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "52",
    "arabicText": "ثُمَّ عَفَوْنَا عَنكُم مِّنۢ بَعْدِ ذَٰلِكَ لَعَلَّكُمْ تَشْكُرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Then\tafter\t that\tWe\tpardoned\t you\tso\t that\t\nyou\tmay\tbe\tgrateful.",
    "romanUrduTranslationText": "Phir\t iske\t b‘ād\t ham\t tumheiñ\t māfi\t di\t ke\t\nkahiñ tum\tehsān\tmāno"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "53",
    "arabicText": "وَإِذْ ءَاتَيْنَا مُوسَى ٱلْكِتَـٰبَ وَٱلْفُرْقَانَ لَعَلَّكُمْ تَهْتَدُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t when\t We\t gave\t Moosa\t the\t Book\t\n(Taurat\t /\t Torah)\t and\t the\t criterion\t to\t\njudge\t right\t from\t wrong,\t so\t that\t you\tmay\t\nattain\tguidance",
    "romanUrduTranslationText": "Aur\tjab\t ham\t ne\tMūsā ko\tKitāb\tata\t ki\taur\t\nhaq-o-bātil\tme\t tameez\t kar\tdena\t ke\t kahiñ\ntum\trāh\tper\tāao."
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "54",
    "arabicText": "وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِۦ يَـٰقَوْمِ إِنَّكُمْ ظَلَمْتُمْ أَنفُسَكُم بِٱتِّخَاذِكُمُ ٱلْعِجْلَ فَتُوبُوٓا۟ إِلَىٰ بَارِئِكُمْ فَٱقْتُلُوٓا۟ أَنفُسَكُمْ ذَٰلِكُمْ خَيْرٌۭ لَّكُمْ عِندَ بَارِئِكُمْ فَتَابَ عَلَيْكُمْ ۚ إِنَّهُۥ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
    "urduTranslationText": "",
    "englishTranslationText": "And\twhen\tMoosa\tsaid\tto\this\tpeople,\t“O\tmy\t\npeople!\t You\t have\twronged\t yourselves\t by\t\ntaking\t the\t calf,*\t therefore\t turn\t in\t\nrepentance\t to\tyour\tCreator,\t therefore\tkill\t\neach\t other;\t this\t is\t better\t for\t you\t before\t\nyour\tCreator”;\tHe\ttherefore\taccepted\tyour\t\nrepentance;\t indeed\t He\t only\t is\t the\t Most\t\nAcceptor\t of\t Repentance,\t the\t Most\t\nMerciful.\t(*\tas\tyour\tdeity\tfor\tworship)",
    "romanUrduTranslationText": "Aur\t jab\t Mūsā ne\t apni\t qaum\t se\t kaha\t aey\t\nmeri\t qaum!\t Tum\t ne\t bachrda\t bana\t kar\t\napni\t jānoñn\t per\t zulm\t kiya\t to\t apne\t paida\t\nkarne\twāle\tki\ttaraf\truju'\tlao\tto\tāpas\tmeiñ\t\nek\tdoosre\tko\tqatl\tkaro\tyeh\ttumhāre\tpaida\t\nkarne\t wāle\t ke\t nazdeek\t tumhare\t liye\t\nbehtar hai\t usne\t tumhāri\t tauba\t qabool\t ki\t\nbeshak\t wohi\t hai\t bahot\t tauba\t qabool\t\nkarne\twāla\tmaherbān"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "55",
    "arabicText": "وَإِذْ قُلْتُمْ يَـٰمُوسَىٰ لَن نُّؤْمِنَ لَكَ حَتَّىٰ نَرَى ٱللَّهَ جَهْرَةًۭ فَأَخَذَتْكُمُ ٱلصَّـٰعِقَةُ وَأَنتُمْ تَنظُرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\twhen\tyou\tsaid\t“O\tMoosa!\tWe\twill\tnot\tbelieve\tyou\ttill\twe\tclearly\tsee\tAllah”;\tso\tthe\tthunder\t\nseized\tyou\twhile\tyou\twere\twatching.",
    "romanUrduTranslationText": "Aur\tjab\ttum\tne\tkaha\taey\tMūsā!\tHum\thargiz\ttumhāra\tyaqeen\tna\tlāyeñge\tjab\ttak\ta'lāniya\tKhuda\t\nko\tna\tdekh\tleiñ to\ttumheiñ\tkadak\tne\tāa\tliya\taur\ttum\tdekh\trahe\tthey.\t"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "56",
    "arabicText": "ثُمَّ بَعَثْنَـٰكُم مِّنۢ بَعْدِ مَوْتِكُمْ لَعَلَّكُمْ تَشْكُرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Then\tWe\tbrought\tyou\tback\tto\tlife\tafter\tyour\tdeath,\tso\tthat\tyou\tmay\tbe\tgrateful",
    "romanUrduTranslationText": "Phir\tmare\tpeeche\tHam\tne\ttumheiñ\tzinda\tkiya\tke\tkahin\ttum\tehsān\tmāno."
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "57",
    "arabicText": "وَظَلَّلْنَا عَلَيْكُمُ ٱلْغَمَامَ وَأَنزَلْنَا عَلَيْكُمُ ٱلْمَنَّ وَٱلسَّلْوَىٰ ۖ كُلُوا۟ مِن طَيِّبَـٰتِ مَا رَزَقْنَـٰكُمْ ۖ وَمَا ظَلَمُونَا وَلَـٰكِن كَانُوٓا۟ أَنفُسَهُمْ يَظْلِمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": " And\tWe\tmade\tthe\tclouds\ta\tcanopy\tfor\tyou\tand\tsent\tdown\tManna\tand\tSalwa\t(birds)\ton\tyou;\t“Eat\t\nof\tthe\tpure\tthings\tWe\thave\tprovided you”;\tthey\tdid\tnot\twrong\tUs\tin\tthe\tleast,\tbut\tindeed\tthey\t\nwronged\tthemselves",
    "romanUrduTranslationText": "Aur\tHam\tne\tabr\t ko\t tumhāra\t sāye\t bān\t kiya\taur\t tum\tper\tMań aur\tSalwa utāra\t khāo\thamāri\tdi\t\nhuyi\tsuthri\tcheezeiñ\taur\tunhoñ\tne\t kuch\thamāra\tna\tbighāda hāñ\tapni\thi\tjānoñ\t ka\tbigād\t karte\t\nthey"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "58",
    "arabicText": "وَإِذْ قُلْنَا ٱدْخُلُوا۟ هَـٰذِهِ ٱلْقَرْيَةَ فَكُلُوا۟ مِنْهَا حَيْثُ شِئْتُمْ رَغَدًۭا وَٱدْخُلُوا۟ ٱلْبَابَ سُجَّدًۭا وَقُولُوا۟ حِطَّةٌۭ نَّغْفِرْ لَكُمْ خَطَـٰيَـٰكُمْ ۚ وَسَنَزِيدُ ٱلْمُحْسِنِينَ",
    "urduTranslationText": "",
    "englishTranslationText": " . And\twhen\tWe\t said,\t “Enter\t this\t town\t and\t\neat\tfreely\tfrom\twhat\tis\tin\tit,\tand\tenter\tthe\t\ngate\twhilst\tprostrating,\tand\tsay,\t‘May\tour\t\nsins\t be\t forgiven’\t - We\t will\t forgive\t you\t\nyour\t sins;\t and\tWe\twill\t soon\tincrease\t the\t\nreward\tfor\tthe\trighteous.”",
    "romanUrduTranslationText": "Aur\t jab\tHam\t ne\t farmaya\t us\t basti\t me\t jāo\t\nphir\t us\t meiñ\t jahān\t chāhoñ\t be\t rok-tok\t\nkhāo\taur\tdarwāze\tme\tsajdah\tkarte\tdakhil\t\nho\t aur\t kaho\t hamāre\t gunah\t mu'af\t hoñ\t\nhum\ttumhāri\tkhatāyeiñ\tbakhsh\tdeñge\taur\t\nqareeb\t hai\t ke\t neki\t wāloñ\t ko\t aur\t ziyada\t\ndeñ"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "59",
    "arabicText": "فَبَدَّلَ ٱلَّذِينَ ظَلَمُوا۟ قَوْلًا غَيْرَ ٱلَّذِى قِيلَ لَهُمْ فَأَنزَلْنَا عَلَى ٱلَّذِينَ ظَلَمُوا۟ رِجْزًۭا مِّنَ ٱلسَّمَآءِ بِمَا كَانُوا۟ يَفْسُقُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". But\tthe\tunjust\tchanged\tthe\tword\tthat\thad\t\nbeen\tordered\tfor\tanother\tone,\tso\tWe\tsent\t\ndown\t a\t punishment\t on\t them\t from\t the\t\nskies,\t the\t recompense\t of\t their\t\ndisobedience.",
    "romanUrduTranslationText": ". To\tzālimoñ\tne\taur\tbāt\tbadal\tdi\tjo\tfarmāyi\t\ngyi\tthi\tuske\tsiwa\tto\tham\tne\tāasman\tse\tun\t\npar\t‘azāb\tutāra\tbadla\tunki\tbe-hukmi\tka\t"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "60",
    "arabicText": " وَإِذِ ٱسْتَسْقَىٰ مُوسَىٰ لِقَوْمِهِۦ فَقُلْنَا ٱضْرِب بِّعَصَاكَ ٱلْحَجَرَ ۖ فَٱنفَجَرَتْ مِنْهُ ٱثْنَتَا عَشْرَةَ عَيْنًۭا ۖ قَدْ عَلِمَ كُلُّ أُنَاسٍۢ مَّشْرَبَهُمْ ۖ كُلُوا۟ وَٱشْرَبُوا۟ مِن رِّزْقِ ٱللَّهِ وَلَا تَعْثَوْا۟ فِى ٱلْأَرْضِ مُفْسِدِينَ",
    "urduTranslationText": "",
    "englishTranslationText": ". And\twhen\tMoosa\tasked\t for\twater\t for\t his\t\npeople,\t We\t said,\t “Strike\t this\t rock\t with\t\nyour\t staff”;\t thereupon\t twelve\t springs\t\ngushed\t forth\t from\t it;\t each\t group\t\nrecognised\t its\t drinking-place;\t “Eat\t and\t\ndrink\t from\t what\tAllah has\t provided,\t and\t\ndo\t not\t roam\t about\t the\t earth\t making\t\nturmoil\tin\tit.\n",
    "romanUrduTranslationText": "Aur\t jab\t Mūsā ne\t apni\t qaum\t ke\t liye\t pāni\t\nmāñga\t to\tham\tne\t farmāya us\tpatthar\tper\t\napna\t ‘asā\t māro\t fauran\t us\t meiñ\t se\t bārah\t\nchashme\tbah\tnikle\thar\tgiroh\tne\tapna\tghāt\t\npehchān\tliya\tkhāo\taur\tpiyo\tKhuda\tka\tdiya\t\naur\tzameen\tmeiñ\tfasād\tuthāte\tna\tphir"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "61",
    "arabicText": "وَإِذْ قُلْتُمْ يَـٰمُوسَىٰ لَن نَّصْبِرَ عَلَىٰ طَعَامٍۢ وَٰحِدٍۢ فَٱدْعُ لَنَا رَبَّكَ يُخْرِجْ لَنَا مِمَّا تُنۢبِتُ ٱلْأَرْضُ مِنۢ بَقْلِهَا وَقِثَّآئِهَا وَفُومِهَا وَعَدَسِهَا وَبَصَلِهَا ۖ قَالَ أَتَسْتَبْدِلُونَ ٱلَّذِى هُوَ أَدْنَىٰ بِٱلَّذِى هُوَ خَيْرٌ ۚ ٱهْبِطُوا۟ مِصْرًۭا فَإِنَّ لَكُم مَّا سَأَلْتُمْ ۗ وَضُرِبَتْ عَلَيْهِمُ ٱلذِّلَّةُ وَٱلْمَسْكَنَةُ وَبَآءُو بِغَضَبٍۢ مِّنَ ٱللَّهِ ۗ ذَٰلِكَ بِأَنَّهُمْ كَانُوا۟ يَكْفُرُونَ بِـَٔايَـٰتِ ٱللَّهِ وَيَقْتُلُونَ ٱلنَّبِيِّـۧنَ بِغَيْرِ ٱلْحَقِّ ۗ ذَٰلِكَ بِمَا عَصَوا۟ وَّكَانُوا۟ يَعْتَدُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". And\t when\t you\t said,\t “O\t Moosa!\t We\t shall\t\nnever\t put\t up\twith\t only\t one\t kind\t of\t food,\t\nso\t call\t upon\t your\t Lord\t to\t produce\t for\t us\t\nwhat\t the\t earth\t grows\t - some\t herbs,\t\ncucumbers,\t corn,\t lentils\t and\t onions”;\t he\t\nsaid,\t “What!\t You\t wish\t to\t exchange\t the\t\nbetter\t for\t something\t inferior?\t Therefore\t\nsettle\t down\t in\t Egypt\t or\t any\t city,\t where\t you\t will\t get\t what\t you\t demand”;\t and\t disgrace\t and\t\nmisery\t were\t destined\t for\t them;\t and\t they\t returned\t towards\tAllah’s\t wrath;\t that\t was\t because\t\nthey\t disbelieved\t in\t Allah’s\t signs\t and\t wrongfully\t martyred\t the\t Prophets;\t that\t was\t for\t their\t\ndisobedience\tand\ttransgression.",
    "romanUrduTranslationText": ". Aur\tjab\t tum\tne\tkaha\taey\tMūsā hum\tse\t to\t\nek\tkhāne\tper\tharghiz\tsabr\tna\thoga\tto\tāap\tapne\tRab\tse\tdua\tkijiye\tke\tzameen\tki\tugāi\thui\tcheezeiñ\t\nhamāre\t liye\t nikāle,\t kuch\t sāg\t aur\t kakdi\t aur\t gehooñ aur\t masoor\t aur\t piyāz\t farmāya\t kiya\t adna\t\ncheez\t ko\t behtar\t ke\t badle\t māñgte\t ho\t achchha\tMisr ya\t kisi\t shahar\t meiñ\t utro\t wahāñ tumheiñ\t\nmilega\t jo\t tum\t ne\t mānga\t aur\t un\t per\t muqarrar\t kar\t di\t gayi\t khuwāri\t aur\t nadāri\t aur\tKhuda\t ke\t\nghazab\tme\tlaute\tyeh\tbadla\ttha\tiska\tke\twoh\tAllah\tki\tāyatoñ\tka\tinkār\tkarte\taur\tambiya\tko\tna\thaq\t\nshaheed\tkarte\tyeh\tbadla\ttha\tun\tki\tna\tfarmāniyoñ\taur\thad\tse\tbadhne\tka"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "62",
    "arabicText": "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَٱلَّذِينَ هَادُوا۟ وَٱلنَّصَـٰرَىٰ وَٱلصَّـٰبِـِٔينَ مَنْ ءَامَنَ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ وَعَمِلَ صَـٰلِحًۭا فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Indeed\t the\t believers\t (the\t Muslims)\t and\t\nthose\tamong\tthe\tJews,\tthe\tChristians,\tand\t\nthe\tSabeans\twho\tsincerely\taccept\t faith\tin\t\nAllah and\t the\t Last\t Day\t *\t and\t do\t good\t\ndeeds\t - their\t reward\t is\t with\t their\t Lord;\t\nand\tthere\tshall\tbe\tno\t fear\tupon\tthem\tnor\t\nshall\tthey\tgrieve.\t(*\ti.e.\tconvert\tto\tIslam)\n",
    "romanUrduTranslationText": ". Beshak\t Īmān\t wāle\t neez\t Yahudioñ\t aur\t\nNasrāniyoñ\t aur\t Sitāra\t parastoñ\t meiñ\t se\t\nwoh\tke\tsachche\tdil\tse\tAllah\taur\tpichle\tdin\t\nper\tĪmān\tlāyeiñ\taur\tnek\tkām\tkareiñ\tunka\t\nsawāb\tun\tke\tRab\tke\tpās\thai\taur\tna\tunheiñ\t\nkuch\tandesha\tho\taur\tna\tkuch\tgham"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "63",
    "arabicText": "وَإِذْ أَخَذْنَا مِيثَـٰقَكُمْ وَرَفَعْنَا فَوْقَكُمُ ٱلطُّورَ خُذُوا۟ مَآ ءَاتَيْنَـٰكُم بِقُوَّةٍۢ وَٱذْكُرُوا۟ مَا فِيهِ لَعَلَّكُمْ تَتَّقُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And when\tWe\tmade\ta\tcovenant\twith\tyou\t\nand\traised\t the\tMount\tabove\t you;\t “Accept\t\nand\t hold\t fast\t to\t what\t We\t give\t you,\t and\t\nremember\t what\t is\t in\t it,\t so\t that\t you\t may\t\nattain\tpiety.”",
    "romanUrduTranslationText": ". Aur\tjab\tham\tne\ttum\tse\t‘ahed\tliya\taur\ttum\t\npar\t toor\t ko\t ooñcha\t kiya\t lo\t jo\t kuch\t ham\t\ntum\t ko\t dete\t haiñ\t zor\t se\t uske\t mazmoon\t\nyād\t karo\t is\t ummeed\t par\t ke\t tumheiñ\t\nparhez-gāri\tmile"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "64",
    "arabicText": "ثُمَّ تَوَلَّيْتُم مِّنۢ بَعْدِ ذَٰلِكَ ۖ فَلَوْلَا فَضْلُ ٱللَّهِ عَلَيْكُمْ وَرَحْمَتُهُۥ لَكُنتُم مِّنَ ٱلْخَـٰسِرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Then\t after\t that,\t you\t turned\t away;\t and\t\nwere\t it\t not\t for\t the\t munificence\t of\t Allah\nand\t His\t mercy,\t you\t would\t be\t among\t the\t\nlosers.\t\n",
    "romanUrduTranslationText": "Phir\tuske\tb‘ād\ttum\tphir\tgaye\tto\tagar\tAllah\t\nka\t fazl\t aur\t uski\t rahmat\t na\t hoti\t to\t tum\t\ntoote\t(nuqsān)\twālon\tme\tho\tjāte\n"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "65",
    "arabicText": "وَلَقَدْ عَلِمْتُمُ ٱلَّذِينَ ٱعْتَدَوْا۟ مِنكُمْ فِى ٱلسَّبْتِ فَقُلْنَا لَهُمْ كُونُوا۟ قِرَدَةً خَـٰسِـِٔينَ",
    "urduTranslationText": "",
    "englishTranslationText": ". And\tyou\tcertainly\tknow\tof\tthose\tamongst\t\nyou\t who\t transgressed\t in\t the\t matter\t of\t\nSabth\t(Sabbath\t- Saturday)\t- We\ttherefore\t\nsaid\tto\tthem,\t“Become\tapes,\tdespised!”\t",
    "romanUrduTranslationText": ". Aur\t beshak\t zaroor\t tumheiñ\t ma'loom\t hai\t\ntum\t meiñ\t ke\t woh\t jinhoñ\t ne\t hafte\t me\t\nsarkashi\tki\tto\tham\tne\tunse\tfarmaya\tke\tho\t\njāo\tBandar\tdhutkāre\thuwe"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "66",
    "arabicText": "فَجَعَلْنَـٰهَا نَكَـٰلًۭا لِّمَا بَيْنَ يَدَيْهَا وَمَا خَلْفَهَا وَمَوْعِظَةًۭ لِّلْمُتَّقِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "So\tWe\tmade\tthis\tincident\t(of\tthat\ttown)\ta\t\nwarning\tto\tthe\tsurrounding\ttowns\t(others\t\nof\t their\t time)\t and\t to\t succeeding\t\ngenerations,\tand\ta\tlesson\tfor\tthe\tpious.\t",
    "romanUrduTranslationText": "To\tham\tne\tus\tbasti\tka\tyeh\twāqia\tuske\tāge\t\naur\tpeechhe\twālon\tke\tliye\t'ibrat\tkar\tdiya\t\naur\tparhez-gāron\tke\tliye\tnasihat\t"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "67",
    "arabicText": "وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِۦٓ إِنَّ ٱللَّهَ يَأْمُرُكُمْ أَن تَذْبَحُوا۟ بَقَرَةًۭ ۖ قَالُوٓا۟ أَتَتَّخِذُنَا هُزُوًۭا ۖ قَالَ أَعُوذُ بِٱللَّهِ أَنْ أَكُونَ مِنَ ٱلْجَـٰهِلِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t(remember)\twhen\t Moosa\t said\t to\t his\t\npeople,\t “Allah commands\t you\t to\t sacrifice\t\na\tcow”;\tthey\tsaid,\t“Are\tyou\tmaking\t fun\tof\t\nus?”\tHe\tanswered,\t“Allah forbid\tthat\tI\tshould\tbe\tof\tthe\tignorant!”\t",
    "romanUrduTranslationText": ". Aur\t jab\t Mūsā ne\t apni\t qaum\t se\t farmāya\t\nKhuda\t tumheiñ\thukm\tdeta\thai\tek\tgāye\tzibah\t karo\tbole\t ke\tāap\thameiñ\tmaskhara\tbanāte\thaiñ\t\nfarmāya\tKhuda\tki\tpanāh\tki\tmai\tjāhilon\tse\thuñ"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "68",
    "arabicText": "قَالُوا۟ ٱدْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا هِىَ ۚ قَالَ إِنَّهُۥ يَقُولُ إِنَّهَا بَقَرَةٌۭ لَّا فَارِضٌۭ وَلَا بِكْرٌ عَوَانٌۢ بَيْنَ ذَٰلِكَ ۖ فَٱفْعَلُوا۟ مَا تُؤْمَرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "They\tsaid,\t“Pray\tto\tyour\tLord\tthat\tHe\tmay\tdescribe\tthe\tcow”;\tsaid\tMoosa,\t“He\tsays\tthat\tit\tis\ta\t\ncow\t neither\t old\t nor\t very\t young\t but\t between\t the\t two\t conditions;\t so\t do\t what\t you\t are\t\ncommanded.”\t",
    "romanUrduTranslationText": "Bole\tapne\tRab\tse\tDua\tkijiye\tke\twoh\thameiñ\tbata\tde\tgāye\tkaisi\tkaha\twoh\tfarmāta\thai\tke\two\tek\t\ngāye\thai\tna\tboodhi\taur\tna\tausar (Bachiya) balke\tin\tdonoñ\tke\tbeech\tmeiñ\tto\tkaro\tjis\tka\ttumheiñ\t\nhukm\thota\thai.\t"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "69",
    "arabicText": "قَالُوا۟ ٱدْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا لَوْنُهَا ۚ قَالَ إِنَّهُۥ يَقُولُ إِنَّهَا بَقَرَةٌۭ صَفْرَآءُ فَاقِعٌۭ لَّوْنُهَا تَسُرُّ ٱلنَّـٰظِرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "They\tsaid,\t“Pray\tto\tyour\tLord\tthat\tHe\tmay\treveal\tits\tcolour\tto\tus”;\tanswered\tMoosa,\t“Indeed\tHe\t\nsays\tit\tis\ta\tyellow\tcow,\tof\tbright\tcolour,\tpleasing\tto\tthe\tbeholders.”\t",
    "romanUrduTranslationText": ". Bole\tapne\tRab\tse\tDua\tkijiye\thameiñ\tbata\tde\tuska\trang\tkiya\thai\tkahā woh\t farmāta\thai\twoh\tek\t\npeeli\tgāye\thai\tjiski\trangat\tdeh-dahāti\t(Gehri\tChamak-dār)\tdekhne\twālon\tko\tkhushi\tdeti"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "70",
    "arabicText": "قَالُوا۟ ٱدْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا هِىَ إِنَّ ٱلْبَقَرَ تَشَـٰبَهَ عَلَيْنَا وَإِنَّآ إِن شَآءَ ٱللَّهُ لَمُهْتَدُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "They\tsaid,\t“Pray\tto\tyour\tLord\tthat\tHe\tmay\t\nclearly\t describe\t the\t cow\t to\t us,\t we\t are\t\nreally\tin\ta\tdoubt\tas\tto\twhich\tcow\tit\tis;\tand\t\nif\tAllah wills,\twe\twill\tattain\tguidance.”\t",
    "romanUrduTranslationText": "Bole\t apne\t Rab\t se\t dua\t kijiye\t ke\t hamāre\t\nliye\t sāf\t bayān\t karde\t woh\t gāye\t kaisi\t hai\t\nbeshak\t gāyoñ\t meiñ\t ham\t ko\t shub'h\t pad\t\ngya\t aur\t Allah\t chāhe\t to\t ham\t rāh\t pa\tjāyeñ\nge\t"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "71",
    "arabicText": "قَالَ إِنَّهُۥ يَقُولُ إِنَّهَا بَقَرَةٌۭ لَّا ذَلُولٌۭ تُثِيرُ ٱلْأَرْضَ وَلَا تَسْقِى ٱلْحَرْثَ مُسَلَّمَةٌۭ لَّا شِيَةَ فِيهَا ۚ قَالُوا۟ ٱلْـَٔـٰنَ جِئْتَ بِٱلْحَقِّ ۚ فَذَبَحُوهَا وَمَا كَادُوا۟ يَفْعَلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Said\t Moosa,\t “He\t says,\t ‘She\t is\t a\t cow\t not\t\nmade\t to\twork,\t neither\t ploughing\t the\t soil\t\nnor\t watering\t the\t fields;\t flawless\t and\t\nspotless’;\t they\t said,\t “You\t have\t now\t\nconveyed\t the\t proper\t fact”;\t so\t they\t\nsacrificed\t it,\t but\t seemed\t not\t to\t be\t\nsacrificing\tit\t(with\tsincerity).",
    "romanUrduTranslationText": ". Kaha\twoh\tfarmāta\thai\tke\twoh\tek\tgāye\thai\t\njis\tne\tkhidmat\tnahi\tli\tjāti\tke\tzameen\tjotey\t\naur\tna\tkheti\tko\tpāni\tde,\tbe-aib\thai\tjis\tmeiñ\t\nkoi\tdāgh\tnahi,\tbole\tab āap\t theek\tbāt\tlāye\t\nto\t usey\t zibah\t kiya\t aur\t zibah\t karte\t\nma'loom\tna\thote\tthey\t"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "72",
    "arabicText": "وَإِذْ قَتَلْتُمْ نَفْسًۭا فَٱدَّٰرَْٰٔتُمْ فِيهَا ۖ وَٱللَّهُ مُخْرِجٌۭ مَّا كُنتُمْ تَكْتُمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t (remember)\t when\t you\t slew\t a\t man\t\nand\t were\t therefore\t accusing\t each\t other\t\nconcerning\tit;\tand\tAllah wanted\tto\texpose\t\nwhat\tyou\twere\thiding.\n",
    "romanUrduTranslationText": ". Aur\tjab\ttum\tne\tek\tkhoon\tkiya\tto\tek\tdoosre\t\nper\t uski\t tohmat\t dālne\t lage\t aur\t Allah\t ko\t\nzahir\tkarna\ttha\tjo\ttum\tchupāte\tthey"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "73",
    "arabicText": "فَقُلْنَا ٱضْرِبُوهُ بِبَعْضِهَا ۚ كَذَٰلِكَ يُحْىِ ٱللَّهُ ٱلْمَوْتَىٰ وَيُرِيكُمْ ءَايَـٰتِهِۦ لَعَلَّكُمْ تَعْقِلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "We\t therefore\t said,\t “Strike\t the\t dead\t man\t\nwith\t a\t part\t of\t the\t sacrificed\t cow”;\t this\tis\t\nhow\tAllah will\tbring\t the\tdead\t to\tlife,\tand\t\nshows\t you\t His\t signs\t so\t that\t you\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nmay\tunderstand!\t",
    "romanUrduTranslationText": "To\tham\tne\tfarmāya\tus\tmaqtool\tko\tus\tgāye\t\nka\t ek\t tukda\t māro\t Allah\t yuñ hi\t murde\t\njilayega\t aur\t tumheiñ\t apni\t nishāniyañ\t\ndikhata\thai\tke\tkahiñ\ttumheiñ\taql\tho"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "74",
    "arabicText": "ثُمَّ قَسَتْ قُلُوبُكُم مِّنۢ بَعْدِ ذَٰلِكَ فَهِىَ كَٱلْحِجَارَةِ أَوْ أَشَدُّ قَسْوَةًۭ ۚ وَإِنَّ مِنَ ٱلْحِجَارَةِ لَمَا يَتَفَجَّرُ مِنْهُ ٱلْأَنْهَـٰرُ ۚ وَإِنَّ مِنْهَا لَمَا يَشَّقَّقُ فَيَخْرُجُ مِنْهُ ٱلْمَآءُ ۚ وَإِنَّ مِنْهَا لَمَا يَهْبِطُ مِنْ خَشْيَةِ ٱللَّهِ ۗ وَمَا ٱللَّهُ بِغَـٰفِلٍ عَمَّا تَعْمَلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Then after\t it,\t your\t hearts\t hardened\t - so\t\nthey\t are\t like\t rocks,\t or\t even\t harder;\t for\t\nthere\t are\t some\t rocks\t that\t rivers\t gush\t\nforth\t from\t them;\t and\t some\t that\t water\t\nflows\tfrom\tthem\twhen\tthey\tsplit\tasunder;\t\nand\tthere\tare\trocks\tthat\tfall\tdown\tfor\tthe\t\nfear\tof\tAllah;\tand\tAllah is\tnot\tunaware\tof\t\nyour\tdeeds.",
    "romanUrduTranslationText": "Phir\tis\tke\tb‘ād\t tumhāre\tdil\tsakht\tho\tgaye\t\nto\twoh\tpattharoñ ki misl\thaiñ\tbalke\tunse\t\nbhi\tziyada\tkarre\t(sakht)\taur\tpattharoñ me\t\nto\t kuchh\t woh\t haiñ\t jin\t se\t nadiyāñ bah\t\nnikalti\thaiñ\taur\tkuch\twoh\thaiñ\tjo\tphat\tjāte\t\nhaiñ\t to\t unse\t pāni\t nikalta\t hai\t aur\t kuchh\t wo\t haiñ\t jo\t Allah\t ke\t dar\t se\t gir\t padte\t haiñ\t aur\t Allah\t\ntumhāre\tkautkoñ\t(bure\tkāmon)\tse\tbe-khabar\tnhi"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "75",
    "arabicText": " أَفَتَطْمَعُونَ أَن يُؤْمِنُوا۟ لَكُمْ وَقَدْ كَانَ فَرِيقٌۭ مِّنْهُمْ يَسْمَعُونَ كَلَـٰمَ ٱللَّهِ ثُمَّ يُحَرِّفُونَهُۥ مِنۢ بَعْدِ مَا عَقَلُوهُ وَهُمْ يَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "So\tO\tMuslims,\tdo\tyou\twish\tfor\tthe\tJews\tto\taccept\tfaith\tin\tyou\twhereas\ta\tgroup\tof\tthem\tused\tto\t\nlisten\tto\tthe\tWords\tof\tAllah,\tand\tthen\tafter\thaving\tunderstood\tit,\tpurposely\tchanged\tit?",
    "romanUrduTranslationText": "To\taey\tMuslamanoñ\t kiya\t tumheiñ\t yeh\t tama'\t hai\t ke\t yahoodi\t tumhāra\t yaqeen\tlāyeñ ge\taur\t un\t\nmeiñ\tka\tto\tek\tgiroh\twoh\ttha\tke\tAllah\tka\tkalām\tsunte\tphir\tsamajhne\tke\tb‘ād\tusey\tdānista\tbadal\t\ndete"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "76",
    "arabicText": "وَإِذَا لَقُوا۟ ٱلَّذِينَ ءَامَنُوا۟ قَالُوٓا۟ ءَامَنَّا وَإِذَا خَلَا بَعْضُهُمْ إِلَىٰ بَعْضٍۢ قَالُوٓا۟ أَتُحَدِّثُونَهُم بِمَا فَتَحَ ٱللَّهُ عَلَيْكُمْ لِيُحَآجُّوكُم بِهِۦ عِندَ رَبِّكُمْ ۚ أَفَلَا تَعْقِلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\twhen\tthey\tmeet\tthe\tbelievers,\tthey\tsay,\t“We\tbelieve”;\tbut\twhen\tthey\tare\tin\tisolation\twith\t\none\tanother\t they\tsay,\t “You\tclarify\t to\t the\tbelievers\t from\twhat\tAllah has\tdisclosed\t to\tyou,\tso\t\nthat\tthey\tmay\tevidence\tit\tagainst\tyou\tbefore\tyour\tLord?\tSo\thave\tyou\tno\tsense?”",
    "romanUrduTranslationText": "Aur\tjab\tMusalmanoñ\tse\tmileiñ\tto\tkaheiñ\tham\tĪmān\tlāye\taur\tjab\tāpas\tmeiñ\takele\thoñ\tto\tkaheiñ\t\nwoh\tilm\tjo\tAllah\tne\ttum\tpar\tkhola\tMusalmanoñ\tse\tbayan\tkiye\tdete\tho\tki usse\ttumhāre\tRab\tke\t\nyahāñ\ttumheiñ\tper\thujjat\tlāyeñ\tkiya\ttumheiñ\taql\tnhi"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "77",
    "arabicText": " أَوَلَا يَعْلَمُونَ أَنَّ ٱللَّهَ يَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Do\t they\t not\t know\t that\t Allah knows\t all\t\nwhatever\t they\t hide\t and\t whatever\t they\t\ndisclose?",
    "romanUrduTranslationText": "Kiya\tnahi\tjānte\tke\tAllah\tjānta\thai\tjo\tkuch\t\nwoh\tchupāte\thaiñ\taur\tjo\tkuch\tzāhir\tkarte\t\nhaiñ"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "78",
    "arabicText": " وَمِنْهُمْ أُمِّيُّونَ لَا يَعْلَمُونَ ٱلْكِتَـٰبَ إِلَّآ أَمَانِىَّ وَإِنْ هُمْ إِلَّا يَظُنُّونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t among\t them\t are\t the\t unlearned\t that\t\ndo\tnot\tknow\tanything\tof\t the\tBook\texcept\t\nto\trecite\tsomething\t therefrom\tor\tparts\tof\t\ntheir\t own\t fabrications;\t they\t are\t in\t\t\t\nabsolute\tillusion.\t",
    "romanUrduTranslationText": "Aur\t un\t meiñ\t kuchh\t an-pardh\t haiñ\t ke\t jo\t\nkitāb\t ko\t nahi\t jānte\t magar\t zubāni\t padh\t\nlena\t ya\t kuch apni\t man\t gadhat\t aur\t woh\t\nnire\tgumān\tmeiñ\thaiñ\t"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "78",
    "arabicText": " وَمِنْهُمْ أُمِّيُّونَ لَا يَعْلَمُونَ ٱلْكِتَـٰبَ إِلَّآ أَمَانِىَّ وَإِنْ هُمْ إِلَّا يَظُنُّونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t among\t them\t are\t the\t unlearned\t that\t\ndo\tnot\tknow\tanything\tof\t the\tBook\texcept\t\nto\trecite\tsomething\t therefrom\tor\tparts\tof\t\ntheir\t own\t fabrications;\t they\t are\t in\t\t\t\nabsolute\tillusion.\t",
    "romanUrduTranslationText": "Aur\t un\t meiñ\t kuchh\t an-pardh\t haiñ\t ke\t jo\t\nkitāb\t ko\t nahi\t jānte\t magar\t zubāni\t padh\t\nlena\t ya\t kuch apni\t man\t gadhat\t aur\t woh\t\nnire\tgumān\tmeiñ\thaiñ\t"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "79",
    "arabicText": "فَوَيْلٌۭ لِّلَّذِينَ يَكْتُبُونَ ٱلْكِتَـٰبَ بِأَيْدِيهِمْ ثُمَّ يَقُولُونَ هَـٰذَا مِنْ عِندِ ٱللَّهِ لِيَشْتَرُوا۟ بِهِۦ ثَمَنًۭا قَلِيلًۭا ۖ فَوَيْلٌۭ لَّهُم مِّمَّا كَتَبَتْ أَيْدِيهِمْ وَوَيْلٌۭ لَّهُم مِّمَّا يَكْسِبُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". Therefore\t woe\t is\t to\t those\t who\t write\t the\t\nBook\t with\t their\t hands;\t and\t they\t then\t\nclaim,\t“This\tis\tfrom\tAllah”\tin\torder\tto\tgain\t\nan\t abject\t(worldly)\t price\t for\t it;\t therefore\t\nwoe\t to\t them\t for\t what\t their\t hands\t have\t\nwritten,\t and\t woe\t to\t them\t for\t what\t they\t\nearn\twith\tit.\t",
    "romanUrduTranslationText": ". To\t kharābi\t hai\t unke\t liye\t jo\t kitāb\t apne\t\nhāth\tse\tlikheñ\tphir\tkah\tdeñ\tyeh\tKhuda\tke\t\npās\t se\t hai\t ke\tiske\t 'ewaz\t thode\t dām\t hāsil\t\nkareiñ\t to\t kharābi\t hai\t unke\t liye\t unke\t\nhāthoñ ke\t likhe\t se\t aur\t kharābi\t unke\t liye\t\nus\tkamāi\tse"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "80",
    "arabicText": "وَقَالُوا۟ لَن تَمَسَّنَا ٱلنَّارُ إِلَّآ أَيَّامًۭا مَّعْدُودَةًۭ ۚ قُلْ أَتَّخَذْتُمْ عِندَ ٱللَّهِ عَهْدًۭا فَلَن يُخْلِفَ ٱللَّهُ عَهْدَهُۥٓ ۖ أَمْ تَقُولُونَ عَلَى ٱللَّهِ مَا لَا تَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". And\t they\tsaid,\t “The\t fire\twill\tnot\t touch\tus\t\nexcept\tfor\ta\tcertain\tnumber\tof\tdays”;\tsay,\t\n“Have\t you\t taken\t a\t covenant\t from\tAllah -\nthen\t Allah will\t certainly\t not\t break\t His\t\ncovenant\t - or\t do\t you\t say\t something\t\nconcerning\tAllah what\tyou\tdo\tnot know?”\t\n",
    "romanUrduTranslationText": "Aur\t bole\t hameñ to\tĀg\t na\t chuwegi\tmagar\t\nginti\t ke\t din\t tum\t farma\t do\t kiya\tKhuda\t se\t\ntumne\t koi\t ‘ahed\tle\t rakha\t hai\tjab\t to\tAllah\t\nhargiz\t apna\t ‘ahed\t khilāf\t na\t Karega\t ya\t\nkhuda\tpar\twoh\tbāt\tkahte\tho\tjiska\ttumheiñ\tilm\tnahi"
  }
]