[
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "195",
    "arabicText": "فَٱسْتَجَابَ لَهُمْ رَبُّهُمْ أَنِّى لَآ أُضِيعُ عَمَلَ عَـٰمِلٍۢ مِّنكُم مِّن ذَكَرٍ أَوْ أُنثَىٰ ۖ بَعْضُكُم مِّنۢ بَعْضٍۢ ۖ فَٱلَّذِينَ هَاجَرُوا۟ وَأُخْرِجُوا۟ مِن دِيَـٰرِهِمْ وَأُوذُوا۟ فِى سَبِيلِى وَقَـٰتَلُوا۟ وَقُتِلُوا۟ لَأُكَفِّرَنَّ عَنْهُمْ سَيِّـَٔاتِهِمْ وَلَأُدْخِلَنَّهُمْ جَنَّـٰتٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ ثَوَابًۭا مِّنْ عِندِ ٱللَّهِ ۗ وَٱللَّهُ عِندَهُۥ حُسْنُ ٱلثَّوَابِ",
    "urduTranslationText": "",
    "englishTranslationText": "So\t their\t Lord\taccepted\t their\t prayer,\t for\t I\t\ndo\tnot\twaste\tthe\tefforts\tof\tany\t(righteous)\t\nworker,\t male\t or\t female;\t you\t are\t all\t one\t\namong\tyourselves;\tso\tthose\twho\tmigrated\t\nand\t were\t driven\t out\t from\t their\t homes\t\nand\t were\t harassed\t in\t My\t cause,\t and\t\nfought,\t and\t were\t slain\t - I\t will\t certainly\t\nwipe\t out\t all\t their\t sins\t and\t will\t certainly\t\nadmit\t them\t into\t Gardens\t beneath\t which\t\nrivers\tflow;\ta\treward\tfrom\tAllah;\tand\tonly\t\nwith\tAllah is\tthe\tbest\treward.",
    "romanUrduTranslationText": "To\tunki\tdu'a\tsun\tli\tun\tke\tRab\tne\tke\tmaiñ\t\ntum\tmeiñ\tkām\twāle\tki\tmehnat\takārat\tnahi\t\nkarta\tmard\tho\tyā\taurat\ttum\tāpas\tmeiñ\tek\t\nho\t to\t woh\t jinhoñ\t ne\t hijrat\t ki\t aur\t apne\t\ngharoñ\t se\t nikāle\t gaye\t aur\t lade\t aur\t māre\t\ngaye\t maiñ\t zaroor\t un\t ke\t sab\t gunāh\t utār\t\ndooñ\t ga\t aur\t zaroor\t unheiñ\t bāghoñ\t meiñ\t\nle\tjāuñ\tga\tjin\tke\tneeche\tnahre\trawāñ\tAllah\t\nke\t pās\t ka\t sawāb\t aur\t Allah\t hi\t ke\t pās\t\nachcha\tsawāb\thai"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "196",
    "arabicText": "لَا يَغُرَّنَّكَ تَقَلُّبُ ٱلَّذِينَ كَفَرُوا۟ فِى ٱلْبِلَـٰدِ",
    "urduTranslationText": "",
    "englishTranslationText": "O\t listener\t(followers\t of\t this\t Prophet)!\t Do\t\nnot\tever\t be\t deceived\t by\t the\t disbelievers’\t\nfree\tmovements\tin\tthe\tcities.\t",
    "romanUrduTranslationText": "Aey\tsun\tne\twāle\tkāfiroñ\tka\tshahroñ\tmeiñ\t\nahle\t gahle\t (Itrāte)\t phirna\t hargiz\t tujhe\t\ndhoka\tna\tde"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "197",
    "arabicText": "مَتَـٰعٌۭ قَلِيلٌۭ ثُمَّ مَأْوَىٰهُمْ جَهَنَّمُ ۚ وَبِئْسَ ٱلْمِهَادُ",
    "urduTranslationText": "",
    "englishTranslationText": "It\tis\ta\tbrief\tusage;\t their\thome\tis\thell;\tand\t\nwhat\tan\tevil\tresting-place!\t.\t",
    "romanUrduTranslationText": "Thoda\t baratna\t hai\t phir\t unka\t thikāna\t\ndozakh\thai\taur\tkiya\thi\tburā\tbichauna"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "198",
    "arabicText": "لَـٰكِنِ ٱلَّذِينَ ٱتَّقَوْا۟ رَبَّهُمْ لَهُمْ جَنَّـٰتٌۭ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا نُزُلًۭا مِّنْ عِندِ ٱللَّهِ ۗ وَمَا عِندَ ٱللَّهِ خَيْرٌۭ لِّلْأَبْرَارِ ١٩٨",
    "urduTranslationText": "",
    "englishTranslationText": "But\t for\t those\t who\t fear\t their\t Lord\t are\t\nGardens\t beneath\t which\t rivers\t flow\t -\nabiding\tin\tit\tfor\tever\t- the\thospitality\tfrom\t\ntheir\tLord;\tand\tthat\twhich\tis\twith\tAllah,\tis\t\nthe\tbest\tfor\tthe\trighteous.",
    "romanUrduTranslationText": "Lekin\twoh jo\tapne\tRab\tse\tdarte\thaiñ\tun\tke\t\nliye\t Jannateiñ\t haiñ\t jin\t ke\t neeche\t nahre\t\nbaheiñ\t hamesha\t un\t meiñ\t raheiñ\t Allah\t ki\t\ntaraf\t ki\t mehmāni\t aur\t jo\t Allah\t ke\t pās\t hai\t\nwoh\tnekoñ\tke\tliye\tsab\tse\tbhalā"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "199",
    "arabicText": "وَإِنَّ مِنْ أَهْلِ ٱلْكِتَـٰبِ لَمَن يُؤْمِنُ بِٱللَّهِ وَمَآ أُنزِلَ إِلَيْكُمْ وَمَآ أُنزِلَ إِلَيْهِمْ خَـٰشِعِينَ لِلَّهِ لَا يَشْتَرُونَ بِـَٔايَـٰتِ ٱللَّهِ ثَمَنًۭا قَلِيلًا ۗ أُو۟لَـٰٓئِكَ لَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ ۗ إِنَّ ٱللَّهَ سَرِيعُ ٱلْحِسَابِ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t undoubtedly\t there\t are\t some\t among\t\nthe\tPeople\tgiven\t the\tBook(s),\twho\taccept\t\nfaith\t in\t Allah and\t what\t is\t sent\t down\t to\t\nyou\t and\t what\t was\t sent\t down\t to\t them\t -\ntheir\thearts\tare\tsubmitted\thumbly\tbefore\t\nAllah - they\tdo\tnot\texchange\tthe\tverses\tof\t\nAllah for\t an\t abject\t price;\t they\t are\t those\t\nwhose\t reward\t is\t with\t their\t Lord;\t indeed\t\nAllah is\tSwift\tAt\tTaking\tAccount.\t",
    "romanUrduTranslationText": "Aur\tbeshak\tkuch\tkitābi\taise\thaiñ\tke\tAllah\tpar\tImān\tlāte\thaiñ\taur\tus\tpar jo\ttumhāri\ttaraf\tutra\tun\t\nke\tdil\tAllah\tke\thuzoor\tjhuke\thuwe\tAllah\tki\tāyatoñ\tke\tbadle\tzaleel\tdām\tnahi\tlete\tyeh\twoh\thaiñ\tjin\t\nka\tsawāb\tun\tke\tRab\tke\tpās\thai\taur\tAllah\tjald\thisāb\tkarne\twāla\thai."
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "200",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱصْبِرُوا۟ وَصَابِرُوا۟ وَرَابِطُوا۟ وَٱتَّقُوا۟ ٱللَّهَ لَعَلَّكُمْ تُفْلِحُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "O\tPeople\twho\tBelieve!\tEndure\tand\tsurpass\tyour\tenemies\tin\tendurance,\tand\tguard\tthe\tfrontiers\t\nof\tthe\tIslamic\tnation;\tand\tkeep\tfearing\tAllah,\thoping\tthat\tyou\tmay\tsucceed",
    "romanUrduTranslationText": "Aey\tImān\twālo\tsabr\tkaro\taur\tsabr\tmeiñ\tdushmanoñ\tse\tāge\traho\taur\tsarhad\tpar\tIslāmi\tmulk\tki\t\nnigehbāni\tkaro\taur\tAllah\tse\tdarte\traho\tis\tummeed\tpar\tke\tkāmyāb\tho."
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "1",
    "arabicText": "يَـٰٓأَيُّهَا ٱلنَّاسُ ٱتَّقُوا۟ رَبَّكُمُ ٱلَّذِى خَلَقَكُم مِّن نَّفْسٍۢ وَٰحِدَةٍۢ وَخَلَقَ مِنْهَا زَوْجَهَا وَبَثَّ مِنْهُمَا رِجَالًۭا كَثِيرًۭا وَنِسَآءًۭ ۚ وَٱتَّقُوا۟ ٱللَّهَ ٱلَّذِى تَسَآءَلُونَ بِهِۦ وَٱلْأَرْحَامَ ۚ إِنَّ ٱللَّهَ كَانَ عَلَيْكُمْ رَقِيبًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "O\tmankind!\t Fear\t your\t Lord\tWho\t created\t\nyou\tfrom\ta\tsingle\tsoul\tand\tfrom\tit\tcreated\t\nits\tspouse\tand\tfrom\tthem\tboth\thas\tspread\t\nthe\t multitude\t of\t men\t and\t women;\t fear\t\nAllah in\t Whose\t name\t you\t claim\t (your\t\nrights\t from\t one\t another)\t and\t be\t mindful\t\nof\t your\t blood\t relations;\t indeed\t Allah is\t\nalways\tseeing\tyou",
    "romanUrduTranslationText": "Aey\tlogoñ!\tapne\tRab\tse\tdaro\tjis\tne\ttumheiñ\t\nek\tjān\tse\tpaida\tkiya\taur\tusi\tmeiñ\tse\tus\tka\t\njoda\tbanāya\taur\tun\tdonoñ\tse\tbahut\tmard\to\t\naurat\t phailā\t diye\t aur\t Allah\t se\t daro\t jis\t ke\t\nnām\t par\t māñgte\t ho\t aur\t rishtoñ\t ka\t lihāz\t\nrakho\t beshak\t Allah\t har\t waqt\t tumheiñ\t\ndekh\trahā\thai."
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "2",
    "arabicText": "وَءَاتُوا۟ ٱلْيَتَـٰمَىٰٓ أَمْوَٰلَهُمْ ۖ وَلَا تَتَبَدَّلُوا۟ ٱلْخَبِيثَ بِٱلطَّيِّبِ ۖ وَلَا تَأْكُلُوٓا۟ أَمْوَٰلَهُمْ إِلَىٰٓ أَمْوَٰلِكُمْ ۚ إِنَّهُۥ كَانَ حُوبًۭا كَبِيرًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\tgive\tthe\torphans\ttheir\twealth\tand\tdo\t\nnot\texchange\tthe\tpure\tfor\tthe\tfoul;\tand\tdo\t\nnot\t devour\t (or\t use\t up)\t their\t wealth,\t\nmixing\tit\twith\t your\t own;\t this\tis\tindeed\ta\t\ngreat\tsin",
    "romanUrduTranslationText": "Aur\t yateemoñ\tko\tun\tke\tmāl\tdo\taur\tsuthre\t\nke\t badle\t ganda\t na\t lo\t aur\t un\t ke\t māl\t apne\t\nmāloñ\t meiñ\t mila\t kar\t na\t kha\t jāo\t beshak\t\nyeh\tbadā\tgunāh\thai."
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "3",
    "arabicText": "وَإِنْ خِفْتُمْ أَلَّا تُقْسِطُوا۟ فِى ٱلْيَتَـٰمَىٰ فَٱنكِحُوا۟ مَا طَابَ لَكُم مِّنَ ٱلنِّسَآءِ مَثْنَىٰ وَثُلَـٰثَ وَرُبَـٰعَ ۖ فَإِنْ خِفْتُمْ أَلَّا تَعْدِلُوا۟ فَوَٰحِدَةً أَوْ مَا مَلَكَتْ أَيْمَـٰنُكُمْ ۚ ذَٰلِكَ أَدْنَىٰٓ أَلَّا تَعُولُوا۟ ٣",
    "urduTranslationText": "",
    "englishTranslationText": "And\t if\t you\t fear\t that\t you\t will\t not\t be\t just\t\ntowards\t orphan\t girls,\t marry\t the\t women\t\nwhom\tyou\tlike\t- two\tat\ta\ttime,\tor\tthree\tor\t\nfour;\tthen\tif\tyou\tfear\tthat\tyou\tcannot\tkeep\t\ntwo\twomen\tequally\t then\tmarry\t only\t one\t\nor\tthe\tbondwomen\tyou\town; this\tis\tcloser\t\nto\tyour\tnot\tdoing\tinjustice.\t",
    "romanUrduTranslationText": "Aur\t agar\t tumheiñ\t andesha\t ho\t ke\t yateem\t\nladkiyoñ\t meiñ\t insāf\t na\t karo\t ge\t to\t nikāh\t\nmeiñ\t lāo\t jo\t aurteiñ\t tumheiñ\t Khush\t āyeiñ\t\ndo\tdo\taur\tteen\tteen\taur\tchār\tchār\tphir\tagar\t\ndaro\t ke\t do\t biwiyoñ\t ko\t barābar\t na\t rakh\t\nsakoge\tto\tek\thi\tkaro\tya\tkanizeiñ\tjin\tke\ttum\t\nmālik\tho\tye\tus\tse\tziyāda\tqareeb\thai\tke\ttum\t\nse\tzulm\tna\tho"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "4",
    "arabicText": "وَءَاتُوا۟ ٱلنِّسَآءَ صَدُقَـٰتِهِنَّ نِحْلَةًۭ ۚ فَإِن طِبْنَ لَكُمْ عَن شَىْءٍۢ مِّنْهُ نَفْسًۭا فَكُلُوهُ هَنِيٓـًۭٔا مَّرِيٓـًۭٔا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t give\t the\t women\t their\t bridal\t money\t\nwillingly;\tthen\tif\tthey\twillingly\tgive\tyou\ta\t\npart\tof\tit,\teat\t(use)\tit\twith\tjoy\tand\tfruition",
    "romanUrduTranslationText": "Aur\t aurtoñ\t ko\t un\t ke\t maher\t khushi\t se\t do\t\nphir\tagar\twoh\tapne\tdil\tki\tkhushi\tse\tMaher\t\nmeiñ\t se\t tumheiñ\t kuch\t de\t deiñ\t to\t usey\t\nkhāo\t rachta\t pachta\t (Khush\t gawār\t aur\t\nmaze\tse)\t"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "5",
    "arabicText": "وَلَا تُؤْتُوا۟ ٱلسُّفَهَآءَ أَمْوَٰلَكُمُ ٱلَّتِى جَعَلَ ٱللَّهُ لَكُمْ قِيَـٰمًۭا وَٱرْزُقُوهُمْ فِيهَا وَٱكْسُوهُمْ وَقُولُوا۟ لَهُمْ قَوْلًۭا مَّعْرُوفًۭا",
    "urduTranslationText": "",
    "englishTranslationText": ". And\t do\t not\t give\t the\t foolish\t their\t wealth\t\nwhich\tis\tin\tyour\tcustody\t- those\tfor\twhom\t\nAllah has\t put\t you\t in\t charge\t to\t maintain\t\n(look\t after)\t - and\t feed\t and\t clothe\t them\t\nfrom\tit,\tand\tspeak\tkindly\tto\tthem.\t",
    "romanUrduTranslationText": "Aur\t be-aqloñ\t ko\t un\t ke\t māl\t na\t do\t jo\t\ntumhāre\t pās\t haiñ\tjin\t ko\t Allah\t ne\t tumhāri\t\nbasare\tauqāt\tkiya\thai\taur\tunheiñ\tus\tmeiñ\tse\tkhilāo\taur\tpahnāo\taur\tun\tse\tachchi\tbāt\tkaho"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "6",
    "arabicText": "وَٱبْتَلُوا۟ ٱلْيَتَـٰمَىٰ حَتَّىٰٓ إِذَا بَلَغُوا۟ ٱلنِّكَاحَ فَإِنْ ءَانَسْتُم مِّنْهُمْ رُشْدًۭا فَٱدْفَعُوٓا۟ إِلَيْهِمْ أَمْوَٰلَهُمْ ۖ وَلَا تَأْكُلُوهَآ إِسْرَافًۭا وَبِدَارًا أَن يَكْبَرُوا۟ ۚ وَمَن كَانَ غَنِيًّۭا فَلْيَسْتَعْفِفْ ۖ وَمَن كَانَ فَقِيرًۭا فَلْيَأْكُلْ بِٱلْمَعْرُوفِ ۚ فَإِذَا دَفَعْتُمْ إِلَيْهِمْ أَمْوَٰلَهُمْ فَأَشْهِدُوا۟ عَلَيْهِمْ ۚ وَكَفَىٰ بِٱللَّهِ حَسِيبًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t test\t the\t orphans\t till\t they\tare\t fit\t to\tget\tmarried\t(reach\tfull\t age);\t then\tif\t you\t find\t them\t of\t\nproper\t judgement,\t hand\t over\t their\t wealth\t to\t them;\t and\t do\t not\t devour\t it\t by\t spending\t\nexcessively\tand\thastily,\tfearing\tthat\tthey\twill\tgrow\tup;\tand\twhoever\tis\tnot\tin\tneed\tmust\tabstain;\t\nand\twhoever\tis\tneedy\tmay\tuse\tfrom\tit\tin\ta\treasonable\tmeasure;\tand\twhen\tyou\thand\tover\ttheir\t\nwealth\tto\tthem,\tget\twitnesses\tover\tthem;\tand\tAllah is\tSufficient\tto\ttake\taccount.\t\t",
    "romanUrduTranslationText": "Aur\tyateemoñ\tko\tāzmāte\traho\tyahāñ\t tak\tke\tjab\twoh\tnikāh\tke\tqābil\thoñ\t to\tagar\t tum\tun\tki\tsamajh\t theek\t\ndekho\tto\tun\tke\tmāl\tunheiñ\tsupurd\tkardo\taur\tunheiñ\tna\tkhāo\thad\tse\tbadh\tkar\taur\tis\tjaldi\tmeiñ\tke\tkahiñ\t\nbade\tna\tho\tjāyeñ\taur\tjise\thājat\tna\tho\twoh\tbachta\trahe\taur\tjo\thājat\tmand\tho\twoh\tba-qadr-e-munāsib\tkhāye\t\nphir\tjab\ttum\tun\tke\tmāl\tunheiñ\tsupurd\tkaro\tto\tun\tpar\t\tguwāh\tkar\tlo\taur\tAllah\tkāfi\thai\thisāb\tlene\tko."
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "7",
    "arabicText": "لِّلرِّجَالِ نَصِيبٌۭ مِّمَّا تَرَكَ ٱلْوَٰلِدَانِ وَٱلْأَقْرَبُونَ وَلِلنِّسَآءِ نَصِيبٌۭ مِّمَّا تَرَكَ ٱلْوَٰلِدَانِ وَٱلْأَقْرَبُونَ مِمَّا قَلَّ مِنْهُ أَوْ كَثُرَ ۚ نَصِيبًۭا مَّفْرُوضًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "For\tmen\tis\ta\tshare\tfrom\twhat\tthe\tparents\t\nand\t near\t relatives\t leave\t behind,\t and\t for\t\nwomen\tis\ta\t share\t from\twhat\t the\t parents\t\nand\t near\t relatives\tleave\t behind,\t whether\t\nthe\twealth\t(inheritance)\tis\tsmall\tor\tlarge;\t\nthe\tshare\tis\ta\tfixed\tone.\t\t\t",
    "romanUrduTranslationText": "Mardoñ\t ke\t liye\t hissa\t hai\t us\t meiñ\t se\t jo\t\nchord\t gaye\t mā\t bāp\t aur\t qrābat\t wāle,\t aur\t\naurtoñ\t ke\t liye\t hissa\t hai\t us\t meiñ\t se\t jo\t\nchord\tgaye\tmā\tbāp\taur\tqrābat\twāle,\ttarka\t\nthoda\t ho\t ya bahut,\t hissa\t hai\t andāza\t\nbāñdha\thuwa"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "9",
    "arabicText": "وَلْيَخْشَ ٱلَّذِينَ لَوْ تَرَكُوا۟ مِنْ خَلْفِهِمْ ذُرِّيَّةًۭ ضِعَـٰفًا خَافُوا۟ عَلَيْهِمْ فَلْيَتَّقُوا۟ ٱللَّهَ وَلْيَقُولُوا۟ قَوْلًۭا سَدِيدًا",
    "urduTranslationText": "",
    "englishTranslationText": ". And\t those\t people\t must\t fear,\t who\t if\t they\t\ndie\t leaving\t behind\t them\t young\t children\t\nwould\t be\t afraid\t for\t them;\t so\t they\t must\t\nfear\tAllah and\tspeak\twith\tfairness.\t\t\t\t",
    "romanUrduTranslationText": "Aur\t dareiñ\t woh\t log\t ke\t agar\t apne\t b'ad\t\nnatuwāñ\t aulād\t chordte\t to\t un\t ka\t kaisa\t\nunheiñ\tkhatra\thota\tto\tchāhiye\tke\tAllah\tse\t\ndareiñ\taur\tseedhi\tbāt\tkareiñ"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "10",
    "arabicText": "إِنَّ ٱلَّذِينَ يَأْكُلُونَ أَمْوَٰلَ ٱلْيَتَـٰمَىٰ ظُلْمًا إِنَّمَا يَأْكُلُونَ فِى بُطُونِهِمْ نَارًۭا ۖ وَسَيَصْلَوْنَ سَعِيرًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "Indeed\t those\t who\t unjustly\t devour\t the\t\nwealth\t of\t orphans\t only\t fill\t their\t bellies\t\nwith\t fire;\t and\t soon\t they\t will\t go\t into\t a\t\nblazing\tpit.\t",
    "romanUrduTranslationText": ". Woh\t jo\t yateemoñ\t ka\t māl\t na-haq\t khāte\t\nhaiñ\twoh\t to\tapne\tpet\tmeiñ\tniri\tāg\tbharte\t\nhaiñ\t aur\t koi\t dam\t jāta\t hai\t ke\t bhadakte\t\ndhade\t(Bhadakti\tĀg) meiñ\tjāyeñ\tge\t"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "11",
    "arabicText": "يُوصِيكُمُ ٱللَّهُ فِىٓ أَوْلَـٰدِكُمْ ۖ لِلذَّكَرِ مِثْلُ حَظِّ ٱلْأُنثَيَيْنِ ۚ فَإِن كُنَّ نِسَآءًۭ فَوْقَ ٱثْنَتَيْنِ فَلَهُنَّ ثُلُثَا مَا تَرَكَ ۖ وَإِن كَانَتْ وَٰحِدَةًۭ فَلَهَا ٱلنِّصْفُ ۚ وَلِأَبَوَيْهِ لِكُلِّ وَٰحِدٍۢ مِّنْهُمَا ٱلسُّدُسُ مِمَّا تَرَكَ إِن كَانَ لَهُۥ وَلَدٌۭ ۚ فَإِن لَّمْ يَكُن لَّهُۥ وَلَدٌۭ وَوَرِثَهُۥٓ أَبَوَاهُ فَلِأُمِّهِ ٱلثُّلُثُ ۚ فَإِن كَانَ لَهُۥٓ إِخْوَةٌۭ فَلِأُمِّهِ ٱلسُّدُسُ ۚ مِنۢ بَعْدِ وَصِيَّةٍۢ يُوصِى بِهَآ أَوْ دَيْنٍ ۗ ءَابَآؤُكُمْ وَأَبْنَآؤُكُمْ لَا تَدْرُونَ أَيُّهُمْ أَقْرَبُ لَكُمْ نَفْعًۭا ۚ فَرِيضَةًۭ مِّنَ ٱللَّهِ ۗ إِنَّ ٱللَّهَ كَانَ عَلِيمًا حَكِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": ". Allah commands\t you\t concerning\t your\t\nchildren;\tthe\tson’s\tshare\tis\tequal\tto\tthat\tof\t\ntwo\t daughters;\t and\t if\t there\t are\t only\t\ndaughters,\t for\t them\t is\t two-thirds\t of\t the\t\ninheritance,\t even\t if\t they\t are\t more\t than\t\ntwo;\tand\tif\tthere\tis\tonly\tone\tdaughter,\tfor\t\nher\tis\t half;\t and\t to\t each\t of\t the\t deceased’s\t\nparents\ta\tsixth\tof\tthe\tinheritance,\tif\the\thas\t\nchildren;\t and\t if\t the\t deceased\t has\t no\t\nchildren\tbut\tleaves\tbehind\tparents,\tthen\tone\tthird\tfor\tthe\tmother;\tand\tif\the\thas\tseveral\tbrothers\t\nand\tsisters,\ta\tsixth\tfor\tthe\tmother,\tafter\tany\twill\the\tmay\thave\tmade\tand\tpayment\tof\tdebt;\tyour\t\nfathers\tand\tyour\tsons\t- you\tdo\tnot\tknow\twhich\tof\tthem\twill\tbe\tmore\tuseful\tto\tyou;\tthis\tis\tthe\t\nshare\tfixed\tby\tAllah;\tindeed\tAllah is\tAll\tKnowing,\tWise.\t\t",
    "romanUrduTranslationText": "Allah\ttumheiñ\thukm\tdeta\thai\ttumhāri\taulād\tke\tbāre\tmeiñ\tbete\tka\thissa\tdo\tbetiyoñ\tbarābar\tphir\t\nagar\tniri\tladkiyāñ\thoñ\tagarche\tdo\tse\tupar\tto\tun\tko\ttarke\tki\tdo\ttehāi\taur\tagar\tek\tladki\tto\tuska\t\nādha\taur\tmayyat\tke\tmā\tbāp\tko\thar\tek\tko\tuske\ttarke\tse\tchata agar\tmayyat\tke\taulād\tho\tphir\tagar\t\nus\tki\taulād\tna\tho\taur\tmā\tbāp\tchorde\tto\tmā\tka\ttehāi\tphir\tagar\tus\tke\tkayi\tbehen\tbhāi\thoñ\tto\tmā\t\nka\tchata\tb'ad\tus\twasiyat\tke\tjo\tkar\tgaya\taur\tdain\tke\ttumhāre\tbāp\taur\ttumhāre\tbete\ttum\tkya\tjāno\t\nke\t un\t meiñ\t kaun\t tumhāre\t ziyāda\t kām\t āye\t ga\t yeh\t hissa\t bāñdha\t huwa\t hai\t Allah\t ki\t taraf\t se,\nbeshak\tAllah\tilm\twāla\thikmat\twāla\thai"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "12",
    "arabicText": "۞ وَلَكُمْ نِصْفُ مَا تَرَكَ أَزْوَٰجُكُمْ إِن لَّمْ يَكُن لَّهُنَّ وَلَدٌۭ ۚ فَإِن كَانَ لَهُنَّ وَلَدٌۭ فَلَكُمُ ٱلرُّبُعُ مِمَّا تَرَكْنَ ۚ مِنۢ بَعْدِ وَصِيَّةٍۢ يُوصِينَ بِهَآ أَوْ دَيْنٍۢ ۚ وَلَهُنَّ ٱلرُّبُعُ مِمَّا تَرَكْتُمْ إِن لَّمْ يَكُن لَّكُمْ وَلَدٌۭ ۚ فَإِن كَانَ لَكُمْ وَلَدٌۭ فَلَهُنَّ ٱلثُّمُنُ مِمَّا تَرَكْتُم ۚ مِّنۢ بَعْدِ وَصِيَّةٍۢ تُوصُونَ بِهَآ أَوْ دَيْنٍۢ ۗ وَإِن كَانَ رَجُلٌۭ يُورَثُ كَلَـٰلَةً أَوِ ٱمْرَأَةٌۭ وَلَهُۥٓ أَخٌ أَوْ أُخْتٌۭ فَلِكُلِّ وَٰحِدٍۢ مِّنْهُمَا ٱلسُّدُسُ ۚ فَإِن كَانُوٓا۟ أَكْثَرَ مِن ذَٰلِكَ فَهُمْ شُرَكَآءُ فِى ٱلثُّلُثِ ۚ مِنۢ بَعْدِ وَصِيَّةٍۢ يُوصَىٰ بِهَآ أَوْ دَيْنٍ غَيْرَ مُضَآرٍّۢ ۚ وَصِيَّةًۭ مِّنَ ٱللَّهِ ۗ وَٱللَّهُ عَلِيمٌ حَلِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t from\t what\t your\t wives\t leave,\t half\t is\t\nfor\tyou\tif\tthey\tdo\tnot\thave\tany\tchild;\tor\tif\t\nthey\t have\t a\t child\t for\t you\t is\t a\t fourth\t of\t\nwhat\t they\t leave,\t after\t any\t will\t they\t may\t\nhave\tmade\tor\tdebt\t to\tbe\tpaid;\tand\t to\t the\t\nwomen\t is\t a\t fourth\t of\t what\t you\t leave\t\nbehind,\tif\tyou\tdo\tnot\thave\tany\tchild;\tor\tif\t\nyou\t have\t a\t child\t then\t an\t eighth\t of\t what\t\nyou\tleave\t behind,\t after\t any\twill\t you\tmay\t\nhave\t made,\t or\t debt\t to\t be\t paid;\t and\t if\t a\t\ndeceased\tdoes\tnot\tleave\tbehind\ta\tmother,\t\nfather\t or\t children\t but\t has\t a\t brother\t or\t a\t\nsister\t through\ta\tcommon\tmother,\t then\t to\t\neach\tof\tthem\ta\tsixth;\tand\tif\tthey\t(brothers\t\nand\tsisters)\tare\tmore\t than\t two,\t then\t they\t\nshall\tall\tshare\tin\ta\tthird,\tafter\tany\twill\tthat\t\nmay\thave\tbeen\tmade\tor\tdebt\tto\tbe\tpaid,\tin\t\nwhich\tthe\tdeceased\thas\tnot\tcaused\ta\tloss\t\n(to\t the\t heirs);\t this\t is\t the\t decree\t of\tAllah;\t\nand\t Allah is\t All\t Knowing,\t Most\t\nForbearing.\t\t\t",
    "romanUrduTranslationText": "Aur\t tumhāri\t biwiyāñ\t jo\t chord\t jāyeñ\t us\t\nmeiñ\tse\ttumheiñ\tādha\thai\tagar\tun\tki\taulād\t\nna\t ho\t to\t un\t ke\t tarke\t meiñ\t se\t tumheiñ\t\nchauthāi\thai\tjo\twasiyat\twoh\tkar\tgayiñ\taur\t\ndain\t nikāl\t kar\t aur\t tumhāre\t tarke\t meiñ\t\naurtoñ\t ka\t chauthāi\t hai\t agar\t tumhāre\t\naulād\tna\tho\tphir\tagar\ttumhāre\taulād\tho\tto\t\nun\t ka\t tumhāre\t tarke\t meiñ\t se\t āthwāñ\t jo\t\nwasiyyat\t tum\t kar\t jāo\t aur\t dain\t nikāl\t kar\t\naur\tagar\t kisi\taise\tmard\t ya\taurat\t ka\t tarka\t\nbat-ta\t ho\t jis\t ne\t mā\t bāp\t aulād\t kuchh\t na\t\nchhode\t aur\t mā\t ki\t taraf\t se\t us\t ka\t bhāi\t ya\t\nbahen\thai\tto\tun\tmeiñ\tse\thar\tek\tko\tchhatā\t\nphir\t agar\t woh\t bahen\t bhāi\t ek\t se\t ziyāda\t\nhoñ\tto\tsab\ttihāi\tmeiñ\tshareek\thaiñ\tmayyat\t\nki\t wasiyat\t aur\t dain\t nikāl\t kar\t jis\t meiñ\t us\t\nne\tnuqsān\tna\tpahuñchāya\tho\tyeh\tAllah\tka\t\nirshād\t hai\t aur\t Allah\t ilm\t wāla\t hilm\t wāla\t\nhai."
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "13",
    "arabicText": "تِلْكَ حُدُودُ ٱللَّهِ ۚ وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ يُدْخِلْهُ جَنَّـٰتٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا ۚ وَذَٰلِكَ ٱلْفَوْزُ ٱلْعَظِيمُ",
    "urduTranslationText": "",
    "englishTranslationText": "These\tare\tthe\tlimits\tof\tAllah;\tand\twhoever\t\nobeys\t Allah and\t His\t Noble\t Messenger\t -\nAllah will\tadmit\thim\tinto\tGardens\tbeneath\t\nwhich\t rivers\t flow\t- abiding\t in\t it\t forever;\t\nand\tthis\tis\tthe\tgreat\tsuccess.\t\t\t\t",
    "romanUrduTranslationText": "Yeh\tAllah\tki\thadeiñ\thaiñ\taur\tjo\thukm\tmāne\tAllah\tke\taur\tAllah\tke\tRasool\tka\tAllah\tusey\tbāghoñ\t\nmeiñ\tle\tjāye\tga\tjin\tke\tneeche\tnahre\trawāñ\thamesha\tun\tmeiñ\traheñ\tge\taur\tyahi\thai\tbadi\tkāmyābi\n"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "14",
    "arabicText": "وَمَن يَعْصِ ٱللَّهَ وَرَسُولَهُۥ وَيَتَعَدَّ حُدُودَهُۥ يُدْخِلْهُ نَارًا خَـٰلِدًۭا فِيهَا وَلَهُۥ عَذَابٌۭ مُّهِينٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t whoever\t disobeys\t Allah and\t His\t\nNoble\tMessenger\tand\tcrosses\tall\tHis\tlimits\t- Allah will\tput\thim\tin\tthe\tfire\t(of\thell),\tin\twhich\the\t\nwill\tremain\tforever;\tand\tfor\thim\tis\ta\tdisgraceful\tpunishment.\t\t\t\t",
    "romanUrduTranslationText": "Aur\tjo\tAllah\taur\tus\tke\tRasool\tki\tna-farmāni\tkare\taur\tus\tki\tkul\thadoñ\tse\tbadh\tjāye\tAllah\tusey\tāag\t\nmeiñ\tdākhil\tkarega\tjis\tmeiñ\thameshā\trahega\taur\tus\tke\tliye\tkhuwāri\tka\t‘azāb\thai\n"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "15",
    "arabicText": "وَٱلَّـٰتِى يَأْتِينَ ٱلْفَـٰحِشَةَ مِن نِّسَآئِكُمْ فَٱسْتَشْهِدُوا۟ عَلَيْهِنَّ أَرْبَعَةًۭ مِّنكُمْ ۖ فَإِن شَهِدُوا۟ فَأَمْسِكُوهُنَّ فِى ٱلْبُيُوتِ حَتَّىٰ يَتَوَفَّىٰهُنَّ ٱلْمَوْتُ أَوْ يَجْعَلَ ٱللَّهُ لَهُنَّ سَبِيلًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\ttake\ttestimony\tfrom\tfour\tchosen\tmen\t\namongst\t you,\t against\t the\t women\t among\t\nyou\t who\t commit\t adultery;\t and\t if\t they\t\ntestify,\t confine\t those\t women\t in\t the\t\nhouses\t until\t death\t takes\t them\t away\t or\t\nAllah creates\ta\tsolution\tfor\tthem.\t\t\t\t\t",
    "romanUrduTranslationText": "5. Aur\t tumhāri\t aurtoñ\t meiñ\t jo\t badkāri\t\nkareiñ\t un\t par\t khās\t apne\t meiñ\t ke\t chār\t\nmardoñ\t ki\t gawāhi\t lo\t phir\t agar\t woh\t\ngawāhi\t de\t deiñ\t to\t un\t aurtoñ\t ko\t ghar\t\nmeiñ\t band\t rakho\t yahāñ\t tak\t ke\t unheiñ\t\nmaut\t uthā\t le\t ya Allah\t un\t ki\t kuchh\t rāh\t\nnikāle\n"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "16",
    "arabicText": "وَٱلَّذَانِ يَأْتِيَـٰنِهَا مِنكُمْ فَـَٔاذُوهُمَا ۖ فَإِن تَابَا وَأَصْلَحَا فَأَعْرِضُوا۟ عَنْهُمَآ ۗ إِنَّ ٱللَّهَ كَانَ تَوَّابًۭا رَّحِيمًا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t punish\t them\t both,\t the\t man\t and\t the\t\nwoman,\t whoever\t are\t guilty\t of\t it\t\n(adultery);\tthen\tif\tthey\trepent\tand\tbecome\t\npious,\t leave\t them;\t indeed\t Allah is\t the\t\nMost\t Acceptor\t Of\t Repentance,\t Most\t\nMerciful.\t\t\t",
    "romanUrduTranslationText": "Aur\t tum\t meiñ\t jo\t mard\t aurat\t aisa\t kām\t\nkareiñ\tun\tko\tizā\tdo\tphir\tagar\twoh\ttauba\t\nkar\tleñ\taur\tnek\tho\tjāyeñ\tto\tunka\tpeecha\t\nchhod\t do\t beshak\t Allah\t badā\t tauba\t\nqabool\tkarne\twāla\tmaherbān\thai\n"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "17",
    "arabicText": "إِنَّمَا ٱلتَّوْبَةُ عَلَى ٱللَّهِ لِلَّذِينَ يَعْمَلُونَ ٱلسُّوٓءَ بِجَهَـٰلَةٍۢ ثُمَّ يَتُوبُونَ مِن قَرِيبٍۢ فَأُو۟لَـٰٓئِكَ يَتُوبُ ٱللَّهُ عَلَيْهِمْ ۗ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "Undoubtedly\t the\t repentance\t which\tAllah\nhas\t by\t His\t grace\t made\t obligatory\t upon\t\nHimself\t to\t accept,\tis\t only\t the\t repentance\t\nof\tthose\twho\tcommit\tsin\tin\tfolly\tand\tthen\t\nsoon\t repent\t - towards\t them\t does\t Allah\nincline\t in\t mercy;\t and\t Allah is\t the\t All\t\nKnowing,\tthe\tWise.\t\t\t\t",
    "romanUrduTranslationText": "Aur\twoh\t tauba\tjiska\t qubool\t karna\tAllah\t\nne\tapne fazl\tse\tlāzim\tkar\tliya\thai\twoh\tun\t\nhi\t ki\thai\tjo\tna\tdāni\tse\tburāi\t kar\tbaitheñ\t\nphir\t thodi\t hi\t der\t meiñ\t tauba\t kar\t leñ\t\naisoñ\t par\t Allah\t apni\t rahmat\t se\t ruju'\t\nkarta\thai\taur\tAllah\tilm\to\thikmat\twāla\thai.\n"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "18",
    "arabicText": "وَلَيْسَتِ ٱلتَّوْبَةُ لِلَّذِينَ يَعْمَلُونَ ٱلسَّيِّـَٔاتِ حَتَّىٰٓ إِذَا حَضَرَ أَحَدَهُمُ ٱلْمَوْتُ قَالَ إِنِّى تُبْتُ ٱلْـَٔـٰنَ وَلَا ٱلَّذِينَ يَمُوتُونَ وَهُمْ كُفَّارٌ ۚ أُو۟لَـٰٓئِكَ أَعْتَدْنَا لَهُمْ عَذَابًا أَلِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t that\t repentance\t is\t not\t of\t those\t who\t\nconstantly\t commit\t sins,\t and\t when\t death\t\napproaches one\tof\tthem,\the\tsays,\t“I\trepent\t\nnow”,\t nor\t of\t those\t who\t die\t as\t\ndisbelievers;\t for\t them,\t We\t have\t kept\t\nprepared\ta\tpainful\tpunishment.\t\t\t\t\t",
    "romanUrduTranslationText": "Aur\t woh\t Tauba\t un\t ki\t nahi\t jo\t gunāhoñ\t\nmeiñ\tlage\trahte\thaiñ\tyahāñ\ttak\tke\tjab\tun\t\nmeiñ\tkisi\tko\tmaut\tāaye\t to\tkahe\tab\tmaiñ\t\nne\t tauba\t ki\taur\tna\t ki\tjo\t kāfir\tmareiñ\tun\t\nke\tliye\tham\tne\tdard-nāk\t‘azāb\ttayyār\tkar\t\nrakha\thai\n"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "19",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا يَحِلُّ لَكُمْ أَن تَرِثُوا۟ ٱلنِّسَآءَ كَرْهًۭا ۖ وَلَا تَعْضُلُوهُنَّ لِتَذْهَبُوا۟ بِبَعْضِ مَآ ءَاتَيْتُمُوهُنَّ إِلَّآ أَن يَأْتِينَ بِفَـٰحِشَةٍۢ مُّبَيِّنَةٍۢ ۚ وَعَاشِرُوهُنَّ بِٱلْمَعْرُوفِ ۚ فَإِن كَرِهْتُمُوهُنَّ فَعَسَىٰٓ أَن تَكْرَهُوا۟ شَيْـًۭٔا وَيَجْعَلَ ٱللَّهُ فِيهِ خَيْرًۭا كَثِيرًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "O\tPeople\twho\tBelieve!\t It\tis\tnot\tlawful\t for\t\nyou\tto\tforcibly\tbecome\tthe\twomen’s\theirs;\t\nand\t do\t not\t restrain\t women\t with\t the\t\nintention\t of\t taking\t away\t a\t part\t of\t bridal\t\nmoney\tyou\tgave\tthem,\tunless\tthey\topenly\tcommit\tthe\tshameful;\tand\tdeal\tkindly\twith\tthem;\tand\t\nif\t you\t do\t not\t like\t them,\t so\t it\t is\t possible\t that\t you\t dislike\t a\t thing\t in\t which\t Allah has\t placed\t\nabundant\tgood.\t\t\t\t",
    "romanUrduTranslationText": "Aey\t Imān\t wālo\t tumheiñ\t halāl\t nahi\t ke\t\naurtoñ\tke\twāris\tban\tjāo\tzabardasti\taur\taurtoñ\tko\troko\tnahi\tis\tniyyat\tse\tke\tjo\tmaher\tunko\tdiyā\t\ntha\t us\tmeiñ\t se\t kuchh\tle\tlo\tmagar\tis\t surat\tmeiñ\t ke\t sareeh\t be-hayāi\t ka\t kām\t kareiñ\t aur\t un\t se\t\nachha\tbartāo\tkaro\tphir\tagar\twoh\ttumheiñ\tpasand\tna\tāyeñ\tto\tqareeb\thai\tke\tkoi\tcheez\ttumheiñ\t\nna\tpasand\tho\taur\tAllah\tus\tmeiñ\tbahut\tbhalāi\trakhe\n"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "20",
    "arabicText": "وَإِنْ أَرَدتُّمُ ٱسْتِبْدَالَ زَوْجٍۢ مَّكَانَ زَوْجٍۢ وَءَاتَيْتُمْ إِحْدَىٰهُنَّ قِنطَارًۭا فَلَا تَأْخُذُوا۟ مِنْهُ شَيْـًٔا ۚ أَتَأْخُذُونَهُۥ بُهْتَـٰنًۭا وَإِثْمًۭا مُّبِينًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t if\t you\t wish\t to\t change\t one\t wife\t for\t\nanother\tand\t you\thave\tgiven\ther\theaps\t of\t\ntreasure,\t do\t not\t take\t back\tanything\t from\t\nit;\t will\t you\t take\t it\t back\t by\t slander\t and\t\nopen\tsin?\t",
    "romanUrduTranslationText": "Aur\t agar\t tum\t ek\t biwi\t ke\t badle\t doosri\t\nbadalna\t chāho\t aur\t usey\t dheroñ\t māl\t de\t\nchuke\tho\t to\tus\tmeiñ\tse\tkuch\twāpas\tna\tlo\t\nkya\tusey\twāpas\tloge\tjhoot\tbāndh\tkar\taur\t\nkhule\tgunāh\tse\n"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "21",
    "arabicText": "وَكَيْفَ تَأْخُذُونَهُۥ وَقَدْ أَفْضَىٰ بَعْضُكُمْ إِلَىٰ بَعْضٍۢ وَأَخَذْنَ مِنكُم مِّيثَـٰقًا غَلِيظًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t how\t will\t you\t take\t it\t back\t whereas\t\nyou\t have\t become\t unveiled\t before\t each\t\nother,\t and\t they\t have\t taken\t a\t strong\t\npledge\tfrom\tyou?\t",
    "romanUrduTranslationText": "Aur\t kiyuñ\t kar\t wāpas\t loge\t hālañ\t ke\t tum\t\nmeiñ\tek\tdoosre\tke\tsāmne\tbe-parda\tho\tliya\t\nhai\taur\twoh\ttum\tse\tgādha\tahed\tle\tchukiñ\t\n"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "22",
    "arabicText": "وَلَا تَنكِحُوا۟ مَا نَكَحَ ءَابَآؤُكُم مِّنَ ٱلنِّسَآءِ إِلَّا مَا قَدْ سَلَفَ ۚ إِنَّهُۥ كَانَ فَـٰحِشَةًۭ وَمَقْتًۭا وَسَآءَ سَبِيلًا ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t do\t not\t marry\t the\t women\t who\t were\t\nwedded\t to\t your\t fathers\t (and\t grand\t\nfathers),\texcept\twhat\thas\talready\tpassed;\t\nthat\t is\t indeed\t an\t act\t of\t shame\t and\t great\t\nwrong;\tand\tan\tevil\tway.\t",
    "romanUrduTranslationText": "Aur\t bāp\t dāda\t ki\t mankooha\t se\t nikāh\t na\t\nkaro\t magar\t jo\t ho\t guzrā\t woh\t beshak\t be\u0002hayāi\t aur\t ghazab\t ka\t kām\t hai\t aur\t bahut\t\nburi\trāh"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "23",
    "arabicText": "حُرِّمَتْ عَلَيْكُمْ أُمَّهَـٰتُكُمْ وَبَنَاتُكُمْ وَأَخَوَٰتُكُمْ وَعَمَّـٰتُكُمْ وَخَـٰلَـٰتُكُمْ وَبَنَاتُ ٱلْأَخِ وَبَنَاتُ ٱلْأُخْتِ وَأُمَّهَـٰتُكُمُ ٱلَّـٰتِىٓ أَرْضَعْنَكُمْ وَأَخَوَٰتُكُم مِّنَ ٱلرَّضَـٰعَةِ وَأُمَّهَـٰتُ نِسَآئِكُمْ وَرَبَـٰٓئِبُكُمُ ٱلَّـٰتِى فِى حُجُورِكُم مِّن نِّسَآئِكُمُ ٱلَّـٰتِى دَخَلْتُم بِهِنَّ فَإِن لَّمْ تَكُونُوا۟ دَخَلْتُم بِهِنَّ فَلَا جُنَاحَ عَلَيْكُمْ وَحَلَـٰٓئِلُ أَبْنَآئِكُمُ ٱلَّذِينَ مِنْ أَصْلَـٰبِكُمْ وَأَن تَجْمَعُوا۟ بَيْنَ ٱلْأُخْتَيْنِ إِلَّا مَا قَدْ سَلَفَ ۗ إِنَّ ٱللَّهَ كَانَ غَفُورًۭا رَّحِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "Forbidden\t for\t you\tare\t your\tmothers,\tand\t\nyour\t daughters,\t and\t your\t sisters,\t and\t\nyour\t father’s\t sisters,\t and\t your\t mother’s\t\nsisters,\tand\tyour\tbrothers’\tdaughters\tand\t\nyour\t sisters’\t daughters,\t and\t your\t foster\u0002mothers\t (who\t breast-fed\t you),\t and\t their\t\ndaughters\t (your\t foster-sisters),\t and\t your\t\nwives’\t mothers\t (mothers-in-law),\t and\t\nyour\t wives’\t daughters\t who\t are\t under\t\nyour\tprotection\t- born\tof\tthe\twomen\twith\t\nwhom\t you\t have\t cohabited;\t and\t if\t you\t\nhave\t not\t cohabited\t with\t them,\t then\t it\t is\t\nno\t sin\t for\t you\t to\t marry\t their\t daughters;\t\nand\t (forbidden\t are)\t the\t wives of\t your\t own\t sons\t (and\t foster-sons\t and\t grandsons)\t and\t the\t\nkeeping\tof\ttwo\tsisters\ttogether\tin\tmarriage,\texcept\twhat\thas\talready\tpassed;\tindeed\tAllah is\tOft\t\nForgiving,\tMost\tMerciful.\t",
    "romanUrduTranslationText": "Harām\thuwiñ\ttum\tpar\ttumhāri\tmāyeñ\taur\t\nbetiyāñ\t aur\t bahneiñ\t aur\t phuphiyāñ\t aur\t\nkhālāyeiñ\t aur\t bhateejiyāñ\t aur\t bhānjiyāñ\t\naur\t tumhāri māyeñ\t jinhoñ\t ne\t doodh\t\npilāya\taur\tdoodh\tki\tbahneiñ\taur\taurtoñ\tki\t\nmāyeñ\taur\tunki\tbetiyāñ jo\ttumhāri\tgoad\tmeiñ\thaiñ\tun\tbiwiyoñ\tse\tjin\tse\ttum\tsohbat\tkar\tchuke\t\nho\tphir\tagar\t tum\tne\tun\tse\tsohabat\tna\tki\tho\t to\tunki\tbetiyoñ\tmeiñ\tkoi\tharaj\tnahiñ\taur\t tumhāri\t\nnasli\tbetoñ\tki\tbiwiyāñ\taur\tdo\tbeheneiñ\tekhatti\tkarna\tmagar\tjo\tho\tguzra\tbeshak\tAllah\tbakhsh\tne\t\nwāla\tmaherbān\thai."
  }
]