[
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "59",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ أَطِيعُوا۟ ٱللَّهَ وَأَطِيعُوا۟ ٱلرَّسُولَ وَأُو۟لِى ٱلْأَمْرِ مِنكُمْ ۖ فَإِن تَنَـٰزَعْتُمْ فِى شَىْءٍۢ فَرُدُّوهُ إِلَى ٱللَّهِ وَٱلرَّسُولِ إِن كُنتُمْ تُؤْمِنُونَ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ ۚ ذَٰلِكَ خَيْرٌۭ وَأَحْسَنُ تَأْوِيلًا",
    "urduTranslationText": "",
    "englishTranslationText": "O\tPeople\twho\tBelieve!\tObey\tAllah and\tthe\tNoble\tMessenger\tand\tthose\tamongst\tyou\twho\tare\tin\t\nauthority;\tso\tif\tthere\tis\ta\tdispute\tamongst\tyou\tconcerning\tany\tmatter,\trefer\tit\tto Allah and\tthe\t\nNoble\tMessenger\t(for\tjudgement)\tif\tyou\tbelieve\tin\tAllah and\tthe\tLast\tDay;\tthis\tis\tbetter\tand\thas\t\nthe\tbest\toutcome.\t",
    "romanUrduTranslationText": "Aey\tImān\twālo!\tHukm\tmāno\tAllah\tka\taur\thukm\tmāno\tRasool\tka\taur\tunka\tjo\ttum\tmeiñ\thukumat\t\nwāle\thaiñ\tphir\tagar\ttum\tmeiñ\tkisi\tbāt\tka\tjhagadā\tuthe\tto\tusey\tAllah\twa Rasool\tke\thuzoor\truju'\t\nkaro\t agar\t Allah\t aur\t Qayāmat\t par\t Imān\t rakhte\t ho\t aur\t yeh\t behtar\t hai\t aur\t iskā\t anjām\t sab\t se\t\nachcha"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "60",
    "arabicText": "أَلَمْ تَرَ إِلَى ٱلَّذِينَ يَزْعُمُونَ أَنَّهُمْ ءَامَنُوا۟ بِمَآ أُنزِلَ إِلَيْكَ وَمَآ أُنزِلَ مِن قَبْلِكَ يُرِيدُونَ أَن يَتَحَاكَمُوٓا۟ إِلَى ٱلطَّـٰغُوتِ وَقَدْ أُمِرُوٓا۟ أَن يَكْفُرُوا۟ بِهِۦ وَيُرِيدُ ٱلشَّيْطَـٰنُ أَن يُضِلَّهُمْ ضَلَـٰلًۢا بَعِيدًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "Did\tyou\tnot\tsee\tthose\twhose\tclaim\tis\tthat\t\nthey\tbelieve\tin\twhat\thas\tbeen\tsent\tdown\t\non\t you\t and\t what\t was\t sent\t down\t before\t\nyou,\tand\tthey\tthen\twish\tto\tmake\tthe\tdevil\t\ntheir\tjudge,\twhereas\tthey\twere\tordered\tto\t\ncompletely\t reject\t him?\t And\t the\t devil\t\nwishes\tto\tmislead\tthem\tfar\tastray.\t",
    "romanUrduTranslationText": "Kya\ttum\tne\tunheiñ\tna\tdekhā\tJin\tka\tda'wa\t\nhai\t ke\t woh\t Imān\t lāye\t us\t par\t jo\t tumhāri\t\ntaraf\tutra\taur\tus\tpar\tjo\t tum\tse\tpahle\tutra\t\nphir\tchāhte\thaiñ\tke\tshaitān\tko\tapna\tpanch\t\nbanāyeiñ\taur\tunko\tto\thukm\tye\ttha\tke\tusey\t\naslan\tna\tmāneiñ\taur\tIblees\tyeh\tchāhta\thai\t\nke\tunheiñ\tdoor\tbehkā\tde"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "61",
    "arabicText": "وَإِذَا قِيلَ لَهُمْ تَعَالَوْا۟ إِلَىٰ مَآ أَنزَلَ ٱللَّهُ وَإِلَى ٱلرَّسُولِ رَأَيْتَ ٱلْمُنَـٰفِقِينَ يَصُدُّونَ عَنكَ صُدُودًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t when\t they\t are\t told,\t “Come\t towards\t\nthe\t Book\t sent\t down\t by\t Allah and\t to\t the\t\nNoble\t Messenger,”\t you\t will\t see\t that\t the\t\nhypocrites\t turn\t their\t faces\t away\t from\t\nyou\t",
    "romanUrduTranslationText": "Aur\t jab\t unse\t kahā\t jāye\t ke Allah\t ki\t utāri\t\nKitāb\taur\tRasool\tki\ttaraf\tāao\tto\ttum\tdekho\t\nge\tke\tmunāfiq\ttum\tse\tmuñh\tmod\tkar\tphir\t\njāte\thaiñ"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "62",
    "arabicText": "فَكَيْفَ إِذَآ أَصَـٰبَتْهُم مُّصِيبَةٌۢ بِمَا قَدَّمَتْ أَيْدِيهِمْ ثُمَّ جَآءُوكَ يَحْلِفُونَ بِٱللَّهِ إِنْ أَرَدْنَآ إِلَّآ إِحْسَـٰنًۭا وَتَوْفِيقًا",
    "urduTranslationText": "",
    "englishTranslationText": "What\twill\tbe\t their\tstate,\tif\tsome\tcalamity\t\nbefalls\tthem\tas\ta\tresult\tof\twhat their\town\t\nhands\t have\t sent\t before\t them\t- and\t then\t\nthey\t come\t to\t you\t (O\t dear\t Prophet\t\nMuhammad - peace\tand\tblessings\tbe\tupon\t\nhim),\t swearing\t by\t Allah that,\t “Our\t goal\t\nwas\t only\t to\t do\t good\t and\t create\t\nharmony\"?",
    "romanUrduTranslationText": "Kaisi\thogi\tjab\tunpar\tkoi\tuftād\t(Museebat)\t\npade\t badla\t uskā\t jo\t unke\t hāthoñ\t ne\t āage\t\nbhejā\t phir\t aey\t Mehboob tumhāre\t huzoor\t\nhāzir\thoñ\tAllah\tki\tqasam\tkhāte\tke\thamāra\t\nmaqsood\tto\tbhalāi\taur\tmel\thi\ttha."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "63",
    "arabicText": "أُو۟لَـٰٓئِكَ ٱلَّذِينَ يَعْلَمُ ٱللَّهُ مَا فِى قُلُوبِهِمْ فَأَعْرِضْ عَنْهُمْ وَعِظْهُمْ وَقُل لَّهُمْ فِىٓ أَنفُسِهِمْ قَوْلًۢا بَلِيغًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "The\tsecrets\tof\ttheir\thearts\tare\twell\tknown\t\nto\t Allah; so\t avoid\t them\t and\t explain\t to\t\nthem,\t and\t speak\t to\t them\t clearly\t in\t their\t\naffairs.\t",
    "romanUrduTranslationText": "Unke\tdiloñ\t ki\t to\t bāt\tAllah\tjānta\t hai\t to\t tum\t un\t se\t chashm\tposhi\t karo\taur\t unheiñ\t samjhāo\taur\t\nunke\tmu'āmle\tmeiñ\tunse\trasā\t(Asar\tkarne\twāli)\tbāt\tkaho"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "64",
    "arabicText": "وَمَآ أَرْسَلْنَا مِن رَّسُولٍ إِلَّا لِيُطَاعَ بِإِذْنِ ٱللَّهِ ۚ وَلَوْ أَنَّهُمْ إِذ ظَّلَمُوٓا۟ أَنفُسَهُمْ جَآءُوكَ فَٱسْتَغْفَرُوا۟ ٱللَّهَ وَٱسْتَغْفَرَ لَهُمُ ٱلرَّسُولُ لَوَجَدُوا۟ ٱللَّهَ تَوَّابًۭا رَّحِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\tWe\tdid\tnot\tsend\tany\tNoble\tMessenger\texcept\tthat\the\tbe\tobeyed\tby\tAllah’s\tcommand;\tand\tif\t\nthey,\t when\t they\t have\t wronged\t their\t own\t souls,\t come\t humbly\t to\t you\t (O\t dear\t Prophet\t\nMuhammad - peace\tand\tblessings\tbe\tupon\thim)\tand\tseek\tforgiveness\tfrom\tAllah,\tand\tthe\tNoble\t\nMessenger\t intercedes\t for\t them,\t they\t will\t certainly\t find\t Allah as\t the\t Most\t Acceptor\t Of\t\nRepentance,\tthe\tMost\tMerciful.\t\t",
    "romanUrduTranslationText": ". Aur\tham\tne\tkoi\tRasool\tna\tbhejā\tmagar\tis\tliye\tke\tAllah\tke\thukm\tse\tuski\tita‘at\tki\tjāye\taur\tagar\tjab\t\nwoh\tapni\tjānoñ\tpar\tzulm\t kareiñ\t to\taey\tMehboob tumhāre\thuzoor\thāzir\thoñ\taur\tphir\tAllah\t se\t\nmu'āfi\tchāheiñ\taur\tRasool\tunki\tshafa'at\tfarmāyeiñ\tto\tzaroor\tAllah\tko\tbahut\ttauba\tqabool\tkarne\t\nwāla\tmaherbān\tpāyeiñ"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "65",
    "arabicText": "فَلَا وَرَبِّكَ لَا يُؤْمِنُونَ حَتَّىٰ يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ ثُمَّ لَا يَجِدُوا۟ فِىٓ أَنفُسِهِمْ حَرَجًۭا مِّمَّا قَضَيْتَ وَيُسَلِّمُوا۟ تَسْلِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "So\tO\tdear\tProphet\t(Muhammad - peace\tand\tblessings be\tupon\thim),\tby\toath\tof\tyour\tLord,\tthey\t\nwill\tnot\tbe\tMuslims\tuntil\t they\tappoint\t you\ta\tjudge\t for\t the\tdisputes\tbetween\t them\t- and\t then\t\nwhatever\tyou\thave\tdecided,\tthey\tshould\tnot\tfind\topposition\tto\tit\twithin\ttheir\thearts,\tand\tthey\t\nmust\taccept\tit\twholeheartedly.\t",
    "romanUrduTranslationText": "To\taey\tMehboob tumhāre\tRab\tki\tqasam\twoh\tMusalman\tna\thoñ\tge\tjab\ttak\tapne\tāpas\tke\tjhagrde\t\nmeiñ\t tumheiñ\t hākim\t na\t banāyeiñ\t phir\t jo\t kuch\t tum\t hukm\t farmādo\t apne\t diloñ\t meiñ\t us\t se\t\nrukāwat\tna\tpāyeiñ\taur\tjee se\tmān\tleiñ"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "66",
    "arabicText": "وَلَوْ أَنَّا كَتَبْنَا عَلَيْهِمْ أَنِ ٱقْتُلُوٓا۟ أَنفُسَكُمْ أَوِ ٱخْرُجُوا۟ مِن دِيَـٰرِكُم مَّا فَعَلُوهُ إِلَّا قَلِيلٌۭ مِّنْهُمْ ۖ وَلَوْ أَنَّهُمْ فَعَلُوا۟ مَا يُوعَظُونَ بِهِۦ لَكَانَ خَيْرًۭا لَّهُمْ وَأَشَدَّ تَثْبِيتًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t had\t We\t decreed\t for\t them\t to\t slay\t\nthemselves\t or\t to\t leave\t their\t homes\t and\t\nfamilies,\t only\t a\t few\t of\t them\t would\t have\t\ndone\t it;\t and\t if\t they\t did\t what\t they\t are\t\nadvised\tto,\tit\twould\tbe\tgood\tfor\tthem,\tand\t\nwould\thave\tstrengthened\tfaith\t",
    "romanUrduTranslationText": "Aur\t agar\tHum\t un\t par\t farz\t karte\t ke\t apne\t\nāp\tko\tqatl\tkardo\t ya\tapne\tghar\twār\tchord\t\nkar\t nikal\t jāo\t to\t un\t meiñ\t thode\t hi\t aisā\t\nkarte\taur\tagar\twoh\tkarte\tjis\tbāt\tki\tunheiñ\t\nnasihat\t di\t jāti\t hai\t to\t us\t meiñ\t unka\t bhalā\t\ntha\taur\tImān\tpar\tkhoob\tjamna."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "67",
    "arabicText": "وَإِذًۭا لَّـَٔاتَيْنَـٰهُم مِّن لَّدُنَّآ أَجْرًا عَظِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t were\t it\t so,\t We\t would\t bestow\t upon\t\nthem\ta\tgreat\treward\tfrom\tOurselves.\t",
    "romanUrduTranslationText": "Aur\taisā\thota\t to\tzaroor\tham\tunheiñ\tapne\t\npās\tse\tbadā\tsawāb\tdete"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "68",
    "arabicText": "وَلَهَدَيْنَـٰهُمْ صِرَٰطًۭا مُّسْتَقِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t would\t certainly\t guide\t them\t to\t the\t\nStraight\tPath.\t",
    "romanUrduTranslationText": "Aur\t zaroor\t unko\t seedhi\t rāh\t ki\t hidāyat\t\nkarte."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "69",
    "arabicText": "وَمَن يُطِعِ ٱللَّهَ وَٱلرَّسُولَ فَأُو۟لَـٰٓئِكَ مَعَ ٱلَّذِينَ أَنْعَمَ ٱللَّهُ عَلَيْهِم مِّنَ ٱلنَّبِيِّـۧنَ وَٱلصِّدِّيقِينَ وَٱلشُّهَدَآءِ وَٱلصَّـٰلِحِينَ ۚ وَحَسُنَ أُو۟لَـٰٓئِكَ رَفِيقًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t whoever\t obeys\t Allah and\t His\t Noble\t\nMessenger,\twill\tbe\twith\tthose\tupon\twhom\t\nAllah has\t bestowed\t grace\t - that\t is,\t the\t\nProphets\tand\tthe\ttruthful\tand\tthe\tmartyrs\t\nand\t the\t virtuous;\t and\t what\t excellent\t\ncompanions\tthey\tare!\t",
    "romanUrduTranslationText": "Aur\t jo\t Allah\t aur\t uske\t Rasool\t ka\t hukm\t\nmāne\t to\t usey\t unka\t sāth\t milega\t jin\t par\t\nAllah\t ne\t fazl\t kiya\t y‘ani\t Ambiya\t aur\t\nSiddeeq\taur\tShaheed\taur\tNek\tlog\taur\tyeh\t\nkya\thi\tachche\tsāthi\thaiñ."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "70",
    "arabicText": "ذَٰلِكَ ٱلْفَضْلُ مِنَ ٱللَّهِ ۚ وَكَفَىٰ بِٱللَّهِ عَلِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "This\t is\t Allah’s\t munificence;\t and\t Allah is\t\nSufficient,\tthe\tAll\tKnowing.\t",
    "romanUrduTranslationText": "Yeh\tAllah\tka\tfazl\thai\taur\tAllah\tkāfi\thai\tjān\t\nne\twāla"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "71",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ خُذُوا۟ حِذْرَكُمْ فَٱنفِرُوا۟ ثُبَاتٍ أَوِ ٱنفِرُوا۟ جَمِيعًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "O\t People\t who\t Believe!\t Be\t cautious,\t then\t\nadvance\t towards\t the\t enemy\t in\t small\t\nnumbers\tor\tall\ttogether.\t",
    "romanUrduTranslationText": "Aey\t Imān\twālo!\tHoshiyāri\tse\tkām\tlo\tphir\t\ndushman\tki\ttaraf\tthode\tthode\thokar\tniklo\t\nya\tikhat-the\tchalo."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "72",
    "arabicText": "وَإِنَّ مِنكُمْ لَمَن لَّيُبَطِّئَنَّ فَإِنْ أَصَـٰبَتْكُم مُّصِيبَةٌۭ قَالَ قَدْ أَنْعَمَ ٱللَّهُ عَلَىَّ إِذْ لَمْ أَكُن مَّعَهُمْ شَهِيدًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "Indeed\t among\t you\t is\t one\t who\t will\t\ncertainly\t loiter\t behind;\t then\t if\t some\t\ndisaster\twere\tto\tbefall\tyou,\the\twould\tsay,\t\n“It\t was\tAllah’s\t grace\t upon\tme\t that\t I\t was\t\nnot\tpresent\twith\tthem!",
    "romanUrduTranslationText": "Aur\t tum\tmeiñ\t koi\twoh\t hai\t ke\t zaroor\t der\t\nlagāye\t ga\t phir agar\t tum\t par\t koi\t uftād\t\n(Museebat)\t pade\t to\t kahe\tKhuda\t ka\tmujh\t\npar\tehsān\ttha\tke\tmaiñ\tun\tke\tsāth\thāzir\tna\t\ntha."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "73",
    "arabicText": "وَلَئِنْ أَصَـٰبَكُمْ فَضْلٌۭ مِّنَ ٱللَّهِ لَيَقُولَنَّ كَأَن لَّمْ تَكُنۢ بَيْنَكُمْ وَبَيْنَهُۥ مَوَدَّةٌۭ يَـٰلَيْتَنِى كُنتُ مَعَهُمْ فَأَفُوزَ فَوْزًا عَظِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\twere\tyou\t to\treceive\tAllah’s\tmunificence\t(a\tbounty),\the\twould\tsurely\tsay\t- as\tif\t there\thad\t\nbeen\tno\t friendship\tbetween\tyou\tand\thim\t- “Alas\t- if\tonly\t I\thad\tbeen\twith\t them,\t I\twould\thave\t\nachieved\ta\tgreat\tsuccess!”\t",
    "romanUrduTranslationText": "Aur\tagar\ttumheiñ\tAllah\tka\tfazl\tmile\tto\tzaroor\tkahe\tgoya\ttum\tmeiñ\tus\tmeiñ\tkoi\tdosti\tna\tthi\taey\t\nkāsh\tmaiñ\tunke\tsāth\thota\tto\tbadi\tmurād\tpāta."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "74",
    "arabicText": "۞ فَلْيُقَـٰتِلْ فِى سَبِيلِ ٱللَّهِ ٱلَّذِينَ يَشْرُونَ ٱلْحَيَوٰةَ ٱلدُّنْيَا بِٱلْـَٔاخِرَةِ ۚ وَمَن يُقَـٰتِلْ فِى سَبِيلِ ٱللَّهِ فَيُقْتَلْ أَوْ يَغْلِبْ فَسَوْفَ نُؤْتِيهِ أَجْرًا عَظِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "So\t those\twho\t sell\t the\tlife\t of\t this\tworld\t for\t the\tHereafter,\tmust\t fight\tin\tAllah's\t cause;\tand\tWe\t\nshall\tbestow\ta\tgreat\treward\tupon\twhoever\tfights\tin\tAllah's\tcause,\twhether\the\tis\tmartyred\tor\tis\t\nvictorious.\t",
    "romanUrduTranslationText": ". To\tunheiñ\tAllah\tki\trāh\tmeiñ\tladna\tchāhiye\tjo\tduniya\tki\tzindagi\tbech\tkar\tĀkhirat\tlete\thaiñ\taur\tjo\t\nAllah\tki\trāh\tmeiñ\tlade\tphir\tmāra\tjāye\tya\tghālib\tāye\tto\tan-qareeb\tham\tusey\tbadā\tsawāb\tdeñge"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "75",
    "arabicText": "وَمَا لَكُمْ لَا تُقَـٰتِلُونَ فِى سَبِيلِ ٱللَّهِ وَٱلْمُسْتَضْعَفِينَ مِنَ ٱلرِّجَالِ وَٱلنِّسَآءِ وَٱلْوِلْدَٰنِ ٱلَّذِينَ يَقُولُونَ رَبَّنَآ أَخْرِجْنَا مِنْ هَـٰذِهِ ٱلْقَرْيَةِ ٱلظَّالِمِ أَهْلُهَا وَٱجْعَل لَّنَا مِن لَّدُنكَ وَلِيًّۭا وَٱجْعَل لَّنَا مِن لَّدُنكَ نَصِيرًا",
    "urduTranslationText": "",
    "englishTranslationText": "And\twhat\tis\tthe\tmatter\twith\tyou,\tthat\tyou\t\nshould\t not\t fight\t in\t Allah’s\t cause\t and\t for\t\nthe\tfeeble\tmen,\tand\twomen,\tand\tchildren,\t\nwho\tinvoke,\t “Our\t Lord!\t Liberate\t us\t from\t\nthis\ttown,\tthe\tpeople\tof\twhich\tare\tunjust;\t\nand\tgive\tus\ta\tprotector\tfrom\tYourself;\tand\t\ngive\tus\ta\tsupporter\tfrom\tYourself.”\t(Allah\nhas\t created\t many\t supporters\t for\t the\t\nbelievers.)\t",
    "romanUrduTranslationText": "Aur\ttumheiñ\tkiya\thuwa\tke\tna\tlado\tAllah\tki\t\nrāh\tmeiñ\taur\t kamzor\tmardoñ\taur\taurtoñ\t\naur\t bachchoñ\t ke\t wāste\t jo\t yeh\t dua\t kar\t\nrahe\t haiñ\t ke\t aey\t Rab\t hamāre\t hameiñ\t is\t\nbasti\t se\t nikāl\t jiske\t log\t zālim\t haiñ\t aur\t\nhameiñ\tapne\tpās\tse\tkoi\thimāyati\tde\tde\taur\t\nhameiñ\tapne\tpās\tse\tkoi\tmadad-gār\tde\tde."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "76",
    "arabicText": "ٱلَّذِينَ ءَامَنُوا۟ يُقَـٰتِلُونَ فِى سَبِيلِ ٱللَّهِ ۖ وَٱلَّذِينَ كَفَرُوا۟ يُقَـٰتِلُونَ فِى سَبِيلِ ٱلطَّـٰغُوتِ فَقَـٰتِلُوٓا۟ أَوْلِيَآءَ ٱلشَّيْطَـٰنِ ۖ إِنَّ كَيْدَ ٱلشَّيْطَـٰنِ كَانَ ضَعِيفًا",
    "urduTranslationText": "",
    "englishTranslationText": "The\t believers\t fight\t for\tAllah’s\t cause;\t and\t\nthe\tdisbelievers\tfight\tfor\tthe\tdevil’s\tcause\t\n- so\t fight\tagainst\t the\t friends\t of\t the\t devil;\t\nundoubtedly\t the\t devil’s\t conspiracy\t is\t\nweak",
    "romanUrduTranslationText": ". Imān\t wāle\t Allah\t ki\t rāh\t meiñ\t ladte\t haiñ\t\naur\t kuffar\t shaitān\t ki\t rāh\tmeiñ\tladte\t haiñ\t\nto\t shaitān\t ke\t dostoñ\t se\t lado\t beshak\t\nshaitān\tka\tdāo\tkamzor\thai."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "77",
    "arabicText": "أَلَمْ تَرَ إِلَى ٱلَّذِينَ قِيلَ لَهُمْ كُفُّوٓا۟ أَيْدِيَكُمْ وَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ فَلَمَّا كُتِبَ عَلَيْهِمُ ٱلْقِتَالُ إِذَا فَرِيقٌۭ مِّنْهُمْ يَخْشَوْنَ ٱلنَّاسَ كَخَشْيَةِ ٱللَّهِ أَوْ أَشَدَّ خَشْيَةًۭ ۚ وَقَالُوا۟ رَبَّنَا لِمَ كَتَبْتَ عَلَيْنَا ٱلْقِتَالَ لَوْلَآ أَخَّرْتَنَآ إِلَىٰٓ أَجَلٍۢ قَرِيبٍۢ ۗ قُلْ مَتَـٰعُ ٱلدُّنْيَا قَلِيلٌۭ وَٱلْـَٔاخِرَةُ خَيْرٌۭ لِّمَنِ ٱتَّقَىٰ وَلَا تُظْلَمُونَ فَتِيلًا",
    "urduTranslationText": "",
    "englishTranslationText": "Did\t you\t not\t see\t those\t to\t whom\t it\t was\t\nsaid,\t “Restrain\t your\t hands,\t keep\t the\t\nprayer\t established\t and\t pay\t the\t charity”;\t\nbut\twhen\tfighting\twas\tordained\tfor\tthem,\t\nsome\t of\t them\t started\t fearing\t people,\t the\t\nway\t they\t feared\t Allah - or\t even\t greater!\t\nAnd\t they\t said,\t “Our\t Lord!\tWhy\t have\t You\t\nordained\t fighting\t for\t us?\t If\t only\t You\t\nwould\thave\tlet\tus\tlive\tsome\tmore!”\tSay\t(O\t\ndear\t Prophet\t Muhammad - peace\t and\t\nblessings\tbe\tupon\thim),\t“The\tusage\tof\tthis\t\nworld\t is\t meagre;\t and\t the\t Hereafter\t is\t\nbetter\t for\t the\t pious;\t and\t you\t will\t not\t be\t\nwronged\t even\t (the\t weight\t of)\t a\t single\t\nthread.”",
    "romanUrduTranslationText": "Kya\t tumne\t unheiñ\t na\t dekha\t jinse\t kahā\t\ngaya\t apne\t hāth\t rok\t lo\t aur\t Namāz\t qāim\t\nrakho\t aur\tZakāt\t do\t phir\tjab\t un\t par\tjihād\t\nfarz\t kiya\t gaya\t to\t un\t meiñ\t b'az\t logoñ\t se\t\naisa\tdarne\tlage\tjaise\tAllah\tse\tdare\tya\tus\tse\t\nbhi\t zāid\t aur\t bole\t aey\t Rab\t hamāre\t tu\t ne\t\nham\t par\t jihād\t kiyuñ\t farz\t kar\t diya\t thodi\t\nmuddat\t tak\t hameiñ\t aur\t jeene\t diya\t hota\t\ntum\tfarmā\tdo\tke\tduniya\tka\tbaratna\tthoda\t\nhai\t aur\t dar\t wāloñ\t ke\t liye\t Ākhirat\t achchi\t\naur\ttum\tpar\ttāge\tbarābar\tzulm\tna\thoga."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "78",
    "arabicText": "أَأَيْنَمَا تَكُونُوا۟ يُدْرِككُّمُ ٱلْمَوْتُ وَلَوْ كُنتُمْ فِى بُرُوجٍۢ مُّشَيَّدَةٍۢ ۗ وَإِن تُصِبْهُمْ حَسَنَةٌۭ يَقُولُوا۟ هَـٰذِهِۦ مِنْ عِندِ ٱللَّهِ ۖ وَإِن تُصِبْهُمْ سَيِّئَةٌۭ يَقُولُوا۟ هَـٰذِهِۦ مِنْ عِندِكَ ۚ قُلْ كُلٌّۭ مِّنْ عِندِ ٱللَّهِ ۖ فَمَالِ هَـٰٓؤُلَآءِ ٱلْقَوْمِ لَا يَكَادُونَ يَفْقَهُونَ حَدِيثًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "Death\twill\tcome\tto\tyou\twherever\tyou\tmay\t\nbe,\teven\tif\t you\twere\tin\tstrong\t fortresses;\t\nif\tsome\tgood\treaches\tthem\tthey\tsay,\t“This\t\nis\t from\t Allah”;\t and\t if\t any\t misfortune\t\nreaches\tthem,\tthey\tsay,\t“This\tis\tfrom\tyou”;\tsay,\t“Everything\tis\tfrom\tAllah”;\twhat\tis\twrong\twith\t\nthese\tpeople,\tthat\tthey\tdo\tnot\tseem\tto\tunderstand\tanything?\t",
    "romanUrduTranslationText": "Tum\tjahāñ\tkaheeñ\tho\tmaut\ttumheiñ\tā legi\t\nagar-che\t mazboot\t qil'oñ\t meiñ\t ho\t aur\t\nunheiñ\tkoi\tbhalāi\tpahoñche\t to\tkaheñ\t yeh\t\nAllah\tki\ttaraf\tse\thai\taur\tunheiñ\tkoi\tburāyi\t\npahuñche\tto\tkaheñ\tyeh\thuzoor\tki\ttaraf\tse\t\nāayi\ttum\tfarmā\tdo\tsab\tAllah\tki\ttaraf\tse\thai\t\nto\tun\tlogoñ\tko\tkiya\thuwa\tkoi\tbāt\tsamajh\tte\tm‘aloom\thi\tnahi\thote."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "79",
    "arabicText": "مَّآ أَصَابَكَ مِنْ حَسَنَةٍۢ فَمِنَ ٱللَّهِ ۖ وَمَآ أَصَابَكَ مِن سَيِّئَةٍۢ فَمِن نَّفْسِكَ ۚ وَأَرْسَلْنَـٰكَ لِلنَّاسِ رَسُولًۭا ۚ وَكَفَىٰ بِٱللَّهِ شَهِيدًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "Whatever\t good\t reaches\t you,\t O\t listeners,\t is\t from\tAllah,\t and\t whatever\t ill\t reaches\t you\t is\t from\t\nyourselves;\tand\tWe\t have\t sent\t you\t(O\t dear\tProphet\tMuhammad - peace\t and\t blessings\t be\t upon\t\nhim)\tas\ta\tNoble\tMessenger\ttowards\tall\tmankind;\tand\tAllah is\tSufficient,\tas\ta\tWitness.\t",
    "romanUrduTranslationText": "Aey\tsun\tne\twāle\ttujhe\tjo\tbhalāi\tpahuñche\twoh\tAllah\tki\ttaraf\tse\thai\taur\tjo\tburāyi\tpahuñche\twoh\t\nteri\tapni\ttaraf\tse\thai\taur\taey\tMehboob ham\tne\ttumheiñ\tsab\tlogoñ\tke\tliye\tRasool\tbheja\taur\tAllah\t\nkāfi\thai\tgawāh."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "80",
    "arabicText": "مَّن يُطِعِ ٱلرَّسُولَ فَقَدْ أَطَاعَ ٱللَّهَ ۖ وَمَن تَوَلَّىٰ فَمَآ أَرْسَلْنَـٰكَ عَلَيْهِمْ حَفِيظًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "Whoever\tobeys\t the\tNoble\tMessenger\thas\t\nindeed\t obeyed\t Allah;\t and\t for\t those\t who\t\nturn\taway\t- We\thave\tnot\tsent\tyou\tas\ttheir\t\nsaviour.\t",
    "romanUrduTranslationText": "Jis\tne\tRasool\tka\thukm\tmāna\tbeshak\tus\tne\t\nAllah\t ka\t hukm\t māna\t aur\t jis\t ne\t mooñh\t\nphera\t to\t ham\t ne\t tumheiñ\t un\t ke\t bachāne\t\nko\tna\tbheja"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "81",
    "arabicText": "وَيَقُولُونَ طَاعَةٌۭ فَإِذَا بَرَزُوا۟ مِنْ عِندِكَ بَيَّتَ طَآئِفَةٌۭ مِّنْهُمْ غَيْرَ ٱلَّذِى تَقُولُ ۖ وَٱللَّهُ يَكْتُبُ مَا يُبَيِّتُونَ ۖ فَأَعْرِضْ عَنْهُمْ وَتَوَكَّلْ عَلَى ٱللَّهِ ۚ وَكَفَىٰ بِٱللَّهِ وَكِيلًا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t they\t say,\t “We\t have\t obeyed”;\t and\t\nwhen\t they\tgo\taway\t from\t you,\ta\tgroup\t of\t\nthem\t spend\t the\t night\t conspiring\t against\t\nwhat\t they\t had\t said;\t and\t Allah records\t\nwhat\tthey\tconspired\tby\tnight;\ttherefore\tO\t\ndear\t Prophet\t (Muhammad - peace\t and\t\nblessings\t be\t upon\t him)\t avoid\t them\t and\t\nrely\tupon\tAllah;\tand\tAllah is\tSufficient\tas\t\na\tTrustee\t(of\taffairs).",
    "romanUrduTranslationText": "Aur\t kahte\t haiñ\t ham\t ne\t hukm\t māna\t phir\t\njab\t tumhāre\t pās\t se\t nikal\t kar\tjāte\t haiñ\t to\t\nun\t meiñ\t ek\t giroh\t jo\t kah\t gaya\t tha\t uske\t\nkhilāf\t rāt\t ko\t mansūbe\t gānth-ta\t hai aur\t\nAllah\tlikh\trakhta\thai\tun\tke\trāt\tke\tmansūbe\t\nto\t aey\t Mehboob tum\t unse\t chashm\t poshi\t\nkaro\taur\tAllah\tpar\tbharosa\tkaro\taur\tAllah\t\nkāfi\thai\tkām\tbanāne\tko."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "82",
    "arabicText": "أَفَلَا يَتَدَبَّرُونَ ٱلْقُرْءَانَ ۚ وَلَوْ كَانَ مِنْ عِندِ غَيْرِ ٱللَّهِ لَوَجَدُوا۟ فِيهِ ٱخْتِلَـٰفًۭا كَثِيرًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "So\t do\t they\t not\t ponder\tabout\t the\tQur’an?\t\nAnd\t had\t it\t been\t from\t anyone\t besides\t\nAllah,\t they\t would\t certainly\t find\t much\t\ncontradiction\tin\tit.",
    "romanUrduTranslationText": "To\tkiya\tghaur\tnahi\tkarte\tQur'ān\tmeiñ\taur\t\nagar\twoh\tghair-e-khuda\tke\tpās\tse\thota\tto\t\nzaroor\tus\tmeiñ\tbahut\tikhtilāf\tpāte."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "83",
    "arabicText": "وَإِذَا جَآءَهُمْ أَمْرٌۭ مِّنَ ٱلْأَمْنِ أَوِ ٱلْخَوْفِ أَذَاعُوا۟ بِهِۦ ۖ وَلَوْ رَدُّوهُ إِلَى ٱلرَّسُولِ وَإِلَىٰٓ أُو۟لِى ٱلْأَمْرِ مِنْهُمْ لَعَلِمَهُ ٱلَّذِينَ يَسْتَنۢبِطُونَهُۥ مِنْهُمْ ۗ وَلَوْلَا فَضْلُ ٱللَّهِ عَلَيْكُمْ وَرَحْمَتُهُۥ لَٱتَّبَعْتُمُ ٱلشَّيْطَـٰنَ إِلَّا قَلِيلًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t when\t any\t news\t of\t safety\t or\t fear\t\ncomes\t to\t them,\t they\t speak\t of\tit\t publicly;\nand\t had\t they\t referred\t it\t to\t the\t Noble\t\nMessenger\t and\t to\t those\t among\t them\t\nhaving\tauthority,\t those\tamong\t them\twho\t\nare\table\tto\tinfer\twould\tcertainly\tlearn\tthe\t\ntruth\tof\tthe\tmatter\tfrom\tthem;\tand\twere\tit\t\nnot\tfor\tAllah’s\tmunificence\tupon\tyou,\tand\t\nHis\tmercy,\tall\tof\tyou\twould\thave\tcertainly\t\nfollowed\tSatan\t- except\ta\tfew.",
    "romanUrduTranslationText": ". Aur\tjab\tunke\tpās\tkoi\tbāt\titmenān\tya\tdar\tki\t\nāati\t hai\t us\t ka\t charcha\t kar\t baith-te\t haiñ\t\naur\t agar\t us\t meiñ\t Rasool\t aur\t apne\t zi\u0002ikhtiyār\tlogoñ\tki\t taraf\truju'\tlāte\t to\tzaroor\t\nun\t se\t uski\t haqeeqat\t jān\t lete\t yeh\t jo\t bāt\t\nmeiñ\tkāwish\tkarte\thaiñ\taur\tagar\t tum\tpar\t\nAllah\t ka\t fazl\t aur\t uski\t Rahmat\t na\t hoti\t to\t\nzaroor\t tum\t shaitān\t ke\t peeche\t lag\t jāte\t\nmagar\tthode."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "84",
    "arabicText": "فَقَـٰتِلْ فِى سَبِيلِ ٱللَّهِ لَا تُكَلَّفُ إِلَّا نَفْسَكَ ۚ وَحَرِّضِ ٱلْمُؤْمِنِينَ ۖ عَسَى ٱللَّهُ أَن يَكُفَّ بَأْسَ ٱلَّذِينَ كَفَرُوا۟ ۚ وَٱللَّهُ أَشَدُّ بَأْسًۭا وَأَشَدُّ تَنكِيلًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "Therefore\tO\tdear\tProphet,\t fight\tin\tAllah's\t\ncause;\t you\t will\t not\t be\t burdened\t except\t\nfor\tyourself,\tand\turge\tthe\tbelievers\t(to\tfight);\tit\tis\tlikely\tthat\tAllah will\tcurb\tthe\tstrength\tof\tthe\t\ndisbelievers;\tand\tAllah's\tstrike\tis\tmost\tstinging\tand\tHis\tpunishment\tthe\tmost\tsevere.\n",
    "romanUrduTranslationText": "To\t aey\t Mehboob Allah\t ki\t rāh\t meiñ\t lado\t tum\t takleef\t na\t diye\t jāoge\t magar\t apne\t dam\t ki\t aur\t\nMusalmānoñ\t ko\t amādah karo\t qareeb\t hai\t ke\t Allah\t kāfiroñ\t ki\t sakhti\t rok\t de\t aur Allah\t ki\t ānch\t\n(Girift)\tsab\tse\tsakht\ttar\thai\taur\tuska\t‘azāb\tsab\tse\tkarra\t(Zabardast\tSakht).\t"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "85",
    "arabicText": "مَّن يَشْفَعْ شَفَـٰعَةً حَسَنَةًۭ يَكُن لَّهُۥ نَصِيبٌۭ مِّنْهَا ۖ وَمَن يَشْفَعْ شَفَـٰعَةًۭ سَيِّئَةًۭ يَكُن لَّهُۥ كِفْلٌۭ مِّنْهَا ۗ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَىْءٍۢ مُّقِيتًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "Whoever\t makes\t a\t noble\t intercession\t will\t have\t a\t share\t of\t it,\t and\t whoever\t makes\t an\t evil\t\nintercession\twill\thave\ta\tshare\tof\tit;\tand\tAllah is\tAble\tto\tdo\tall\tthings\n",
    "romanUrduTranslationText": "Jo\tachchi\tsifārish\tkare\tuske\tliye\tus\tmeiñ\tse\thissa\thai\taur\tjo\tburi\tsifārish\tkare\tuske\tliye\tus\tmeiñ\t\nse\thissa\thai\taur\tAllah\thar\tcheez\tpar\tqādir\thai"
  }
]