[
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "24",
    "arabicText": "۞ وَٱلْمُحْصَنَـٰتُ مِنَ ٱلنِّسَآءِ إِلَّا مَا مَلَكَتْ أَيْمَـٰنُكُمْ ۖ كِتَـٰبَ ٱللَّهِ عَلَيْكُمْ ۚ وَأُحِلَّ لَكُم مَّا وَرَآءَ ذَٰلِكُمْ أَن تَبْتَغُوا۟ بِأَمْوَٰلِكُم مُّحْصِنِينَ غَيْرَ مُسَـٰفِحِينَ ۚ فَمَا ٱسْتَمْتَعْتُم بِهِۦ مِنْهُنَّ فَـَٔاتُوهُنَّ أُجُورَهُنَّ فَرِيضَةًۭ ۚ وَلَا جُنَاحَ عَلَيْكُمْ فِيمَا تَرَٰضَيْتُم بِهِۦ مِنۢ بَعْدِ ٱلْفَرِيضَةِ ۚ إِنَّ ٱللَّهَ كَانَ عَلِيمًا حَكِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\tall\tmarried\twomen\tare\tforbidden\tfor\t\nyou\texcept\t the\twives\tof\tdisbelievers\twho\t\ncome\t into\t your\t possession\t as\t\nbondwomen;\t this\t is\t Allah’s\t decree\t for\t\nyou;\tand\tother\t than\t these,\tall\twomen\tare\t\nlawful\t for\t you\t so\t that\t you\t seek\t them\t in\t\nexchange\t of\t your\t wealth\t in\t proper\t\nwedlock,\t not\t adultery;\t therefore\t give\t the\t\nwomen\t you\t wish\t to\t marry,\t their\t\nappointed\t bridal\t money;\t and\t after\t the\t\nappointment\t(of\tbridal\tmoney)\tthere\tis\tno\t\nsin\t on\t you\t if\t you\t come\t to\t a\t mutual\t\nagreement;\t indeed\t Allah is\t All\t Knowing,\t\nWise",
    "romanUrduTranslationText": "Aur\t harām\t haiñ\t shauhar-dār\t aurteiñ\t\nmagar\t kāfiroñ\t ki\t aurteiñ\tjo\t tumhāri\tmilk\t\nmeiñ āajāyeñ\t ye\t Allah\t ka\t nawishta\n(Muqarrar\tkardah)\thai\ttum\tpar\taur\tun\tke\t\nsiwa\t jo\t rahiñ\t woh\t tumheiñ\t halāl\t haiñ\t ke\t\napne\tmāloñ\tke\t‘ewaz\ttalāsh\tkaro\tqaid\tlāte\t\nna\tpāni\tgirāte\tto\tjin\taurtoñ\tko\tnikāh\tmeiñ\t\nlāna\t chāho\t unke\t bandhe\t huwe\t maher\t\nunheiñ\t do\t aur\t qarār-dād\t (Tai\t shuda)\t ke\t\nb‘ad\tagar\ttumhāre\tāpas\tmeiñ\t kuchh\t razā\t\nmandi\t ho\t jāye\t to\t is\t meiñ\t gunāh\t nahi\t\nbeshak\tAllah\tIlm-o-Hikmat\twāla\thai"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "25",
    "arabicText": "وَمَن لَّمْ يَسْتَطِعْ مِنكُمْ طَوْلًا أَن يَنكِحَ ٱلْمُحْصَنَـٰتِ ٱلْمُؤْمِنَـٰتِ فَمِن مَّا مَلَكَتْ أَيْمَـٰنُكُم مِّن فَتَيَـٰتِكُمُ ٱلْمُؤْمِنَـٰتِ ۚ وَٱللَّهُ أَعْلَمُ بِإِيمَـٰنِكُم ۚ بَعْضُكُم مِّنۢ بَعْضٍۢ ۚ فَٱنكِحُوهُنَّ بِإِذْنِ أَهْلِهِنَّ وَءَاتُوهُنَّ أُجُورَهُنَّ بِٱلْمَعْرُوفِ مُحْصَنَـٰتٍ غَيْرَ مُسَـٰفِحَـٰتٍۢ وَلَا مُتَّخِذَٰتِ أَخْدَانٍۢ ۚ فَإِذَآ أُحْصِنَّ فَإِنْ أَتَيْنَ بِفَـٰحِشَةٍۢ فَعَلَيْهِنَّ نِصْفُ مَا عَلَى ٱلْمُحْصَنَـٰتِ مِنَ ٱلْعَذَابِ ۚ ذَٰلِكَ لِمَنْ خَشِىَ ٱلْعَنَتَ مِنكُمْ ۚ وَأَن تَصْبِرُوا۟ خَيْرٌۭ لَّكُمْ ۗ وَٱللَّهُ غَفُورٌۭ رَّحِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "And\twhoever\tamong\tyou\tdoes\tnot\thave\tin\t\nmarriage\t free,\t believing\t women\t due\t to\t\npoverty,\tshould\tmarry\t from\t the\tbelieving\t\nbondwomen\t you\t own;\t and\t Allah knows\t\nwell\tyour\tfaith;\tyou\tare\tfrom\tone\tanother;\t\ntherefore\t marry\t them\t with\t the\t\npermission\t of\t their\t masters,\t and\t give\t\nthem\t their\t bridal\t money\t according\t to\t\ncustom,\t they\t becoming\t (faithful)\t wives,\t\nnot\t committing\t mischief\t or\t secretly\t\nmaking\tfriends;\tso\twhen\tthey\tare\tmarried\t\nand\tcommit\tthe\tshameful,\tfor\tthem\tis\thalf\t\nthe\t punishment\t prescribed\t for\t free\t women;\t this\tis\t for\t one\t among\t you\t who\t fears\t falling\tinto\t\nadultery;\tand\tto\tpractice\tpatience\tis\tbetter\tfor\tyou;\tand\tAllah is\tOft\tForgiving,\tMost\tMerciful.\t",
    "romanUrduTranslationText": "Aur\t tum\tmeiñ\tbe\tmaqdoori\tke\tba‘is\tjinke\t\nNikāh\tmeiñ\tāzād\taurteiñ\tImān\twāliyāñ\tna\t\nhoñ\tto\tunse\tNikāh\tkare\tjo\ttumhāre\thāth\tki\t\nmilk\t haiñ\t Imān\t wāli\t kanizeiñ\t aur\t Allah\t\ntumhāre\t Imān\t ko\t khoob\t jānta\t hai\t tum\t\nmeiñ\tek\t doosre\t se\t hai\t to\t unse\tNikāh\t karo\t unke\tmālikoñ\t ki\tijāzat\t se\taur\t hasb-e-dastoor\t unke\t\nmaher\tunheiñ\tdo\tqaid\tmeiñ\tātiyāñ\tna\tmasti\tnikālti\taur\tna\tyār\tbanāti\tjab\twoh\tqaid\tmeiñ\tājāyeiñ\t\nphir\tburā\tkām\tkareiñ\tto\tun\tpar us\tsazā\tki\tādhi\thai\tjo\tāzād\taurtoñ\tpar\thai\tyeh\tus\tke\tliye\tjise\ttum\t\nmeiñ\tse\tzina\tka\tandesha\thai\taur\tsabr\tkarna\ttumhāre\tliye\tbehtar\thai\taur\tAllah\tbakhsh\tne\twāla\t\nmaherbān\thai"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "26",
    "arabicText": "يُرِيدُ ٱللَّهُ لِيُبَيِّنَ لَكُمْ وَيَهْدِيَكُمْ سُنَنَ ٱلَّذِينَ مِن قَبْلِكُمْ وَيَتُوبَ عَلَيْكُمْ ۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "Allah wills\tto\texplain\tHis\tcommands\tto\tyou\tand\tshow\tyou\tthe\tways\tof\tthose\tbefore\tyou,\tand\tto\t\nincline\ttowards\tyou\twith\tHis\tmercy;\tand\tAllah is\tAll\tKnowing,\tWise.",
    "romanUrduTranslationText": "Allah\tchāhta\thai\tke\tapne\tahkām\ttumhāre\tliye\tsāf\tbayān\tkar\tde\taur\ttumheiñ\tagloñ\tki\trawisheiñ\n(taur\ttariqe)\tbatā\tde\taur\ttum\tpar\tapni\tRahmat\tse\trujú farmāye\taur\tAllah\tIlm-o-Hikmat\twāla\thai."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "27",
    "arabicText": "وَٱللَّهُ يُرِيدُ أَن يَتُوبَ عَلَيْكُمْ وَيُرِيدُ ٱلَّذِينَ يَتَّبِعُونَ ٱلشَّهَوَٰتِ أَن تَمِيلُوا۟ مَيْلًا عَظِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "And\t Allah wills\t to\t incline\t towards\t you\t\nwith\t His\t mercy;\t and\t those\t who\t pursue\t\ntheir\t own\t pleasures\twish\t that\t you\t be\t far\t\nseparated\tfrom\tthe\tStraight\tPath.\t",
    "romanUrduTranslationText": "Aur\t Allah\t tum\t par\t apni\t Rahmat\t se\t rujú\nfarmāna\tchāhta\thai\taur\tjo\tapne\tmazoñ\tke\t\npeeche\t pardhe\t haiñ\t woh\t chāhte\t haiñ\t ke\t\ntum\tseedhi\trāh\tse\tbahut\talag\tho\tjāo."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "28",
    "arabicText": "يُرِيدُ ٱللَّهُ أَن يُخَفِّفَ عَنكُمْ ۚ وَخُلِقَ ٱلْإِنسَـٰنُ ضَعِيفًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "Allah wills\t to\t lessen\t your\t burden;\t and\t\nman\twas\tcreated\tweak.\t",
    "romanUrduTranslationText": ". Allah\t chāhta\t hai\t ki tum\t par\t takhfeef\n(āsāni) kare\t aur\t ādmi\t kamzor\t banāya\t\ngayā"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "29",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَأْكُلُوٓا۟ أَمْوَٰلَكُم بَيْنَكُم بِٱلْبَـٰطِلِ إِلَّآ أَن تَكُونَ تِجَـٰرَةً عَن تَرَاضٍۢ مِّنكُمْ ۚ وَلَا تَقْتُلُوٓا۟ أَنفُسَكُمْ ۚ إِنَّ ٱللَّهَ كَانَ بِكُمْ رَحِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "O\t People\t who\t Believe!\t Do\t not\t unjustly\t\ndevour\tthe\tproperty\tof\teach\tother,\texcept\t\nthrough\t trade\t by\tmutual\t agreement;\t and\t\ndo\t not\t kill\t yourselves;\t indeed\t Allah is\t\nMost\tMerciful\tupon\tyou.\t",
    "romanUrduTranslationText": "Aey\t Imān\t wālo!\t Āpas\t meiñ\t ek\t doosre\t ke\t\nmāl\t na-haq\t na\t khāo\t magar\t yeh\t ke\t koi\t\nsauda\t tumhāri\t bāhami\t raza\t mandi\t ka\t ho\t\naur\tapni\tjāneiñ\tqatl\tna\tkaro\tbeshak\tAllah\t\ntum\tpar\tmaherbān\thai."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "30",
    "arabicText": "وَمَن يَفْعَلْ ذَٰلِكَ عُدْوَٰنًۭا وَظُلْمًۭا فَسَوْفَ نُصْلِيهِ نَارًۭا ۚ وَكَانَ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرًا",
    "urduTranslationText": "",
    "englishTranslationText": "And\twhoever\t does\t that\t through\tinjustice\t\nand\toppression,\tWe\tshall\tsoon\tput\thim\tin\t\nthe\tfire;\tand\tthis\tis\teasy\tfor\tAllah.",
    "romanUrduTranslationText": "Aur\t jo\t zulm-o-ziyādati\t se\t aisa\t karega\t to\t\nan-qareeb\t ham\t usey\t āg\t meiñ\t dākhil\t\nkareñge\taur\tyeh\tAllah\tko\tāsān\thai"
  }
]