[
  {
    "juz": {
      "id": "17"
    },
    "surah": {
      "id": "22"
    },
    "ayatNumber": "66",
    "arabicText": "وَهُوَ ٱلَّذِىٓ أَحْيَاكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ ۗ إِنَّ ٱلْإِنسَـٰنَ لَكَفُورٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tit\tis\tHe\tWho\t gave\t you\tlife,\t then\t will\t\ncause\tyou\tto\tdie,\tand\twill\tthen\trevive\tyou;\t\nindeed\tman\tis\tvery\tungrateful.\t",
    "romanUrduTranslationText": "Aur\t Wohi\t Hai\t Jisne\t tumheiñ\t zinda\t kiya\t\nphir\t tumheiñ\t māregā\t phir\t tumheiñ\t\njilāyegā\tbe-shak\tādmi\tbadā\tnā-shukrā\thai"
  },
  {
    "juz": {
      "id": "17"
    },
    "surah": {
      "id": "22"
    },
    "ayatNumber": "67",
    "arabicText": "لِّكُلِّ أُمَّةٍۢ جَعَلْنَا مَنسَكًا هُمْ نَاسِكُوهُ ۖ فَلَا يُنَـٰزِعُنَّكَ فِى ٱلْأَمْرِ ۚ وَٱدْعُ إِلَىٰ رَبِّكَ ۖ إِنَّكَ لَعَلَىٰ هُدًۭى مُّسْتَقِيمٍۢ",
    "urduTranslationText": "",
    "englishTranslationText": "For\t each\t nation\tWe\t have\tmade\t the\t rules\t\nof\t worship\t for\t them\t to\t follow\t- so\t never\t\nshould\t they\t quarrel\t with\t you\t in\t this\t\nmatter\t – and\t call\t them\t towards\t your\t\nLord;\t indeed\t you\t are\t upon\t the\t Straight\t\nPath.\t",
    "romanUrduTranslationText": "Har\t Ummat\t ke\t liye\t Hamne\t ibādat\t ke\t\nQ’āide\tbanā\tdiye\tke\twoh\tunpar\tchaleiñ\tto\t\nhar-giz\twoh\ttumse\tis\tmuāmle\tmeiñ\tjhagdā\t\nna\t kareñ\taur\tapne\tRab\tki\t taraf\t bulāo\t be\u0002shak\ttum\tseedhi\trāh\tpar\tho"
  },
  {
    "juz": {
      "id": "17"
    },
    "surah": {
      "id": "22"
    },
    "ayatNumber": "68",
    "arabicText": "وَإِن جَـٰدَلُوكَ فَقُلِ ٱللَّهُ أَعْلَمُ بِمَا تَعْمَلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t if\t they\t quarrel\t with\t you,\t say,\t “Allah\nwell\tknows\tyour\tevil\tdeeds.”\t",
    "romanUrduTranslationText": "Aur\tagar\twoh\ttumse\tjhagdeiñ\tto\tfarmā\tdo\t\nke\tAllah\tkhoob\tjānta\thai\ttumhāre\tkotak"
  },
  {
    "juz": {
      "id": "17"
    },
    "surah": {
      "id": "22"
    },
    "ayatNumber": "69",
    "arabicText": "ٱللَّهُ يَحْكُمُ بَيْنَكُمْ يَوْمَ ٱلْقِيَـٰمَةِ فِيمَا كُنتُمْ فِيهِ تَخْتَلِفُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Allah will\t judge\t between\t you\t on\t the\t Day\t\nof\t Resurrection\t concerning\t what\t you\t\ndispute.\t",
    "romanUrduTranslationText": "Allah\ttum\tmeiñ\tfaisla\tkardegā\tQayāmat\tke\t\ndin\tjis\tbāt\tmeiñ\tikhtilāf\tkar\trahe\tho."
  },
  {
    "juz": {
      "id": "17"
    },
    "surah": {
      "id": "22"
    },
    "ayatNumber": "70",
    "arabicText": "أَلَمْ تَعْلَمْ أَنَّ ٱللَّهَ يَعْلَمُ مَا فِى ٱلسَّمَآءِ وَٱلْأَرْضِ ۗ إِنَّ ذَٰلِكَ فِى كِتَـٰبٍ ۚ إِنَّ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "Did\t you\t not\t realise\t that\t Allah knows\t all\t\nthat\t is\t in\t the\t heavens\t and\t in\t the\t earth?\t\nIndeed\tall\tthis\tis\tin\ta\tBook;\tindeed\tthis\tis\t\neasy\tfor\tAllah.\t",
    "romanUrduTranslationText": "Kyā\ttune\tna\tjānā\tke\tAllah\tjānta\thai\tjo\tkuch\t\nāsmānoñ\t aur\t zameen\t meiñ\t hai\t be-shak\t\nyeh\t sab\t ek\t Kitāb\t meiñ\t hai\t be-shak\t yeh\t\nAllah\tpar\tāasān\thai."
  },
  {
    "juz": {
      "id": "17"
    },
    "surah": {
      "id": "22"
    },
    "ayatNumber": "71",
    "arabicText": "وَيَعْبُدُونَ مِن دُونِ ٱللَّهِ مَا لَمْ يُنَزِّلْ بِهِۦ سُلْطَـٰنًۭا وَمَا لَيْسَ لَهُم بِهِۦ عِلْمٌۭ ۗ وَمَا لِلظَّـٰلِمِينَ مِن نَّصِيرٍۢ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t they\t worship\t those\t instead\t of\t Allah\nregarding\twhom\tHe\thas\tnot\tsent\tdown\tany\tproof,\tand\tthose\tregarding\twhom\tthey\tthemselves\t\ndo\tnot\thave\tany\tknowledge;\tand\tthere\tare\tno\tsupporters\tfor\tthe\tunjust.\t",
    "romanUrduTranslationText": "Aur\tAllah\tke\tsiwā\taiso\tko\tpoojte\thaiñ\tjinki\tkoi\tsanad\tusne\tna\tutāri\taur\taiso\tko\tjinka\tkhud\tunheiñ\t\nkuch\tÍlm\tnahiñ\taur\tsitamgāroñ\tka\tkoi\tmadad-gār\tnahiñ."
  },
  {
    "juz": {
      "id": "17"
    },
    "surah": {
      "id": "22"
    },
    "ayatNumber": "72",
    "arabicText": "وَإِذَا تُتْلَىٰ عَلَيْهِمْ ءَايَـٰتُنَا بَيِّنَـٰتٍۢ تَعْرِفُ فِى وُجُوهِ ٱلَّذِينَ كَفَرُوا۟ ٱلْمُنكَرَ ۖ يَكَادُونَ يَسْطُونَ بِٱلَّذِينَ يَتْلُونَ عَلَيْهِمْ ءَايَـٰتِنَا ۗ قُلْ أَفَأُنَبِّئُكُم بِشَرٍّۢ مِّن ذَٰلِكُمُ ۗ ٱلنَّارُ وَعَدَهَا ٱللَّهُ ٱلَّذِينَ كَفَرُوا۟ ۖ وَبِئْسَ ٱلْمَصِيرُ",
    "urduTranslationText": "",
    "englishTranslationText": "And\twhen\tOur\tclear\tverses\tare\trecited\tto\tthem,\tyou\twill\tsee\ttraces\tof\tanger\tin\tthe\tfaces\tof\tthe\t\ndisbelievers;\tpossibly\tthey\tmay\tattack\tthose\twho\trecite\tOur\tverses\tto\tthem;\tsay,\t“Shall\tI\tshow\t\nyou\t what\t is\t worse\t than\t your\t current\t state?\t That\t is\t the\t fire!\t Allah has\t promised\t it\t to\t the\t\ndisbelievers;\tand\twhat\ta\twretched\tplace\tto\treturn!”\t\n",
    "romanUrduTranslationText": "Aur\tjab\tun\tpar\tHamāri\traushan\tĀyateiñ\tpadhi\tjāyeiñ\tto\ttum\tunke\tchehroñ\tpar\tbigadne\tke\tāsār\t\ndekhoge\tjinhoñ\tne\tkufr\tkiya\tqareeb\thai\tke\tpalat\tpadeiñ\tunko\tjo\thamāri\tĀyateiñ\tunpar\tpadhte\t\nhaiñ,\ttum\tfarmādo\tkya\tmaiñ\ttumheiñ\tbatā\tduñ\tjo\ttumhāre\tis\thāl\tse\tbhi\tbad-tar\thai\twoh\tāg\thai\t\nAllah\tne\tiskā\tw’adā\tdiyā\thai\tkāfiroñ\tko\taur\tkya\thi\tburi\tpalatne\tki\tjagāh.\t"
  },
  {
    "juz": {
      "id": "17"
    },
    "surah": {
      "id": "22"
    },
    "ayatNumber": "73",
    "arabicText": "يَـٰٓأَيُّهَا ٱلنَّاسُ ضُرِبَ مَثَلٌۭ فَٱسْتَمِعُوا۟ لَهُۥٓ ۚ إِنَّ ٱلَّذِينَ تَدْعُونَ مِن دُونِ ٱللَّهِ لَن يَخْلُقُوا۟ ذُبَابًۭا وَلَوِ ٱجْتَمَعُوا۟ لَهُۥ ۖ وَإِن يَسْلُبْهُمُ ٱلذُّبَابُ شَيْـًۭٔا لَّا يَسْتَنقِذُوهُ مِنْهُ ۚ ضَعُفَ ٱلطَّالِبُ وَٱلْمَطْلُوبُ",
    "urduTranslationText": "",
    "englishTranslationText": "O\t people,\t an\t example\tis\t being\tillustrated\t\ntherefore\t listen\t to\t it\t attentively;\t “Those\t\nwhom\t you\t worship\t besides\t Allah can\t\nnever\t create\t a\t fly\t even\t if\t they\t all\t come\t\ntogether\t for\t it;\t and\t if\t a\t fly\t took\t away\t\nsomething\t from\t them,\t they\t cannot\t\nretrieve\t that\t from\t it; how\t weak\t are\t the\t\nseeker\tand\tthe\tsought!”",
    "romanUrduTranslationText": "Aye\tlogo, ek\tkahāwat\tfarmāyi\tjāti\thai\tisey\t\nkān\t lagākar\t suno; “Woh\t jinheiñ\t Allah\t ke\t\nsiwā\t tum\t poojte\t ho\t ek\t Makkhi\t na\t banā\t\nsakeñge\t agar-che\t sab\t uspar\t ekhatte\t ho\t\njayeiñ; aur\t agar\tMakkhi\t unse\t kuch\t cheen\t\nkar\t le\t jāye, to\t us-se\t churdā\t na\t sakeiñ;\nkitnā\t kamzor\t chāhne\t wāla\t aur\t woh\t jisko\t\nchāhā!”\t"
  },
  {
    "juz": {
      "id": "17"
    },
    "surah": {
      "id": "22"
    },
    "ayatNumber": "74",
    "arabicText": "مَا قَدَرُوا۟ ٱللَّهَ حَقَّ قَدْرِهِۦٓ ۗ إِنَّ ٱللَّهَ لَقَوِىٌّ عَزِيزٌ",
    "urduTranslationText": "",
    "englishTranslationText": "They\t did\t not\t realise\t the\t importance\t of\t\nAllah as\t was\t His\t right;\t indeed\t Allah is\t\nAlmighty,\tDominant.\t",
    "romanUrduTranslationText": "Allah\t ki\tQadr\t na\tjāni\tjaisi\t chāhiye\t thi\t be\u0002shak\tAllah\tQuwwat\twāla\tGhālib\thai\t\t"
  },
  {
    "juz": {
      "id": "17"
    },
    "surah": {
      "id": "22"
    },
    "ayatNumber": "75",
    "arabicText": "ٱللَّهُ يَصْطَفِى مِنَ ٱلْمَلَـٰٓئِكَةِ رُسُلًۭا وَمِنَ ٱلنَّاسِ ۚ إِنَّ ٱللَّهَ سَمِيعٌۢ بَصِيرٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "Allah chooses\tthe\tNoble\tMessengers\tfrom\t\nthe\tangels,\tand\tfrom\tmen;\tindeed\tAllah is\t\nAll\tHearing,\tAll\tSeeing.\t",
    "romanUrduTranslationText": "Allah\t chun\t letā\t hai\t Firishtoñ\t meiñ\t se\t\nRasool\taur\tādmiyoñ\tmeiñ\tse\tbe-shak\tAllah\t\nsuntā\tdekhtā\thai"
  },
  {
    "juz": {
      "id": "17"
    },
    "surah": {
      "id": "22"
    },
    "ayatNumber": "76",
    "arabicText": "يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۗ وَإِلَى ٱللَّهِ تُرْجَعُ ٱلْأُمُورُ",
    "urduTranslationText": "",
    "englishTranslationText": ". He\t knows\t all\t that\t is\t before\t them\t and\t all\t\nthat\tis\tbehind\tthem;\tand\ttowards\tAllah is\t\nthe\treturn\tof\tall\tmatters.\t",
    "romanUrduTranslationText": "Jāntā\t hai\t jo\t unke\t āage\t hai\t aur\t jo\t unke\t\npeeche\thai\taur\tsab\tkāmoñ\tki\truju’\tAllah\tki\t\ntaraf\thai\t."
  },
  {
    "juz": {
      "id": "17"
    },
    "surah": {
      "id": "22"
    },
    "ayatNumber": "77",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱرْكَعُوا۟ وَٱسْجُدُوا۟ وَٱعْبُدُوا۟ رَبَّكُمْ وَٱفْعَلُوا۟ ٱلْخَيْرَ لَعَلَّكُمْ تُفْلِحُونَ ۩",
    "urduTranslationText": "",
    "englishTranslationText": "O\tPeople\twho\tBelieve,\tbow\tand\tprostrate\t\nyourselves,\t and\t worship\t your\t Lord,\t and\t\ndo\t good\t deeds\t in\t the\t hope\t of\t attaining\t\nsalvation.\t(Command\tof\tProstration as\tper\t\nImam\t Shaafi\t – may\tAllah be\t pleased\t with\t\nhim)\t",
    "romanUrduTranslationText": "Aye\t Imān\twāloñ,\tRuku’ aur\t Sajdah karo\t aur\t apne\tRab\t ki\tbandagi\t karo\t aur\t bhale\t kām\t karo\tis\t\nummeed\t par\t ke\t tumheiñ\t chutkārā\t ho. (Sajde\t ka\t Hukm,\t Imam\t Shaafi\t Alayhir\t Rahma\t ke\t\nnazdeek)"
  },
  {
    "juz": {
      "id": "17"
    },
    "surah": {
      "id": "22"
    },
    "ayatNumber": "78",
    "arabicText": "وَجَـٰهِدُوا۟ فِى ٱللَّهِ حَقَّ جِهَادِهِۦ ۚ هُوَ ٱجْتَبَىٰكُمْ وَمَا جَعَلَ عَلَيْكُمْ فِى ٱلدِّينِ مِنْ حَرَجٍۢ ۚ مِّلَّةَ أَبِيكُمْ إِبْرَٰهِيمَ ۚ هُوَ سَمَّىٰكُمُ ٱلْمُسْلِمِينَ مِن قَبْلُ وَفِى هَـٰذَا لِيَكُونَ ٱلرَّسُولُ شَهِيدًا عَلَيْكُمْ وَتَكُونُوا۟ شُهَدَآءَ عَلَى ٱلنَّاسِ ۚ فَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ وَٱعْتَصِمُوا۟ بِٱللَّهِ هُوَ مَوْلَىٰكُمْ ۖ فَنِعْمَ ٱلْمَوْلَىٰ وَنِعْمَ ٱلنَّصِيرُ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t fight\t in\t Allah's\t cause\t as\t is\t the\t true\t\nmanner\tof\t fighting;\tHe\thas\tpreferred\tyou\tand\thas\tnot\tkept\tany\thardship\tupon\tyou\tin\treligion;\t\nthe\treligion\tof\tyour\tfather\tIbrahim;\tAllah has\tnamed\tyou\tMuslims\t– in\tthe\tprevious\tBooks\tand\t\nin\tthis\tQur’an,\tso\tthat\tthe\tNoble\tMessenger\tbe\tyour\tguardian\tand\twitness,\tand\tyou\tbe\twitness\t\nagainst\tother\tpeople;\t therefore\tkeep\t the\tprayer\testablished\tand\tgive\tcharity,\tand\thold\t fast\t to\t\nthe\t rope\t of\t Allah;\t He\t is\t your\t Master;\t so what\t an\t excellent\t Master\t and\t what\t an\t excellent\t\nSupporter!",
    "romanUrduTranslationText": "Aur\tAllah\tki\trāh\tmeiñ\tJihād karo\tjaisā\tHaq\thai\tJihād karne\tka\tusne\ttumheiñ\tpasand\tkiya\taur\ttum\t\npar\t deen\t meiñ\t kuchh\t tangi\t nā\t rakhi,\t tumhāre\t bāp\t Ibrāhim ka\t deen\t Allah\t ne\t tumhārā\t nām\t\nMusalmān\t rakhā\t hai\t agli\tKitāboñ\t meiñ\t aur\t is\tQur’ān meiñ\t tāke\tRasool\t tumhārā\t nigehbān-o\u0002gawāh\tho,\taur\t tum\taur\tlogoñ\tpar\tgawāhi\tdo\t to\tNamāz barpā\t rakho\taur\tZakāt do\taur\tAllah\tki\t\nRassi\t mazboot\t thām\t lo Woh\t tumhārā\t Maulā\t hai\t to\t kya\t hi\t achchā\t Maulā\t aur\t kya\t hi\t achchā\t\nmadadgār."
  }
]