[
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "113",
    "arabicText": "وَقَالَتِ ٱلْيَهُودُ لَيْسَتِ ٱلنَّصَـٰرَىٰ عَلَىٰ شَىْءٍۢ وَقَالَتِ ٱلنَّصَـٰرَىٰ لَيْسَتِ ٱلْيَهُودُ عَلَىٰ شَىْءٍۢ وَهُمْ يَتْلُونَ ٱلْكِتَـٰبَ ۗ كَذَٰلِكَ قَالَ ٱلَّذِينَ لَا يَعْلَمُونَ مِثْلَ قَوْلِهِمْ ۚ فَٱللَّهُ يَحْكُمُ بَيْنَهُمْ يَوْمَ ٱلْقِيَـٰمَةِ فِيمَا كَانُوا۟ فِيهِ يَخْتَلِفُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t the\t Jews\t said,\t “The\t Christians\t are\t\nnothing”\t - and\t the\t Christians\t said,\t “The\t\nJews\tare\tnothing”\twhereas\tthey\tboth\tread\t\nthe\t Book;\t and\t the\t ignorant\t spoke\t\nsimilarly;\t so\t Allah will\t judge\t between\t\nthem\t on\t the\t Day\t of\t Resurrection,\t\nconcerning\t the\t matter\t in\t which\t they\t\ndispute.\t",
    "romanUrduTranslationText": "Aur\t Yahūdi\t bole\t Nasrāni\t kuch\t nahi\t\nNasrāni\t bole\t Yahūdi\t kuch\t nahi\t halāñke\t\nwoh\tkitāb\tpadhte\thaiñ\tisi\ttarah\tjāhiloñ\tne\t\nunki\t si\t bāt\t kahi\t to\t Allah\t Qayāmat\t ke\t din\t\nun\t meiñ\t faisla\t kar\t dega\t jis\t bāt\t meiñ\t\njhagad\trahe\thaiñ"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "114",
    "arabicText": "وَمَنْ أَظْلَمُ مِمَّن مَّنَعَ مَسَـٰجِدَ ٱللَّهِ أَن يُذْكَرَ فِيهَا ٱسْمُهُۥ وَسَعَىٰ فِى خَرَابِهَآ ۚ أُو۟لَـٰٓئِكَ مَا كَانَ لَهُمْ أَن يَدْخُلُوهَآ إِلَّا خَآئِفِينَ ۚ لَهُمْ فِى ٱلدُّنْيَا خِزْىٌۭ وَلَهُمْ فِى ٱلْـَٔاخِرَةِ عَذَابٌ عَظِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t who\t is\t more\t unjust\t than\t one\t who\t\nprevents\t the\t name\t of\t Allah being\t\nmentioned\tin\t the\tmasjids,\tand\t strives\t for\t\ntheir\t ruin?\t It\t did\t not\t befit\t them\t to\t enter\t\nthe masjids\t except\t in\t fear;\t for\t them\t is\t\ndisgrace\t in\t this\t world,\t and\t a\t terrible\t\npunishment\tin\tthe\tHereafter.\t",
    "romanUrduTranslationText": "Aur\tus\tse\tbadh\tkar\tzālim\tkaun\tjo\tAllah\tki\nmasjidoñ\t ko\t roke\t un\t meiñ\tNām-e-Khuda\t\nliye\t jāne\t se\t aur\t unki\t wirāni\t me\t koshish\t\nkare\t unko\t na\t pahuñchta\t tha\t ke\tmasjidoñ\t\nmeiñ\t jāyeiñ\t magar\t darte\t huwe\t unke\t liye\t\nduniya\t meiñ\t ruswāi\t hai\t aur\t unke\t liye\t\nĀkhirat\tmeiñ\tbada\t‘azāb"
  }
]