[
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "8"
    },
    "ayatNumber": "52",
    "arabicText": "كَدَأْبِ ءَالِ فِرْعَوْنَ ۙ وَٱلَّذِينَ مِن قَبْلِهِمْ ۚ كَفَرُوا۟ بِـَٔايَـٰتِ ٱللَّهِ فَأَخَذَهُمُ ٱللَّهُ بِذُنُوبِهِمْ ۗ إِنَّ ٱللَّهَ قَوِىٌّۭ شَدِيدُ ٱلْعِقَابِ",
    "urduTranslationText": "",
    "englishTranslationText": "Say,\t “What\t do\t you\t wait\t for\t to\t happen to\t\nus,\t except\t one\t of\t the\t two\t good\t things?*\t\nAnd\t for\t you,\t we\t look\t forward\t to\t Allah\nafflicting\t you\t with\t a\t punishment\t from\tHimself\t or\t by\t our\t hands;\t so\t wait\t- we\t too\t await\t with\t\nyou.”\t(*Death\tin\tAllah’s\tway\tor\tvictory.)\t",
    "romanUrduTranslationText": ". Tum\tfarmāo tum\thum\tpar\tkis\tcheez\tka\tintezār\tkarte\tho\tmagar\tdo\tkhoobiyoñ\tmeiñ\tse\tek\tka\taur\t\nhum\ttum\tpar\tis\tintezār\tmeiñ\thaiñ\tke\tAllah\ttum\tpar\t‘aƶāb\tdāle\tapne\tpās\tse\tya\thamāre\thāthoñ\tto\t\nab\trāh\tdekho\t(intezār\tkaro)\thum\tbhi\ttumhāre\tsāth\trāh\tdekh\trahe\thaiñ."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "8"
    },
    "ayatNumber": "53",
    "arabicText": "ذَٰلِكَ بِأَنَّ ٱللَّهَ لَمْ يَكُ مُغَيِّرًۭا نِّعْمَةً أَنْعَمَهَا عَلَىٰ قَوْمٍ حَتَّىٰ يُغَيِّرُوا۟ مَا بِأَنفُسِهِمْ ۙ وَأَنَّ ٱللَّهَ سَمِيعٌ عَلِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "Say,\t“Spend\twillingly\tor\twith\ta\theavy\theart,\tit\twill\tnever\tbe\taccepted\tfrom\tyou;\tindeed\tyou\tare\ta\t\ndisobedient\tpeople.”\t",
    "romanUrduTranslationText": "Tum\tfarmāo\t\tke\tdil\tse\tkharch\tkaro\tya\tna-gawāri\tse\ttum\tse\thargiz\tqabool\tna\thoga\tbe-shak\t\ttum\t\nbe-ḥukm\t(na-farmān)\t\tlog\tho."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "8"
    },
    "ayatNumber": "54",
    "arabicText": "كَدَأْبِ ءَالِ فِرْعَوْنَ ۙ وَٱلَّذِينَ مِن قَبْلِهِمْ ۚ كَذَّبُوا۟ بِـَٔايَـٰتِ رَبِّهِمْ فَأَهْلَكْنَـٰهُم بِذُنُوبِهِمْ وَأَغْرَقْنَآ ءَالَ فِرْعَوْنَ ۚ وَكُلٌّۭ كَانُوا۟ ظَـٰلِمِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t their\tspending\twas\tnot\tstopped\tbeing\taccepted,\texcept\tbecause\t they\tdisbelieved\tin\tAllah\nand\tHis\tNoble\tMessenger,\tand\t they\tcome\t to\tprayer\twith\theavy\thearts,\tand\t they\tdo\tnot\tspend\t\nexcept\tunwillingly.\t",
    "romanUrduTranslationText": ". Aur\twoh\tjo\tkharch\tkarte\thaiñ\tuska\tqabool\thona\tband\tna\thuwa\tmagar\tisi\tliye\tke\twoh\tAllah-o\u0002Rasool\tse\tmunkir\thuwe\taur\tNamāz\tko\tnahi\tāatey magar\tji\thāre\t(susti\tki\thālat\tmeiñ)\taur\tkharch\t\nnahi\tkarte\tmagar\tna-gawāri\tse."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "1",
    "arabicText": "بَرَآءَةٌۭ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلَّذِينَ عَـٰهَدتُّم مِّنَ ٱلْمُشْرِكِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Severance of\t ties\t is\t proclaimed\t by\t Allah\nand\t on\t behalf\t of\t His\t Noble\t Messenger,\t\ntowards\t the\t polytheists\t with\t whom\t you\t\nhad\ta\ttreaty.\t",
    "romanUrduTranslationText": "Bezāri\tka\tḥukm sunāna\thai\tAllah\taur\tuske\t\nRasool\tki\ttaraf\tse\tun\tmushrikoñ\tko\tjin\tse\t\ntumhāra\t mu'āhida\t tha\t aur\t woh\t qāim\t na\t\nrahe."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "2",
    "arabicText": "فَسِيحُوا۟ فِى ٱلْأَرْضِ أَرْبَعَةَ أَشْهُرٍۢ وَٱعْلَمُوٓا۟ أَنَّكُمْ غَيْرُ مُعْجِزِى ٱللَّهِ ۙ وَأَنَّ ٱللَّهَ مُخْزِى ٱلْكَـٰفِرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Travel\t freely\tin\t the\tland\t for\t four\tmonths,\t\nand\tbear\tin\tmind\t that\t you\tcannot\tescape\t\nfrom\t Allah,\t and\t that\t Allah will\t humiliate\t\nthe\tdisbelievers.\t",
    "romanUrduTranslationText": "To\t chār\t mahine\t zameen\t par\t chalo\t phiro\t\naur\tjān\trakho\tke\t tum\tAllah\tko\t thaka\tnahi\t\nsakte\t aur\t yeh\t ke\t Allah\t kāfiroñ\t ko\t ruswa\t\nkarne\twāla\thai."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "3",
    "arabicText": "وَأَذَٰنٌۭ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلنَّاسِ يَوْمَ ٱلْحَجِّ ٱلْأَكْبَرِ أَنَّ ٱللَّهَ بَرِىٓءٌۭ مِّنَ ٱلْمُشْرِكِينَ ۙ وَرَسُولُهُۥ ۚ فَإِن تُبْتُمْ فَهُوَ خَيْرٌۭ لَّكُمْ ۖ وَإِن تَوَلَّيْتُمْ فَٱعْلَمُوٓا۟ أَنَّكُمْ غَيْرُ مُعْجِزِى ٱللَّهِ ۗ وَبَشِّرِ ٱلَّذِينَ كَفَرُوا۟ بِعَذَابٍ أَلِيمٍ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t proclaim\t from\t Allah and\t His\t Noble\t\nMessenger\t to\t all\t men\t on\t the\t day\t of\t the\t\nGreat\t Pilgrimage\t (Haj)\t that\t Allah is\t\ndisgusted\t with\t the\t polytheists,\t and\t so\t is\t\nHis\tNoble\tMessenger;\tso\tif\tyou\trepent it\tis\t\nbetter\t for\tyou;\tbut\tif\tyou\tturn\taway,\tthen\t\nknow\t that\t you\tcannot\tescape\t from\tAllah;\t\nand\tgive\t the\tdisbelievers\t the\tglad\t tidings\t\nof\ta\tpainful\tpunishment.\t",
    "romanUrduTranslationText": ". Aur\tmanādi\tpukār\tdena\thai\tAllah\taur\tuske\t\nRasool\t ki\t taraf\t se\t sab\t logoñ\t meiñ\t bade\t\nHajj\t ke\t din\t ke\tAllah\t bezār\t hai\tmushrikoñ\t\nse\taur\tuska\tRasool\tto\tagar\ttum\ttauba\tkaro\t\nto\t tumhāra\t bhala\t hai\t aur\t agar\t moñh\t\nphero\t to\tjān\tlo\t ke\t tum\tAllah\t ko\t na\t thaka\t\nsakoge\taur\tkāfiroñ\tko\tkhush\tkhabri\tsunāo\t\ndard-nāk\t‘aƶāb\tki."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "4",
    "arabicText": "إِلَّا ٱلَّذِينَ عَـٰهَدتُّم مِّنَ ٱلْمُشْرِكِينَ ثُمَّ لَمْ يَنقُصُوكُمْ شَيْـًۭٔا وَلَمْ يُظَـٰهِرُوا۟ عَلَيْكُمْ أَحَدًۭا فَأَتِمُّوٓا۟ إِلَيْهِمْ عَهْدَهُمْ إِلَىٰ مُدَّتِهِمْ ۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلْمُتَّقِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Other\t than\t those\t polytheists\t with\t whom\t\nyou\t had\t a\t treaty,\t and\t they\t have\t not\t\ndiminished\tanything\tfrom\tyour\ttreaty\tnor\t\nsupported\tanyone\tagainst\tyou\t- therefore\t\nfulfil\t their\t treaty\t up\t to\t the\t appointed\t\nterm;\tindeed\tAllah befriends\tthe\tpious.\t\t",
    "romanUrduTranslationText": "Magar\t woh\t mushrik\t jin\t se\t tumhāra\t\nmu'āhida\t tha\t phir\t unhoñ\t ne\t tumhāre\t\n‘ahed\tmeiñ\tkuchh\tkami\tna\tki\taur\ttumhāre\t\nmuqābil\tkisi\tko\tmadad\tna\tdi\tto\tunka\t‘ahed\t\nthehri\t huyi\t muddat\t tak\t poora\t karo\t be\u0002shak\t \t Allah\t parhez-gāroñ\t ko\t dost\t rakhta\t\nhai."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "5",
    "arabicText": "فَإِذَا ٱنسَلَخَ ٱلْأَشْهُرُ ٱلْحُرُمُ فَٱقْتُلُوا۟ ٱلْمُشْرِكِينَ حَيْثُ وَجَدتُّمُوهُمْ وَخُذُوهُمْ وَٱحْصُرُوهُمْ وَٱقْعُدُوا۟ لَهُمْ كُلَّ مَرْصَدٍۢ ۚ فَإِن تَابُوا۟ وَأَقَامُوا۟ ٱلصَّلَوٰةَ وَءَاتَوُا۟ ٱلزَّكَوٰةَ فَخَلُّوا۟ سَبِيلَهُمْ ۚ إِنَّ ٱللَّهَ غَفُورٌۭ رَّحِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "Then\t when\t the\t sacred\t months\t have\t\npassed,\tslay\tthe\tpolytheists\twherever\tyou\t\nfind\tthem,\tand\tcatch\tthem\tand\tmake\tthem\t\ncaptive,\tand\twait\tin\tambush\t for\t them\tat\tevery\tplace;\t then\tif\t they\t repent and\t keep\t the\tprayer\t\nestablished\t and\t pay\t the\t charity,\t leave\t their\t way\t free;\t indeed\t Allah is\t Oft\t Forgiving,\t Most\t\nMerciful.\t\t",
    "romanUrduTranslationText": ". Phir\tjab\thurmat\twāle\tmahine\tnikal\tjāyeñ\tto\tmushrikon\tko\tmāro\tjahān\tpāo\taur\tunheiñ\tpakdo\taur\t\nqaid\t karo\t aur\t har\t jagah\t unki\t tāk\t meiñ\t baitho\t phir\t agar\t woh\t tauba\t kareiñ\t aur\t namāz\t qāim\t\nrakheiñ\taur\tzakāt\tdeñ\tto\tunki\trāh\tchhod\tdo\tbe-shak\t\tAllah\tbakhsh\tne\twāla\tmaherbān\thai"
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "6",
    "arabicText": "وَإِنْ أَحَدٌۭ مِّنَ ٱلْمُشْرِكِينَ ٱسْتَجَارَكَ فَأَجِرْهُ حَتَّىٰ يَسْمَعَ كَلَـٰمَ ٱللَّهِ ثُمَّ أَبْلِغْهُ مَأْمَنَهُۥ ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌۭ لَّا يَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tO\tdear\tProphet\t(Muhammad - peace\tand\tblessings\tbe\tupon\thim),\tif\ta\tpolytheist\tseeks\tyour\t\nprotection,\tgive\thim\tprotection\tso\tthat\the\tmay\thear\tthe\tWord\tof\tAllah,\tand\tthen\ttransport\thim\t\nto\this\tplace\tof\tsafety;\tthis\tis\tbecause\tthey\tare\tan\tunwise\tpeople.\t\t",
    "romanUrduTranslationText": "Aur\t aey\tMehboob!\tAgar\t koi\tmushrik\t tum\t se\t panah\tmāñge\t to\t usey\t panah\t do\t ke\twoh\tAllah\t ka\t\nkalām\tsune\tphir\tusey\tuski\taman\tki\tjagah\tpahuñcha\tdo\tyeh\tis\tliye\tke\twoh\tnadān\tlog\thaiñ."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "7",
    "arabicText": "كَيْفَ يَكُونُ لِلْمُشْرِكِينَ عَهْدٌ عِندَ ٱللَّهِ وَعِندَ رَسُولِهِۦٓ إِلَّا ٱلَّذِينَ عَـٰهَدتُّمْ عِندَ ٱلْمَسْجِدِ ٱلْحَرَامِ ۖ فَمَا ٱسْتَقَـٰمُوا۟ لَكُمْ فَٱسْتَقِيمُوا۟ لَهُمْ ۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلْمُتَّقِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "How\tcan\tthere\tbe\ta\ttreaty\twith\tAllah and\t\nwith\t His\t Noble\t Messenger\t for\t the\t\npolytheists,\t except\t for\t those\t with\t whom\t\nyou\t made\t a\t treaty\t near\t the\t Sacred\t\nMasjid?\tSo\tas\tlong\tas\tthey\tremain\tfirm\ton\t\nthe\ttreaty\tfor\tyou,\tyou\ttoo\tremain\tfirm\tfor\t\nthem;\t indeed\t Allah is\t pleased\t with\t the\t\npious.\t.\t\t",
    "romanUrduTranslationText": "Mushrikoñ\t ke\t liye\t Allah\t aur\t uske\t Rasool\t\nke\t pās\t koi\t ‘ahed\t kyuñ\t kar\t hoga\t magar\t\nwoh\t jin\t se\t tumhāra\t mu'āhida\t Masjid-e\u0002Harām ke\t pās\t huwa\t to\t jab\t tak\t woh\t\ntumhāre\t liye\t ‘ahed\t par\t qāim\t raheiñ\t tum\t\nunke\t liye\t qāim\t raho\t be-shak\t \t parhez-gār\t\nAllah\tko\tkhush\tāatey\t\thaiñ."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "8",
    "arabicText": "كَيْفَ وَإِن يَظْهَرُوا۟ عَلَيْكُمْ لَا يَرْقُبُوا۟ فِيكُمْ إِلًّۭا وَلَا ذِمَّةًۭ ۚ يُرْضُونَكُم بِأَفْوَٰهِهِمْ وَتَأْبَىٰ قُلُوبُهُمْ وَأَكْثَرُهُمْ فَـٰسِقُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Therefore\thow\t- when\t they\tare\tsuch\t that\t\nif\t they\tgain\t control\t over\t you,\t they\twould\t\nnot\t have\t regard\t for\tany\t relations\t nor\t for\t\nany\t treaty?\t They\t please\t you\t with\t their\t\nmouths\t whereas\t their\t hearts\t contain\t\nrejection;\t and\t most\t of\t them\t are\t\ndisobedient.\t\t",
    "romanUrduTranslationText": "Bhala\tkyuñ\tkar\tunka\thāl\tto\tyeh\thai\tke\ttum\t\npar\t qābu\t pāyeñ\t to\t na\t qarābat\t ka\t lihāz\t\nkareiñ\t\tna\t‘ahed\tka\tapne\tmoñh\tse\ttumheiñ\t\t\nrāzi\tkarte\thaiñ\taur\tunke\tdiloñ\tmeiñ\tinkār\t\nhai\taur\tun\tmeiñ\taksar\tbe\tḥukm\t\thaiñ."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "9",
    "arabicText": "ٱشْتَرَوْا۟ بِـَٔايَـٰتِ ٱللَّهِ ثَمَنًۭا قَلِيلًۭا فَصَدُّوا۟ عَن سَبِيلِهِۦٓ ۚ إِنَّهُمْ سَآءَ مَا كَانُوا۟ يَعْمَلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "They\texchanged\tthe\tverses\tof\tAllah for\tan\t\nabject\tprice,\ttherefore\tprevented\tfrom\tHis\t\nway;\t indeed\t what\t they\t do\t is\t extremely\t\nevil.\t",
    "romanUrduTranslationText": "Allah\tki\tāayatoñ\t\tke\tbadle\tthode\tdām\tmol\t\nliye\t to\t uski\t rāh\t se\t roka\t be-shak\t \t woh\t\nbahut\thi\tbure\tkām\tkarte\thaiñ."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "10",
    "arabicText": "لَا يَرْقُبُونَ فِى مُؤْمِنٍ إِلًّۭا وَلَا ذِمَّةًۭ ۚ وَأُو۟لَـٰٓئِكَ هُمُ ٱلْمُعْتَدُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "In\t respect\t of\t the\t Muslims,\t they\t do\t not\t\nkeep\t regard\t for\t any\t relations\t nor\t any\t\npacts;\tit\tis\tthey\twho\tare\tthe\trebels.\t",
    "romanUrduTranslationText": "Kisi\t Musalman\t meiñ\t na\t qarābat\t ka\t lihāz\t\nkareiñ\t\tna\t‘ahed\tka\taur\twohi\tsarkash\thaiñ."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "11",
    "arabicText": "فَإِن تَابُوا۟ وَأَقَامُوا۟ ٱلصَّلَوٰةَ وَءَاتَوُا۟ ٱلزَّكَوٰةَ فَإِخْوَٰنُكُمْ فِى ٱلدِّينِ ۗ وَنُفَصِّلُ ٱلْـَٔايَـٰتِ لِقَوْمٍۢ يَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Then\t if\t they\t repent and\t keep\t the\t prayer\t\nestablished\t and\t pay\t the\t charity,\t they\t are\t\nyour\tbrothers\tin\treligion;\tand\twe\texplain\t\nOur\t verses\t in\t detail\t for\t the\t people\t of\t\nknowledge.\t",
    "romanUrduTranslationText": "Phir\t agar\t woh\t tauba\t kareiñ\t \t aur\t Namāz\nqāim\t rakheiñ\t aur\t Zakāt deñ\t to\t woh\t\ntumhāre\t deeni\t bhai\t haiñ\t aur\t hum\t\nāayateiñ\tmufassal\t(Khol\tkhol)\tbayān\tkarte\t\nhaiñ\tjānne\twāloñ\tke\tliye."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "12",
    "arabicText": "وَإِن نَّكَثُوٓا۟ أَيْمَـٰنَهُم مِّنۢ بَعْدِ عَهْدِهِمْ وَطَعَنُوا۟ فِى دِينِكُمْ فَقَـٰتِلُوٓا۟ أَئِمَّةَ ٱلْكُفْرِ ۙ إِنَّهُمْ لَآ أَيْمَـٰنَ لَهُمْ لَعَلَّهُمْ يَنتَهُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". And\tif\tthey\tbreak\ttheir\tpromises\tafter\tmaking\ta\ttreaty\tand\tmalign\tyour\treligion,\tthen\tfight\tthe\t\nleaders\tof\tdisbelief\t- indeed\ttheir\tpromises\tare\tnothing\t- in\tthe\thope\tthat\tthey\tmay\tdesist.\t\t",
    "romanUrduTranslationText": "Aur\tagar\tahed\tkarke\tapni\tqasmeiñ\ttodeiñ\taur\ttumhāre\tdeen\tpar\tmoñh\tāayeñ\t(e’aterāj\twa\tt’an\t\nkareñ)\t to\t kufr\t ke\t sarghanoñ\t se\t lado\t be-shak\t \t unki\t qasmeiñ\t kuchh\t nahi\t is\t ummeed\t par\t ke\t\nshayad\twoh\tb’az\tāayeñ."
  },
  {
    "juz": {
      "id": "10"
    },
    "surah": {
      "id": "9"
    },
    "ayatNumber": "13",
    "arabicText": "أَلَا تُقَـٰتِلُونَ قَوْمًۭا نَّكَثُوٓا۟ أَيْمَـٰنَهُمْ وَهَمُّوا۟ بِإِخْرَاجِ ٱلرَّسُولِ وَهُم بَدَءُوكُمْ أَوَّلَ مَرَّةٍ ۚ أَتَخْشَوْنَهُمْ ۚ فَٱللَّهُ أَحَقُّ أَن تَخْشَوْهُ إِن كُنتُم مُّؤْمِنِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Will\t you\t not\t fight\t the\t people\t who\t broke\t their\t promises,\t and\t intended\t to\t expel\t the\t Noble\t\nMessenger\twhereas\t they\t had\t started\tit?\tDo\t you\t fear\t them?\t So\tAllah has\tmore\t right\t that\t you\t\nshould\tfear\tHim,\tif\tyou\thave\tfaith.\t\t",
    "romanUrduTranslationText": "Kya\tus\tqaum\tse\tna\tladoge\t Jinhoñ\tne\tapni\tqasmeiñ\t todeiñ\taur\tRasool\tke\tnikālne\tka\tirāda\tkiya\t\nhalāñke\tunhi\tki\ttaraf\tse\tpahel\thuwi\thai\tkya\tun\tse\tdarte\tho\tto\tAllah\tis\tka\tziyada\tmustahiq\thai\tke\t\nus\tse\tdaro\tagar\tImān\trakhte\tho."
  }
]