[
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "253",
    "arabicText": "۞ تِلْكَ ٱلرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَىٰ بَعْضٍۢ ۘ مِّنْهُم مَّن كَلَّمَ ٱللَّهُ ۖ وَرَفَعَ بَعْضَهُمْ دَرَجَـٰتٍۢ ۚ وَءَاتَيْنَا عِيسَى ٱبْنَ مَرْيَمَ ٱلْبَيِّنَـٰتِ وَأَيَّدْنَـٰهُ بِرُوحِ ٱلْقُدُسِ ۗ وَلَوْ شَآءَ ٱللَّهُ مَا ٱقْتَتَلَ ٱلَّذِينَ مِنۢ بَعْدِهِم مِّنۢ بَعْدِ مَا جَآءَتْهُمُ ٱلْبَيِّنَـٰتُ وَلَـٰكِنِ ٱخْتَلَفُوا۟ فَمِنْهُم مَّنْ ءَامَنَ وَمِنْهُم مَّن كَفَرَ ۚ وَلَوْ شَآءَ ٱللَّهُ مَا ٱقْتَتَلُوا۟ وَلَـٰكِنَّ ٱللَّهَ يَفْعَلُ مَا يُرِيدُ",
    "urduTranslationText": "",
    "englishTranslationText": "These\tare\tthe\tNoble\tMessengers,\tto\twhom\t\nWe\t gave\t excellence\t over\t each\t other;\t of\t\nthem\t are\t some\t with\t whom\t Allah spoke,\t\nand\tsome\twhom\tHe\texalted\thigh\tabove\tall\t\nothers;\tand\tWe\tgave\t Eisa\t(Jesus),\t the\t son\t\nof\tMaryam,\tclear\tsigns\tand\tWe\taided\thim\t\nwith\t the\t Holy\t Spirit;\t and\t if\t Allah willed,\t\nthose\t after\t them\t would\t not\t have\t fought\t\neach\t other\t after\t the\t clear\t evidences\t had\t\ncome\t to\t them,\t but\t they\t differed\t - some\t\nremained\t on\t faith\t and\t some\t turned\t\ndisbelievers;\t and\t had\t Allah willed,\t they\t\nwould\t not\t have\t fought\t each\t other;\t but\t\nAllah may\tdo\tas\tHe\twills\t\t\t\t\t\t\t",
    "romanUrduTranslationText": "Yeh\tRasool\thaiñ\tke\tham\tne\tin\tmeiñ\tek\tko\t\ndoosre\tpar\tAfzal\tkiya\tin\tmeiñ\tkisi\tse\tAllah\t\nne\tkalām\tfarmāya\taur\tkoi\twoh\thai\tjise\tsab\t\npar\t darjoñ\t balañd\t kiya\t aur\t ham\t ne\t\nMaryam ke\t bete\t ‘Isā ko\t khuli\t nishāniyān\t\ndeeiñ\taur\tPakeezah\tRooh se\tuski\tmadad\tki\t\naur\tAllah\tchāhta to\tunke\tb’ad\twāle\tāapas\t\nmeiñ\tna\tladte\tb’ad\t\tiske\tke\tunke\tpās\tkhuli\t\nnishāniyāñ\t āa\t chukieñ\t lekin\t woh\t to\t\nmukhtalif\t ho\t gye\t un\t meiñ\t koi\t Imān\t par\t\nraha\t aur\t koi\t kāfir\t ho\t gaya\t aur\t Allah\t\nchāhta\t to\t woh\t na\t ladte\t magar\t Allah\t jo\t\nchāheñ\tkare\t.\t\n"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "254",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ أَنفِقُوا۟ مِمَّا رَزَقْنَـٰكُم مِّن قَبْلِ أَن يَأْتِىَ يَوْمٌۭ لَّا بَيْعٌۭ فِيهِ وَلَا خُلَّةٌۭ وَلَا شَفَـٰعَةٌۭ ۗ وَٱلْكَـٰفِرُونَ هُمُ ٱلظَّـٰلِمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "O\t People\t who\t Believe!\t Spend\t in\t Allah's\t\ncause,\t from\twhat\tWe\t have\t provided\t you,\t\nbefore\tthe\tadvent\tof\ta\tday\tin\twhich\tthere\t\nis\t no\t trade,\t and\t for\t the\t disbelievers\t\nneither\t any\t friendship\t nor\t intercession;\t\nand\t the\t disbelievers\t themselves\t are\t the\t\nunjust\t\t\t\t\t\t",
    "romanUrduTranslationText": " Aey\tImān\twālo!\tAllah\tki\trāh\tmeiñ\thamāre\t\ndiye\tmeiñ\tse\tkharch\tkaro\twoh\tdin\tāane\tse\t\npahle\tjis\tmeiñ\t na\t khareed\t farokht\t hai\t na\t\nkāfiroñ\t ke\t liye\t dosti\t aur\t na\t shafa'at\t aur\t\nkāfir\tkhud\thi\tzālim\thaiñ\n"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "255",
    "arabicText": "ٱللَّهُ لَآ إِلَـٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ ۚ لَا تَأْخُذُهُۥ سِنَةٌۭ وَلَا نَوْمٌۭ ۚ لَّهُۥ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۗ مَن ذَا ٱلَّذِى يَشْفَعُ عِندَهُۥٓ إِلَّا بِإِذْنِهِۦ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَىْءٍۢ مِّنْ عِلْمِهِۦٓ إِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرْسِيُّهُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ ۖ وَلَا يَـُٔودُهُۥ حِفْظُهُمَا ۚ وَهُوَ ٱلْعَلِىُّ ٱلْعَظِيمُ",
    "urduTranslationText": "",
    "englishTranslationText": "Allah - there\tis\tno\tGod\texcept\tHim;\tHe\tis\t\nAlive\t (eternally,\t on\t His\t own)\t and\t the\t\nUpholder\t (keeps\t others\t established);\t He\t\nnever\t feels\t drowsy\t nor\t does\tHe\t sleep;\t to\t\nHim\t only\t belongs\t all\t whatever\t is\t in\t the\t\nheavens\tand\tall\twhatever\tis\tin\t the\tearth;\t\nwho\t is\t he\t that\t can\t intercede*\t with\t Him\t\nexcept\t by\tHis\tcommand?\tHe\t knows\twhat\t\nis\tin\tfront\tof\tthem\tand\twhat\tis\tbehind\tthem;\tand\tthey\tdo\tnot\tachieve\tanything\tof\tHis\tknowledge\t\nexcept\twhat\tHe\twills;\tHis\tThrone\t(of\tSovereignty)\tencompasses\tthe\theavens\tand\tthe\tearth;\tand\t\nit\tis\tnot\tdifficult\tfor\tHim\tto\tguard\tthem;\tand\tHe\tis\tthe\tSupreme,\tthe\tGreatest.\t\n(This Verse is popularly known as Ayat Al-Kursi. It has a special status and reciting it carries \ngreat reward. *Prophet Muhammad – peace and blessings be upon him – will be the first one \nto be granted the permission to intercede, others will follow.) \t\t\t\t",
    "romanUrduTranslationText": "Allah\thai\tjis\tke\tsiwa\tkoi\tma'bood\tnahi\twoh\t\nāap\tzinda\taur\tauroñ\tka\tqāim\trakhne\twāla\t\nusey\t na\t ooñgh\t \t āaye\t na\t neeñd\t usi\t ka\t jo\t\nkuch\tāsmanoñ\tme\thai\taur\tjo\tkuch\tzameen\t\nmeiñ\twoh\tkaun\thai\tjo\tus\tke\tyahāñ\tsifārish\t\nkare\tbe\tus\tke\thukm\tke\tjānta\thai\tjo\tkuchh\t\nunke\t āage\t hai\t aur\t jo\t kuchh\t unke\t peeche\t\naur\t woh\t nahi\t pāte\t us\t ke\t ilm\t meiñ\t se\t\nmagar\tjitna\twoh\tchāhe\tus\tki\tkursi\tmeiñ\tsamāye\thuwe\thaiñ\tāasman\taur\tzameen\taur\tuse\tbhāri\t\nnahi\tun\tki\tnigehbāni\taur\twohi\thai\tbalañd\tbadāi\twāla\n(Ye\tĀyat\tĀyat\tal-Kursi\tke\tnām\tse\tmashoor\thai.\tIska\tapna\tek\tkhās\tmaqām\thai\tor\tisko\tpardhna\tbada\t\nSawāb\thai.)\n"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "256",
    "arabicText": "لَآ إِكْرَاهَ فِى ٱلدِّينِ ۖ قَد تَّبَيَّنَ ٱلرُّشْدُ مِنَ ٱلْغَىِّ ۚ فَمَن يَكْفُرْ بِٱلطَّـٰغُوتِ وَيُؤْمِنۢ بِٱللَّهِ فَقَدِ ٱسْتَمْسَكَ بِٱلْعُرْوَةِ ٱلْوُثْقَىٰ لَا ٱنفِصَامَ لَهَا ۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ",
    "urduTranslationText": "",
    "englishTranslationText": "There\tis\tno\tcompulsion\tat\tall\tin\treligion;\tundoubtedly\tthe\tright\tpath\thas\tbecome\tvery\tdistinct\t\nfrom\t error;\t and\t whoever\t rejects\t faith\t in\t the\t devil\t (false\t deities)\t and\t believes\t in\t Allah has\t\ngrasped\ta\tvery\tfirm\thandhold;\tit\twill\tnever\tloosen;\tand\tAllah is\tAll\tHearing,\tAll\tKnowing.\t\t\t\t\t",
    "romanUrduTranslationText": ". Kuch\tzabardasti\tnahi\tdeen\tmeiñ\tbeshak\tkhoob\tjuda\tho\tgayi\thai\tnek\trāh\tgumrahi\tse\tto\tjo\tshaitān\t\nko\tna\tmāne\taur\tAllah\tpar\tImān\tlāye\tus\tne\tbadi\tmohkam\tgirah\tthāmi\tjise\tkabhi\tkhulna\tnahi, aur\t\nAllah\tsunta\tjānta\thai\t\n"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "257",
    "arabicText": "لَآ إِكْرَاهَ فِى ٱلدِّينِ ۖ قَد تَّبَيَّنَ ٱلرُّشْدُ مِنَ ٱلْغَىِّ ۚ فَمَن يَكْفُرْ بِٱلطَّـٰغُوتِ وَيُؤْمِنۢ بِٱللَّهِ فَقَدِ ٱسْتَمْسَكَ بِٱلْعُرْوَةِ ٱلْوُثْقَىٰ لَا ٱنفِصَامَ لَهَا ۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ",
    "urduTranslationText": "",
    "englishTranslationText": ". Allah is\t the\tGuardian\tof\t the\tMuslims\t- He\t\nremoves\t them\t from\t realms\t of\t darkness\t\ntowards\t light;\t and\t the\t supporters\t of\t\ndisbelievers\t are\t the\t devils\t- they\t remove\t\nthem\t from\t light\t towards\t the\t realms\t of\t\ndarkness;\tit\tis\tthey\twho\tare\tthe\tpeople\tof\t\nfire;\tthey\twill\tremain in\tit\tforever.\t\t\t\t",
    "romanUrduTranslationText": "Allah\t wāli\t hai\t Musalmanoñ ka\t unheiñ\t\nandheriyoñ\t se\t noor\t ki\t taraf\t nikālta\t hai,\naur\tkāfiroñ\tke\thimayati\tshaitān\thaiñ\twoh\t\nunheiñ\tnoor\tse\tandheriyoñ\tki\ttaraf\tnikālte\t\nhaiñ, yahi\t log\t dozakh\t wāle\t haiñ\t inheiñ\t\nhamesha\tis\tmeiñ\trahna\t\n"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "258",
    "arabicText": "أَلَمْ تَرَ إِلَى ٱلَّذِى حَآجَّ إِبْرَٰهِـۧمَ فِى رَبِّهِۦٓ أَنْ ءَاتَىٰهُ ٱللَّهُ ٱلْمُلْكَ إِذْ قَالَ إِبْرَٰهِـۧمُ رَبِّىَ ٱلَّذِى يُحْىِۦ وَيُمِيتُ قَالَ أَنَا۠ أُحْىِۦ وَأُمِيتُ ۖ قَالَ إِبْرَٰهِـۧمُ فَإِنَّ ٱللَّهَ يَأْتِى بِٱلشَّمْسِ مِنَ ٱلْمَشْرِقِ فَأْتِ بِهَا مِنَ ٱلْمَغْرِبِ فَبُهِتَ ٱلَّذِى كَفَرَ ۗ وَٱللَّهُ لَا يَهْدِى ٱلْقَوْمَ ٱلظَّـٰلِمِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Did\t you\t (O\t dear\t Prophet\t Muhammad -\npeace\t and\t blessings\t be\t upon\t him)\tnot\t see\t\nhim\twho\targued\twith\tIbrahim\t(Abraham)\t\nconcerning\t his\t Lord,\t as\t Allah had\t given\t\nhim\t the\t kingdom?\t When\t Ibrahim\t said,\t\n“My\tLord\tis\tHe\tWho\tgives\tlife\tand\tcauses\t\ndeath”,\the\tanswered,\t“I\tgive\tlife\tand\tcause\t\ndeath”;\tIbrahim\tsaid,\t“So\tindeed\tit\tis\tAllah\nWho\t brings\t the\t sun\t from\t the\t East\t - you\t\nbring\tit\t from\t the\tWest!”\t- the\t disbeliever\t\nwas\t therefore\tbaffled;\tand\tAllah does\tnot\t\nguide\tthe\tunjust.\t\t\t\t",
    "romanUrduTranslationText": "Aey\t Mehboob\" kya\t tum\t ne\t na\t dekha\t tha\t\nusey\t jo\tIbrāheem se\t jhagda\t us\t ke\t rab\t ke\t\nbāre\t meiñ\t is\t par\t ke\t Allah\t ne\t usey\t\nbādshāhi\t di\t jabke\t Ibrāhēem ne\t kaha\t ke\t\nmera\t rab\twoh\t hai\t ke\tjilāta\t hai\t aur\tmārta\t\nhai\t bola\t maiñ\t jilāta\t aur\t mārta\t hooñ\t\nIbrāhēem\t ne\t farmaya\t to\t Allah\t sooraj\t ko\t\nlāta\t hai\t poorab\t(Mashriq)\t se\t tu\t [\t us\t ko\t ]\t\npach-chhim (Maghrib) se\tle\tāa\tto\thosh\tud\t\ngaye\t kāfir\t ke,\t aur\t Allah\t rāh\t nahi\t dikhāta\t\nzālimoñ\tko."
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "259",
    "arabicText": "أَوْ كَٱلَّذِى مَرَّ عَلَىٰ قَرْيَةٍۢ وَهِىَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا قَالَ أَنَّىٰ يُحْىِۦ هَـٰذِهِ ٱللَّهُ بَعْدَ مَوْتِهَا ۖ فَأَمَاتَهُ ٱللَّهُ مِا۟ئَةَ عَامٍۢ ثُمَّ بَعَثَهُۥ ۖ قَالَ كَمْ لَبِثْتَ ۖ قَالَ لَبِثْتُ يَوْمًا أَوْ بَعْضَ يَوْمٍۢ ۖ قَالَ بَل لَّبِثْتَ مِا۟ئَةَ عَامٍۢ فَٱنظُرْ إِلَىٰ طَعَامِكَ وَشَرَابِكَ لَمْ يَتَسَنَّهْ ۖ وَٱنظُرْ إِلَىٰ حِمَارِكَ وَلِنَجْعَلَكَ ءَايَةًۭ لِّلنَّاسِ ۖ وَٱنظُرْ إِلَى ٱلْعِظَامِ كَيْفَ نُنشِزُهَا ثُمَّ نَكْسُوهَا لَحْمًۭا ۚ فَلَمَّا تَبَيَّنَ لَهُۥ قَالَ أَعْلَمُ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "Or\t like\t him*\t who\t passed\t by\t a\t dwelling\t\nand\tit\thad\t fallen\t flat\ton\tits\troofs;\the\tsaid,\t\n“How\t will\t Allah bring\t it\t to\t life,\t after\t its\t\ndeath?”;\t so\t Allah kept\t him\t dead\t for\t a\t\nhundred\t years,\t then\tbrought\thim\tback\t to\t\nlife;\t He\t said,\t “How\t long\t have\t you\t stayed\t\nhere?”;\the\treplied,\t“I\tmay\thave\tstayed\t for\t\na\t day\t or\tlittle\tless”;\tHe\t said,\t “In\t fact,\t you\t\nhave\t spent\t a\t hundred\t years\t - so\t look\t at\t\nyour\tfood\tand\tdrink\twhich\tdo\tnot\teven\tsmell\tstale;\tand\tlook\tat\tyour\tdonkey\twhose\tbones\teven\t\nare\tnot\tintact\t- in\torder\tthat\tWe\tmay\tmake\tyou\ta\tsign\tfor\tmankind\t- and\tlook\tat\tthe\tbones\thow\t\nWe\tassemble\tthem\tand\tthen\tcover\tthem\twith\tflesh”;\tso\twhen\tthe\tmatter\tbecame\tclear\tto\thim,\t\nhe\tsaid,\t“I\tknow\twell\tthat\tAllah is\tAble\tto\tdo\tall\tthings.”\t(Prophet\tUzair\t- peace\tbe\tupon\thim.)\t\t\t\t",
    "romanUrduTranslationText": "Ya\t uski\t tarah\t jo\t guzra\t ek\t basti\t par\t aur\t\nwoh\tdhayi\t(giri)\tpadi\tthi\tapni\tchatoñ\tpar\tbola\tisey\tkyuñ kar\tjilāye\tga\tAllah\tis\tki\tmaut\tke\tb’ad\tto\t\nAllah\tne\tusey\tmurda\trakha\tsau\tbaras\tphir\tzinda\tkar\tdiya\tfarmāya\ttu\tyahāñ\tkitna\tthehra\t?\tArz\tki\t\ndin\tbhar\t thehra\thoñga\t ya\tkuch\tkam,\t farmāya\tnahi\tbalke\t tujhe\tsau\tbaras\tguzar\tgaye\taur\tapne\t\nkhāne\taur\tpāni\tko\tdekh\tke\tab\t tak\tboo\tna\tlāya\taur\tapne\tgadhe\tko\tdekh\t (ke\tjiski\thaddiyāñ\t tak\t\nSalāmat\tna\trahiñ)\taur\tyeh\tis\tliye\tke\ttujhe\thum\tlogoñ\tke\twāste\tnishāni\tkareiñ\taur\tin\thaddiyoñ\tko\t\ndekh kyuñ kar\thum\tinheiñ\tuthān\tdete\tphir\tinheiñ\tgosht\tpahnāte\thaiñ\tjab\tyeh\tmu'āmla\tus\tpar\t\nzāhir\tho\tgaya\tbola\tmaiñ\tkhoob\tjānta\thooñ\tke\tAllah\tsab\tkuch kar\tsakta\thai."
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "260",
    "arabicText": "أَوْ كَٱلَّذِى مَرَّ عَلَىٰ قَرْيَةٍۢ وَهِىَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا قَالَ أَنَّىٰ يُحْىِۦ هَـٰذِهِ ٱللَّهُ بَعْدَ مَوْتِهَا ۖ فَأَمَاتَهُ ٱللَّهُ مِا۟ئَةَ عَامٍۢ ثُمَّ بَعَثَهُۥ ۖ قَالَ كَمْ لَبِثْتَ ۖ قَالَ لَبِثْتُ يَوْمًا أَوْ بَعْضَ يَوْمٍۢ ۖ قَالَ بَل لَّبِثْتَ مِا۟ئَةَ عَامٍۢ فَٱنظُرْ إِلَىٰ طَعَامِكَ وَشَرَابِكَ لَمْ يَتَسَنَّهْ ۖ وَٱنظُرْ إِلَىٰ حِمَارِكَ وَلِنَجْعَلَكَ ءَايَةًۭ لِّلنَّاسِ ۖ وَٱنظُرْ إِلَى ٱلْعِظَامِ كَيْفَ نُنشِزُهَا ثُمَّ نَكْسُوهَا لَحْمًۭا ۚ فَلَمَّا تَبَيَّنَ لَهُۥ قَالَ أَعْلَمُ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t when\t Ibrahim\t said,\t “My\t Lord!\t Show\t\nme\thow\tYou\twill\tgive\tlife\tto\tthe\tdead”;\tHe\t\nsaid,\t“Are\tyou\tnot\tcertain\t(of\tit)?”\tIbrahim\t\nsaid,\t “Surely\t yes,\twhy\t not?\t But\t because\t I\t\nwish\t to\t put\t my\t heart\t at\t ease”;\t He\t said,\t\n“Therefore\t take\t four\t birds\t (as\t pets)\t and\t\ncause\t them\t to\t become\t familiar\t to\t you,\t\nthen\t place\t a\t part\t of\t each\t of\t them\t on\t\nseparate\t hills,\t then\t call\t them\t - they\t will\t\ncome\t running\t towards\t you;\t and\t know\t\nwell\t that\t Allah is\t Almighty,\t Wise.”\t\n(Prophet\tIbrahim\tcalled\tthe\tdead\tbirds\tand\t\nthey\tdid\tcome\trunning\ttowards\thim.)\t",
    "romanUrduTranslationText": "Aur\tjab\tarz\tki\tIbrāheem ne\taey\trab\tmere\t!\t\nmujhe\tdikha\tde\t tu\t kyuñ\t kar\tmurde\tjilāye\t\nga\t farmāya\t kya\t tujhe\t yaqeen\t nahi\t arz\t ki\t\nyaqeen\tkyuñ\tnahi\tmagar\tyeh\tchāhta\thooñ\t\nke\t mere\t dil\t ko\t qarār\t āa\t jāye\t farmāya\t to\t\nachha\tchār\tparinde\tlekar\tapne\tsāth\thila\tle\t\nphir\tunka\tek\tek\ttukda\thar\tpahād\tpar\trakh\t\nde\t phir\t unheiñ\t bula\t woh\t tere\t pās\t chale\t\nāyeñge\t pāoñ\t se\t daudte\t aur\t jān\t rakh\t ke\t\nAllah\tghalib\thikmat\twāla\thai"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "261",
    "arabicText": "مَّثَلُ ٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُمْ فِى سَبِيلِ ٱللَّهِ كَمَثَلِ حَبَّةٍ أَنۢبَتَتْ سَبْعَ سَنَابِلَ فِى كُلِّ سُنۢبُلَةٍۢ مِّا۟ئَةُ حَبَّةٍۢ ۗ وَٱللَّهُ يُضَـٰعِفُ لِمَن يَشَآءُ ۗ وَٱللَّهُ وَٰسِعٌ عَلِيمٌ",
    "urduTranslationText": "",
    "englishTranslationText": "The\t example\t of\t those\t who\t spend\t their\t\nwealth\tin\tAllah’s\tway\tis\tsimilar\tto\tthat\tof\ta\t\ngrain\twhich\thas\tsprouted\tseven\tstalks\tand\t\nin\t each\t stalk\t are\t a\t hundred\t grains;\t and\t\nAllah may\tincrease\tit\tstill\tmore\t than\t this,\t\nfor\twhomever\tHe\twills;\tand\tAllah is\tMost\t\nCapable,\tAll\tKnowing",
    "romanUrduTranslationText": "Un\t ki\t kahāwat\t jo\t apne\t māl\t Allah\t ki\t rāh\t\nmeiñ\t kharch\t karte\t haiñ\t us\t dāne\t ki\t tarah\t\njis\t ne\t ugāyiñ\t sāt\t bāleiñ\t har\t bāl\tmeiñ\t sau\t\ndāne\taur\tAllah\tis\tse\tbhi\tziyāda\tbadhaye\tjis\t\nke\t liye\t chāhe\t aur\t Allah\t wus'at\t wāla\t ilm\t\nwāla\thai."
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "262",
    "arabicText": "ٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُمْ فِى سَبِيلِ ٱللَّهِ ثُمَّ لَا يُتْبِعُونَ مَآ أَنفَقُوا۟ مَنًّۭا وَلَآ أَذًۭى ۙ لَّهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Those\t who\t spend\t their\t wealth\t in\t Allah’s\t\nway\tand\tthereafter\tdo\tnot\texpress\tfavour\t\nnor\t cause\t injury\t (hurt\t the\t recipient’s\t\nfeelings),\t their\t reward\tis\twith\t their\t Lord;\t\nthere\tshall\tbe\tno\tfear\tupon\tthem\tnor\tshall\t\nthey\tgrieve",
    "romanUrduTranslationText": "Woh\tjo\tapne\tmāl\tAllah\tki\trāh\tmeiñ\tkharch\t\nkarte\t haiñ\t phir\t diye\t peechhe\t na\t ahsān\t\nrakheiñ\t na\t takleef\t deiñ\t unka\t neg\t(Ajr-o\u0002Sawāb)\tunke\tRab\tke\tpās\thai\taur\tunheiñ\tna\t\nkuchh\tandesha\tho\tna\tkuchh\tgham.\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "262",
    "arabicText": "ٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُمْ فِى سَبِيلِ ٱللَّهِ ثُمَّ لَا يُتْبِعُونَ مَآ أَنفَقُوا۟ مَنًّۭا وَلَآ أَذًۭى ۙ لَّهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Those\t who\t spend\t their\t wealth\t in\t Allah’s\t\nway\tand\tthereafter\tdo\tnot\texpress\tfavour\t\nnor\t cause\t injury\t (hurt\t the\t recipient’s\t\nfeelings),\t their\t reward\tis\twith\t their\t Lord;\t\nthere\tshall\tbe\tno\tfear\tupon\tthem\tnor\tshall\t\nthey\tgrieve",
    "romanUrduTranslationText": "Woh\tjo\tapne\tmāl\tAllah\tki\trāh\tmeiñ\tkharch\t\nkarte\t haiñ\t phir\t diye\t peechhe\t na\t ahsān\t\nrakheiñ\t na\t takleef\t deiñ\t unka\t neg\t(Ajr-o\u0002Sawāb)\tunke\tRab\tke\tpās\thai\taur\tunheiñ\tna\t\nkuchh\tandesha\tho\tna\tkuchh\tgham.\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "263",
    "arabicText": "۞ قَوْلٌۭ مَّعْرُوفٌۭ وَمَغْفِرَةٌ خَيْرٌۭ مِّن صَدَقَةٍۢ يَتْبَعُهَآ أَذًۭى ۗ وَٱللَّهُ غَنِىٌّ حَلِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "Speaking\t kind\t words\t and\t pardoning\t are\t\nbetter\tthan\tcharity\tfollowed\tby\tinjury;\tand\tAllah is\tthe\tIndependent,\tMost\tForbearing.\t",
    "romanUrduTranslationText": ". Achchhi\tbāt\tkehna\taur\tdar-guzar\tkarna\tus\t\nkhairāt\tse\tbehtar\thai jis\tke\tb’ad\tsatāna\tho\t\naur\tAllah\tbe\tparwāh\thilm\twāla\thai\t.\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "264",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تُبْطِلُوا۟ صَدَقَـٰتِكُم بِٱلْمَنِّ وَٱلْأَذَىٰ كَٱلَّذِى يُنفِقُ مَالَهُۥ رِئَآءَ ٱلنَّاسِ وَلَا يُؤْمِنُ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ ۖ فَمَثَلُهُۥ كَمَثَلِ صَفْوَانٍ عَلَيْهِ تُرَابٌۭ فَأَصَابَهُۥ وَابِلٌۭ فَتَرَكَهُۥ صَلْدًۭا ۖ لَّا يَقْدِرُونَ عَلَىٰ شَىْءٍۢ مِّمَّا كَسَبُوا۟ ۗ وَٱللَّهُ لَا يَهْدِى ٱلْقَوْمَ ٱلْكَـٰفِرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "O\tPeople\twho\tBelieve!\tDo\tnot\tinvalidate\tyour\tcharity\tby\texpressing\tfavour\tand\tcausing\tinjury\t-\nlike\tone\twho\tspends\this\twealth\tfor\tpeople\tto\tsee,\tand\tdoes\tnot\tbelieve\tin\tAllah and\tthe\tLast\tDay;\t\nhis\texample\tis\tsimilar\tto\tthat\tof\ta\trock\tcovered\twith\tdust\tand\thard\train\tfell\ton\tit,\tleaving\tit\tas\ta\t\nbare\trock;\tthey\tshall\tget\tno\tcontrol\tover\t(or\tbenefit\tfrom)\tanything\tthey\thave\tearned;\tand\tAllah\ndoes\tnot\tguide\tthe\tdisbelievers.\t",
    "romanUrduTranslationText": "Aey\tImān\twālo!\tApne\tSadqe\tbātil\tna\tkardo\tahsān\trakh\tkar\taur\tizā\tdekar\tuski\ttarah\tjo\tapna\tmāl\t\nlogoñ\tke\tdikhāwe\tke\tliye\tkharch\tkare\taur\tAllah\taur\tQayamat\tpar\tImān\tna\tlāye\tto\tuski\tkahāwat\t\naisi\thai\tjaise\tek\tchattān\tke\tus\tpār\tmitti\thai\tab\tus\tpār\tzor\tka\tpāni\tpada\tjis\tne\tusey\tnira\tpatthar\tkar\t\nchhoda\tapni\tkamāyi\tse\tkisi\tcheez\tpar\tqābu\tna\t\tpāyeñ\tge\taur\tAllah\tkāfiroñ\tko\trāh\tnahi\tdeta.\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "265",
    "arabicText": "وَمَثَلُ ٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُمُ ٱبْتِغَآءَ مَرْضَاتِ ٱللَّهِ وَتَثْبِيتًۭا مِّنْ أَنفُسِهِمْ كَمَثَلِ جَنَّةٍۭ بِرَبْوَةٍ أَصَابَهَا وَابِلٌۭ فَـَٔاتَتْ أُكُلَهَا ضِعْفَيْنِ فَإِن لَّمْ يُصِبْهَا وَابِلٌۭ فَطَلٌّۭ ۗ وَٱللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tthe\texample\tof\tthose\twho\tspend\ttheir\t\nwealth\t in\t order\t to\t seek\t Allah’s\t pleasure\t\nand\t to\t make\t their\t hearts\t steadfast,\t is\t\nsimilar\t to\t that\t of\t a\t garden\t on\t a\t height\t -\nhard\t rain\t fell\t on\t it,\t so\t bringing\t forth\t its\t\nfruit\t twofold;\t so\t if\t hard\t rain\t does\t not\t\nreach\t it, the\t dew\t is\t enough;\t and\tAllah is\t\nseeing\tyour\tdeeds.",
    "romanUrduTranslationText": "Aur\t un\t ki\t kahāwat\t jo\t apne\t māl\t Allah\t ki\t\nraza\t chāhne\t meiñ\t kharch\t karte\t haiñ\t aur\t\napne\tdil\tjamāne\tko\tus\tbāgh\tki\tsi\thai\tbhood\n(Rayteeli\t Zameen) par\t ho\t us\t par\t zor\t ka\t\npāni\tpada\tto\tdooney\tmewe\tlāya\tphir\tagar\t\nzor\tka\tmenh\tusey\tna\tpahuñche\tto\toas\tkāfi\t\nhai\taur\tAllah\ttumhāre\tkām\tdekh\traha\thai\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "266",
    "arabicText": "أَيَوَدُّ أَحَدُكُمْ أَن تَكُونَ لَهُۥ جَنَّةٌۭ مِّن نَّخِيلٍۢ وَأَعْنَابٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ لَهُۥ فِيهَا مِن كُلِّ ٱلثَّمَرَٰتِ وَأَصَابَهُ ٱلْكِبَرُ وَلَهُۥ ذُرِّيَّةٌۭ ضُعَفَآءُ فَأَصَابَهَآ إِعْصَارٌۭ فِيهِ نَارٌۭ فَٱحْتَرَقَتْ ۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمُ ٱلْـَٔايَـٰتِ لَعَلَّكُمْ تَتَفَكَّرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Would\tany\tof\tyou\tlike\tthat\the\tmay\town\ta\t\ngarden\t of\t dates\t and\t grapes,\t with\t rivers\t\nflowing\t beneath\t it\t- in\t it\t are\t all\t kinds\t of\t\nfruits\tfor\thim\t- and\the\treaches\told\tage\tand\t\nhas\t young\t children;\t therefore\t a\t\nwindstorm\t containing\t fire\t came\t to\t the\t\ngarden,\t burning\t it?\t This\t is\t how\t Allah\nexplains\t His\t verses\t to\t you,\t so\t that\t you\t\nmay\tgive\tthought.",
    "romanUrduTranslationText": "Kiya\ttum\tmeiñ\tkoi\tise\tpasand\trakhe\tga\tke\t\nus\t ke\t pās\t ek\t bāgh\t ho\t khajooroñ\t aur\t\nangooroñ\t ka\t jis\t ke\t neeche\t nadiyāñ\t\nbahteiñ\t us\t ke\t liye\t is\t meiñ\t har\t qism\t ke\t\nphaloñ\tse\thai\taur\tusey\tbudhapa\tāaya\taur\t\nus\t ke\t na-tawāñ\t bachche\t haiñ\t to\t āaya\t us\t\npar\t ek\t bagoola (Intehāi\t tez\t Hawā\t ka\t\nchakkar) jis\tmeiñ\tāag\tthi\tto\tjal\tgya\taisa\thi\t\nbayān\t karta\t hai\t Allah\t tum\t se\t apni\t\nāayatyeñ\tke\tkahiñ\ttum\tdhiyān\tlagao"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "267",
    "arabicText": "أَيَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ أَنفِقُوا۟ مِن طَيِّبَـٰتِ مَا كَسَبْتُمْ وَمِمَّآ أَخْرَجْنَا لَكُم مِّنَ ٱلْأَرْضِ ۖ وَلَا تَيَمَّمُوا۟ ٱلْخَبِيثَ مِنْهُ تُنفِقُونَ وَلَسْتُم بِـَٔاخِذِيهِ إِلَّآ أَن تُغْمِضُوا۟ فِيهِ ۚ وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ غَنِىٌّ حَمِيدٌ",
    "urduTranslationText": "",
    "englishTranslationText": "O\t People\t who\t Believe!\t Spend\t a\t part\t of\t\nyour\tlawful\tearnings,\tand\tpart\tof\twhat\tWe\t\nhave\t produced\t from\t the\t earth\t for\t you\t -\nand\t do\t not\t (purposely)\t choose\t upon\t the\t\nflawed\tto\tgive\tfrom\tit\t(in\tcharity)\twhereas\t\nyou\twould\tnot\taccept\tit\tyourselves\texcept\t\nwith\t your\t eyes\t closed\t towards\t it;\t and\t\nknow\twell\tthat\tAllah is\tIndependent,\tMost\t\nPraised.\t",
    "romanUrduTranslationText": "Aey\t Imān\t wālo\t apni\t pāk\t kamaiyoñ\t me\t se\t kuchh\t do\t aur\t us\t meiñ\t se\t jo\t ham\t ne\t tumhāre\t liye\t\nzameen\tse\tnikāla\taur\tkhās\tnāqis\tka\tirāda\tna\tkaro\tke\tdo\t to\tus\tmeiñ\tse\taur\t tumheiñ\tmile\t to\tna\t\nloge\tjab\ttak\tus\tmeiñ\tchashm\tposhi\tna\tkaro\taur\tjān\trakho\tke\tAllah\tbe\tparwāh\tsaraha\tgaya\thai\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "268",
    "arabicText": "ٱلشَّيْطَـٰنُ يَعِدُكُمُ ٱلْفَقْرَ وَيَأْمُرُكُم بِٱلْفَحْشَآءِ ۖ وَٱللَّهُ يَعِدُكُم مَّغْفِرَةًۭ مِّنْهُ وَفَضْلًۭا ۗ وَٱللَّهُ وَٰسِعٌ عَلِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "The\t devil\t scares\t you\t of\t poverty\t and\t bids\t\nyou\tto\tthe\tshameful;\tand\tAllah promises\tyou\tforgiveness\tfrom\tHim,\tand\tmunificence;\tand\tAllah\nis\tMost\tCapable,\tAll\tKnowing.",
    "romanUrduTranslationText": "Shaitān\ttumheiñ\tandesha\tdilāta\thai\tmuhtāji\tka\taur\thukm\tdeta\thai\tbe\thayāi\tka\taur\taur\tAllah\ttum\t\nse\tw'ada\tfarmāta\thai\tbakhshish\taur\tfazl\tka\taur\tAllah\twus'at\twāla\tilm\twāla\thai"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "269",
    "arabicText": "يُؤْتِى ٱلْحِكْمَةَ مَن يَشَآءُ ۚ وَمَن يُؤْتَ ٱلْحِكْمَةَ فَقَدْ أُوتِىَ خَيْرًۭا كَثِيرًۭا ۗ وَمَا يَذَّكَّرُ إِلَّآ أُو۟لُوا۟ ٱلْأَلْبَـٰبِ",
    "urduTranslationText": "",
    "englishTranslationText": "Allah bestows\t wisdom\t on\t whomever\t He\t wills;\t and\t whoever\t receives\t wisdom\t has\t received\t\nabundant\tgoodness;\tbut\tnone\theed\tadvice\texcept\tmen\tof\tunderstanding\n",
    "romanUrduTranslationText": "Allah\t hikmat\t deta\t hai\tjise\t chāhe\t aur\tjise\t hikmat\tmili\t usey\tbahut\t bhalāi\tmili\t aur\t nasihat\t nahi\t\nmānte\tmagar\t'aql\twāle.\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "270",
    "arabicText": "وَمَآ أَنفَقْتُم مِّن نَّفَقَةٍ أَوْ نَذَرْتُم مِّن نَّذْرٍۢ فَإِنَّ ٱللَّهَ يَعْلَمُهُۥ ۗ وَمَا لِلظَّـٰلِمِينَ مِنْ أَنصَارٍ",
    "urduTranslationText": "",
    "englishTranslationText": "And\twhatever\tyou\tspend\tor\tpledge\tto\tdo,\t\nAllah is\taware\tof\tit;\tand\tthe\tunjust\tdo\tnot\t\nhave\tsupporters.\t\n",
    "romanUrduTranslationText": "Aur\t tum\tjo\t kharch\t karo\t ya\tmannat\tmāno\t\nAllah\t ko\t us\t ki\t khabar\t hai\taur\t Zālimoñ\t ka\t\nkoi\tmadad-gār\tnahi.\t\t"
  }
]