[
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "4",
    "arabicText": "وَٱلَّذِينَ يُؤْمِنُونَ بِمَآ أُنزِلَ إِلَيْكَ وَمَآ أُنزِلَ مِن قَبْلِكَ وَبِٱلْـَٔاخِرَةِ هُمْ يُوقِنُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\twho believe in this (Qur’an) which\t\nhas been sent\tdown upon you, O beloved\t\nProphet, (Muhammad - peace and\t\nblessings\t be\t upon\t him)\t and\t what\t was\t\nsent\tdown\tbefore\tyou;\tand\tare\tcertain\tof\t\nthe\tHereafter.\t",
    "romanUrduTranslationText": "Aur woh ke Īmān lāyeñ us per jo aey\t\nMehboob tumhāri\ttaraf\tutra aur jo tum se\t\npahle utra aur Ākhirat per yaqeen\t\nrakheiñ."
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "5",
    "arabicText": "أُو۟لَـٰٓئِكَ عَلَىٰ هُدًۭى مِّن رَّبِّهِمْ ۖ وَأُو۟لَـٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "It is they who are on guidance from their\t\nLord; and\tthey\tare the successful.\t",
    "romanUrduTranslationText": "Wohi log\tapne Rab\tki taraf se hidāyat per\t\nhaiñ aur wohi murād ko pahuñch ne\t\nwāle"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "6",
    "arabicText": "إِنَّ ٱلَّذِينَ كَفَرُوا۟ سَوَآءٌ عَلَيْهِمْ ءَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "As for those whose fate is disbelief, whether\t\nyou warn\tthem or do not warn them it is all\t\none for them; they will not believe.",
    "romanUrduTranslationText": "Beshak wo jin ki qismat me kufr hai unheiñ\t\nbarābar hai chāhe tum unheiñ darao ya\t na\t\ndarao woh Imān lāne ke nhiñ"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "7",
    "arabicText": "خَتَمَ ٱللَّهُ عَلَىٰ قُلُوبِهِمْ وَعَلَىٰ سَمْعِهِمْ ۖ وَعَلَىٰٓ أَبْصَـٰرِهِمْ غِشَـٰوَةٌۭ ۖ وَلَهُمْ عَذَابٌ عَظِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "Allah has sealed their hearts and their ears,\t\nand on their eyes is\ta covering; and for\tthem\t\nis a terrible punishment.",
    "romanUrduTranslationText": " Allah ne unke\tdiloñ per aur kanoñ per muhar\t\nkardi aur\tunki\t ānkhoñ per ghta top hai aur\t\nunke liye\tBada 'Azab"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "8",
    "arabicText": "وَمِنَ ٱلنَّاسِ مَن يَقُولُ ءَامَنَّا بِٱللَّهِ وَبِٱلْيَوْمِ ٱلْـَٔاخِرِ وَمَا هُم بِمُؤْمِنِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And among the people are some that say,\t\n“We believe in Allah and\t the Last Day\t **”\t\nwhereas they are not believers!",
    "romanUrduTranslationText": "Aur kuch log * kahte haiñ ke ham Allah aur\t\npichle din ** per Iman lāye aur woh Īmān\t\nwāle\tnahi"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "9",
    "arabicText": "يُخَـٰدِعُونَ ٱللَّهَ وَٱلَّذِينَ ءَامَنُوا۟ وَمَا يَخْدَعُونَ إِلَّآ أَنفُسَهُمْ وَمَا يَشْعُرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "They wish to deceive Allah and the believers;\t\nand in fact they deceive none\t except\t\nthemselves and they do\tnot have any\t\nunderstanding.\t",
    "romanUrduTranslationText": "Fareb diya chahte haiñ Allah aur Imān wāloñ\t\nko aur Haqeeqat me fareb nhiñ dete magar\t\napni\tjānoñ ko aur unheiñ sha'oor nhiñ"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "10",
    "arabicText": "فِى قُلُوبِهِم مَّرَضٌۭ فَزَادَهُمُ ٱللَّهُ مَرَضًۭا ۖ وَلَهُمْ عَذَابٌ أَلِيمٌۢ بِمَا كَانُوا۟ يَكْذِبُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "In their hearts is a disease, so\tAllah has\t\nincreased\t their disease; and for them is\t a\t\npainful punishment, because of their lies.\t\n",
    "romanUrduTranslationText": "Unke diloñ meiñ bimāri hai to Allah ne unki\t\nbimāri aur badhāi aur unke liye Dard-nāk\t\n‘azāb hai,\tbadla unke jhoot ka"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "11",
    "arabicText": "وَإِذَا قِيلَ لَهُمْ لَا تُفْسِدُوا۟ فِى ٱلْأَرْضِ قَالُوٓا۟ إِنَّمَا نَحْنُ مُصْلِحُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And when it is\tsaid\tto them, “Do not cause\t\nturmoil in the earth”, they say, “We are only\t\npeacemakers!”",
    "romanUrduTranslationText": " Aur\tjo unse kaha jāye zameen meiñ fasād na\t\nkaro\tto kahte haiñ hum to sañwarne wāle\t\nhaiñ"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "12",
    "arabicText": "أَلَآ إِنَّهُمْ هُمُ ٱلْمُفْسِدُونَ وَلَـٰكِن لَّا يَشْعُرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Pay heed! It is they\twho\tare mischievous, but they do not have sense.\t",
    "romanUrduTranslationText": "Sunta hai! wohi fasādi haiñ\\  magar unheiñ\tsha'oor\tnahi"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "13",
    "arabicText": "وَإِذَا قِيلَ لَهُمْ ءَامِنُوا۟ كَمَآ ءَامَنَ ٱلنَّاسُ قَالُوٓا۟ أَنُؤْمِنُ كَمَآ ءَامَنَ ٱلسُّفَهَآءُ ۗ أَلَآ إِنَّهُمْ هُمُ ٱلسُّفَهَآءُ وَلَـٰكِن لَّا يَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": " And when it is said to them, “Believe as the\tothers believe”,they say,\t“Shall we\tbelieve as the foolish believe?” Pay heed! It is they who\t\nare the fools, but they do not\tknow.\t",
    "romanUrduTranslationText": "Aur jab unse kaha jāye Īmān lāo jaise aur log Īmān lāye haiñ to kaheñ\tkiya\tham\tahmaqoñ\tki tarah Īmān le āayeñ sunta hai! wohi\tahmaq\t\nhaiñ\tmagar jānte nahiñ"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "14",
    "arabicText": "وَإِذَا لَقُوا۟ ٱلَّذِينَ ءَامَنُوا۟ قَالُوٓا۟ ءَامَنَّا وَإِذَا خَلَوْا۟ إِلَىٰ شَيَـٰطِينِهِمْ قَالُوٓا۟ إِنَّا مَعَكُمْ إِنَّمَا نَحْنُ مُسْتَهْزِءُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And when they meet with the\tbelievers,\tthey\tsay, “We believe”; and when they are\t alone with their devils, they say, “We are undoubtedly\twith\tyou,\twe were just\tmocking!”. And when they meet with the believers, they\t\nsay,\t “We\t believe”;\t and\t when\t they\t are\t alone\t\nwith\ttheir\tdevils,\tthey\tsay,\t“We\tare\tundoubtedly\twith\tyou,\twe\twere\tjust\tmocking!”",
    "romanUrduTranslationText": "Aur jab Īmān wāloñ\tse mileiñ to kaheiñ\tham\tĪmān lāye, aur jab apne shaitānoñ ke\t sath\takele hoñ to kaheiñ hum tumhare\t sāth haiñ hum to yuñ hi\thansi karte haiñ"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "15",
    "arabicText": "ٱللَّهُ يَسْتَهْزِئُ بِهِمْ وَيَمُدُّهُمْ فِى طُغْيَـٰنِهِمْ يَعْمَهُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Allah (befitting His Majesty) ridicules them, leaving them to\twander blindly in their\trebellion.\t",
    "romanUrduTranslationText": "Allah unse istehza farmāta hai (jaisa uski ki shān ke lāyeq hai) aur unheiñ dheel\tdeta\thai\tke\tapni\tsarkashi\tmeiñ\tbhatakte\traheñ"
  }
]