[
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "81",
    "arabicText": "بَلَىٰ مَن كَسَبَ سَيِّئَةًۭ وَأَحَـٰطَتْ بِهِۦ خَطِيٓـَٔتُهُۥ فَأُو۟لَـٰٓئِكَ أَصْحَـٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَـٰلِدُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Yes,\t why\t not?\t *\t The\t one\t who\t earns\t evil\t\nand\this\tsin\tsurrounds\thim;\the\tis\tfrom\tthe\t\npeople\tof\tfire\t(hell);\tthey\twill\tremain\tin\tit\t\nforever. (You\t will\t remain\t in\t the\t fire\t\nforever).",
    "romanUrduTranslationText": "Hān\t kiyuñ\t nhi\t jo\t gunah\t kamāye\t aur\t uski\t khata\t usey\t gher\t le\t woh\t dozakh\t wālon\t meiñ\t haiñ\t\nunheiñ\thamesha\tus\tmeiñ\trahna"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "82",
    "arabicText": "وَٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ أُو۟لَـٰٓئِكَ أَصْحَـٰبُ ٱلْجَنَّةِ ۖ هُمْ فِيهَا خَـٰلِدُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tthose\twho\tbelieve\tand\tdo\tgood\tdeeds\t- they\tare\tthe\tPeople\tof\tParadise;\tthey\twill\tabide\tin\tit\t\nforever.\t",
    "romanUrduTranslationText": "\nAur\tjo\tĪmān\tlāye\taur\tachche\tkām\tkiye\twoh\tJannat\twāle\thaiñ\tunheiñ\thamesha\tus\tmeiñ\trahna"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "83",
    "arabicText": "وَإِذْ أَخَذْنَا مِيثَـٰقَ بَنِىٓ إِسْرَٰٓءِيلَ لَا تَعْبُدُونَ إِلَّا ٱللَّهَ وَبِٱلْوَٰلِدَيْنِ إِحْسَانًۭا وَذِى ٱلْقُرْبَىٰ وَٱلْيَتَـٰمَىٰ وَٱلْمَسَـٰكِينِ وَقُولُوا۟ لِلنَّاسِ حُسْنًۭا وَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ ثُمَّ تَوَلَّيْتُمْ إِلَّا قَلِيلًۭا مِّنكُمْ وَأَنتُم مُّعْرِضُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t(remember)\twhen\tWe\ttook\ta\tcovenant\tfrom\tthe\tDescendants\tof\tIsrael\tthat,\t“Do\tnot\tworship\t\nanyone\texcept\tAllah;\tand\tbe\tgood\tto\tparents,\trelatives,\torphans\tand\tthe\tneedy,\tand\tspeak\tkindly\t\nto\tpeople\tand\tkeep\tthe\tprayer\testablished\tand\tpay\tthe\tcharity”;\tthereafter\tyou\tretracted,\texcept\t\nsome\tof\tyou;\tand\tyou\tare\tthose\twho\tturn\taway",
    "romanUrduTranslationText": "Aur\tjab\tham\tne\tbani\tIsra’il\tse\t‘ahed\tliya\tke\tAllah\tke\tsiwa\tkisi\tko\tna\tpoojo\taur\tmā\tbāp\tke\tsath\t\nbhalāi\tkaro\taur\trishtey\tdāroñ aur\tyateemoñ aur\tmiskeenoñ\tse\taur\tlogoñ\tse\tachchi\tbāt\tkaho\taur\t\nNamāz\t qāyem\t rakho\taur\tZakāt\t do\t phir\t tum\t phir\tgaye\tmagar\t tum\tmeiñ\t ke\t thode\taur\t tum\t ru\u0002gardān\tho\n"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "84",
    "arabicText": "وَإِذْ أَخَذْنَا مِيثَـٰقَكُمْ لَا تَسْفِكُونَ دِمَآءَكُمْ وَلَا تُخْرِجُونَ أَنفُسَكُم مِّن دِيَـٰرِكُمْ ثُمَّ أَقْرَرْتُمْ وَأَنتُمْ تَشْهَدُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t when\t We\t took\t a\t covenant\t from\t you\t\nthat,\t “Do\t not\t shed\t the\t blood\t of\t your\t own\t\npeople\tnor\t turn\tout\tyour\town\tpeople\t from\t\nyour\t colonies”;\t you\t then\t acknowledged\t it\t\nand\tyou\tare\twitnesses.\t",
    "romanUrduTranslationText": "Aur\tjab\tham\tne\ttum\tse\t‘ahed\tliya\tke\tapnoñ\t\nka\t khoon\t na\t karna\t aur\t apnoñ\t ko\t apni\t\nbastiyoñ\t se\t na\t nikalna\t phir\t tum\t ne\t iska\t\niqrār\tkiya\taur\ttum\tgawāh\tho"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "85",
    "arabicText": "ثُمَّ أَنتُمْ هَـٰٓؤُلَآءِ تَقْتُلُونَ أَنفُسَكُمْ وَتُخْرِجُونَ فَرِيقًۭا مِّنكُم مِّن دِيَـٰرِهِمْ تَظَـٰهَرُونَ عَلَيْهِم بِٱلْإِثْمِ وَٱلْعُدْوَٰنِ وَإِن يَأْتُوكُمْ أُسَـٰرَىٰ تُفَـٰدُوهُمْ وَهُوَ مُحَرَّمٌ عَلَيْكُمْ إِخْرَاجُهُمْ ۚ أَفَتُؤْمِنُونَ بِبَعْضِ ٱلْكِتَـٰبِ وَتَكْفُرُونَ بِبَعْضٍۢ ۚ فَمَا جَزَآءُ مَن يَفْعَلُ ذَٰلِكَ مِنكُمْ إِلَّا خِزْىٌۭ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا ۖ وَيَوْمَ ٱلْقِيَـٰمَةِ يُرَدُّونَ إِلَىٰٓ أَشَدِّ ٱلْعَذَابِ ۗ وَمَا ٱللَّهُ بِغَـٰفِلٍ عَمَّا تَعْمَلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Then\tit\tis\tyou\twho\tbegan\tslaying\teach\tother\t\nand\t you\t drive\t out\t a\t group\t of your\t people\t\nfrom\t their\t homeland\t - providing\t support\t\nagainst\t them\t (to\t their\t opponents)\t through\t\nsin\tand\tinjustice;\tand\tif\tthey\tcome\tto\tyou\tas\t\ncaptives\t you\t redeem\t them,\t whereas\t their\t\nexpulsion\t itself\t is\t forbidden\t to\t you;\t so\t do\t\nyou\t believe\t in\t some\t of\t Allah’s\t commands\t\nand\t disbelieve\t in\t some?\t So\t what\t is\t the\t\nreward\tof\tthose\twho\tdo\tso,\texcept\tdisgrace\t\nin\t this\t world?\t And\t on\t the\t Day\t of\t\nResurrection\t they\t will\t be\t assigned\t to\t the\t\nmost\tgrievous\tpunishment;\tand\tAllah is\tnot\t\nunaware\tof\tyour\tdeeds.\t",
    "romanUrduTranslationText": "Phir\tyeh\tjo\ttum\tho\tapno\tko\tqatl\tkarne\tlage\t\naur\t apne\t meiñ\t ek\t giroh\t unke\t watan\t se\t\nnikālte\t ho un\t par\t madad\t dete\t ho\t (unke\t\nmukhalif\t ko)\t gunāh\t aur\t ziyadati\t meiñ\t aur\t\nagar\two\tQaidi\thokar\t tumhāre\tpās\tāayeñ\t to\t\nbadla\t dekar\t churda\t lete\t ho\t aur\t unka\t\nnikālna\ttum\tpar\tharām\thai\tto\tkiya\tkhuda\tke\t\nkuchh\thukmoñ\tpar\t Īmān\tlāte\tho\taur\tkuchh\t\nse\tinkār\t karte\t ho\t to\tjo\t tum\tmeiñ\taisa\t kare\t\nuska\t badla\t kiya\t hai\t magar\t \t yeh\t ke\t duniya\t\nmeiñ\truswa\tho\taur\tQayamat\tmeiñ\tsakht\ttar\t\n‘azāb\t ki\t taraf\t phere\t jāyeñge\t aur\t Allah\t\ntumhāre\tkotakoñ\tse\tbekhabar\tnahiñ"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "86",
    "arabicText": "أُو۟لَـٰٓئِكَ ٱلَّذِينَ ٱشْتَرَوُا۟ ٱلْحَيَوٰةَ ٱلدُّنْيَا بِٱلْـَٔاخِرَةِ ۖ فَلَا يُخَفَّفُ عَنْهُمُ ٱلْعَذَابُ وَلَا هُمْ يُنصَرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "These\t are\t the\t people\t who\t bought\t the\t\nworldly\t life\t in\t exchange\t of\t the\t Hereafter\t-\nso\t their\t punishment\t will\t not\t be\t lightened,\t\nnor\twill\tthey\tbe\thelped.\t",
    "romanUrduTranslationText": "Yeh\t haiñ\t wo\t log\t jinhone\t Ākhirat\t ke\t badle\t\nduniya\t ki\t zindagi\t mol\t li\t to\t na\t un\t par\t se\t\n‘azāb\thalka\taur\tna\tunki\tmadad\tki\tjāye\t"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "87",
    "arabicText": "وَلَقَدْ ءَاتَيْنَا مُوسَى ٱلْكِتَـٰبَ وَقَفَّيْنَا مِنۢ بَعْدِهِۦ بِٱلرُّسُلِ ۖ وَءَاتَيْنَا عِيسَى ٱبْنَ مَرْيَمَ ٱلْبَيِّنَـٰتِ وَأَيَّدْنَـٰهُ بِرُوحِ ٱلْقُدُسِ ۗ أَفَكُلَّمَا جَآءَكُمْ رَسُولٌۢ بِمَا لَا تَهْوَىٰٓ أَنفُسُكُمُ ٱسْتَكْبَرْتُمْ فَفَرِيقًۭا كَذَّبْتُمْ وَفَرِيقًۭا تَقْتُلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t indeed\t We\t gave\t Moosa\t (Moses)\t the\t\nBook\t and\t subsequent\t to\t him,\t sent\t Noble\t\nMessengers\t one\t after\t another\t - and\t We\t\ngave\tEisa\t(Jesus),\tthe\tson\tof\tMaryam\t(Mary),\t\nclear\t proofs\t and\t supported\t him\t with\t the\t\nHoly\t Spirit;\t so\t when\t a\t Noble\t Messenger\t\nfrom\tAllah comes\tto\tyou\tbringing\twhat\tyou\t\nyourselves\tdo\tnot\tdesire,\tyou\tgrow\tarrogant;\tso\tyou\tdisbelieve\tin\ta\tgroup\tof\tthe\tProphets\tand\t\nanother\tgroup\tof\tProphets\tyou\tslay!",
    "romanUrduTranslationText": "Aur\tbeshak\tham\tne\tMūsā ko\tKitāb\tata\tki\taur\t\nuske\t b‘ād\t pe\t dar\t pe\t Rasool\t bheje\t aur\t ham\t\nne\t‘Isā\tbin\tMaryam ko\tkhuli\tnishāniyāñ\tata\t\nfarmāyiñ\taur\tpāk\trooh\tse\tuski\tmadad\tki\t to\t\nkya\ttumhāre\tpās\tkoi\tRasool\twoh\tlekar\tāaye\tjo\ttumhāre\tnafs\tki\tkhuwahish\tnahi\ttakabbur\tkarte\t\nho\tto\tun\tmeiñ\tek\tgiroh\tko\ttum\tjhutlāte\taur\tek\tgiroh\tko\tshaheed\tkarte\tho\t?"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "88",
    "arabicText": "وَقَالُوا۟ قُلُوبُنَا غُلْفٌۢ ۚ بَل لَّعَنَهُمُ ٱللَّهُ بِكُفْرِهِمْ فَقَلِيلًۭا مَّا يُؤْمِنُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t the\t Jews\t said,\t “Our\t hearts\t are\t covered”;\t in\t fact\t Allah has\t cursed\t them\t because\t of\t their\t\ndisbelief,\tso\tonly\ta\tfew\tof\tthem\taccept\tfaith.\t",
    "romanUrduTranslationText": "Aur\tYahūdi\tbole\thamāre\tdilon\tpar\tparde\tpade\thaiñ\tbalke\tAllah\tne\tun\tpar\tla'nat\tki\tunke\tkufr\tke\t\nsabab\tto\tunmeiñ\tthode\tĪmān\tlāte\thaiñ"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "89",
    "arabicText": "وَلَمَّا جَآءَهُمْ كِتَـٰبٌۭ مِّنْ عِندِ ٱللَّهِ مُصَدِّقٌۭ لِّمَا مَعَهُمْ وَكَانُوا۟ مِن قَبْلُ يَسْتَفْتِحُونَ عَلَى ٱلَّذِينَ كَفَرُوا۟ فَلَمَّا جَآءَهُم مَّا عَرَفُوا۟ كَفَرُوا۟ بِهِۦ ۚ فَلَعْنَةُ ٱللَّهِ عَلَى ٱلْكَـٰفِرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t when\t the\t Book\t from\t Allah (the\t Holy\t\nQu’ran)\t came\t to\t them,\t which\t confirms\t the\t\nBook\t in\t their\t possession\t (the\t Taurat\t /\t\nTorah)\t- and\t before\t that\t they\t used\t to\t seek\t\nvictory\t through\t the\t medium\t of\t this\t very\t\nProphet\t(Muhammad - peace\t and\t blessings\t\nbe\tupon\thim)\tover\tthe\tdisbelievers;\tso\twhen\t\nthe\t one\t whom\t they\t fully\t recognised\t (the\t\nHoly\t Prophet)\t came\t to\t them,\t they\t turned\t\ndisbelievers\t - therefore\t Allah’s\t curse\t is\t\nupon\tthe\tdisbelievers.",
    "romanUrduTranslationText": "Aur\t jab\t unke\t pās\t Allah\t ki\t woh\t Kitāb\t\n(Qur’ān)\t āayi\t jo\t unke\t sāth\t wāli\t Kitāb\t\n(Tauret)\t ki\t tasdeeq\t farmāti\t hai\t aur\t is\t se\t\npahle\t usi\t Nabi\t ke\t waseele\t se\t kāfiroñ\t par\t\nfateh\tmāngte\tthey\tto\tjab\ttashreef\tlāya\tunke\t\npās\t woh\t jāna\t pehchāna\t to\t usse\tmunkir\t ho\t\nbaithe\tto\tAllah ki\tla'nat\tmunkiron\tpar"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "90",
    "arabicText": "بِئْسَمَا ٱشْتَرَوْا۟ بِهِۦٓ أَنفُسَهُمْ أَن يَكْفُرُوا۟ بِمَآ أَنزَلَ ٱللَّهُ بَغْيًا أَن يُنَزِّلَ ٱللَّهُ مِن فَضْلِهِۦ عَلَىٰ مَن يَشَآءُ مِنْ عِبَادِهِۦ ۖ فَبَآءُو بِغَضَبٍ عَلَىٰ غَضَبٍۢ ۚ وَلِلْكَـٰفِرِينَ عَذَابٌۭ مُّهِينٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "How\t abject\t is\t the\t price\t for\t which\t they\t\nexchange\t their\t lives\t that\t they\t should\t\ndisbelieve\t in\t what\t Allah has sent\t down,\t\njealous\tthat\tAllah should\treveal\tof\tHis\tgrace\t\nto\t whomever\tHe\t wills\t of\tHis\t bondmen!\t So\nthey\t deserved\t wrath\t upon\t wrath;\t and\t for\t\nthe\t disbelievers\t is\t a\t disgraceful\t\npunishment..",
    "romanUrduTranslationText": "Kis\t bure\t moloñ\t unhoñ\t ne\t apni\t jānoñ\t ko\t\nkharida\t ke\t Allah\t ke\t utāre\t se\t munkir\t hoñ\t\niski\t jalan\t se\t ke\t Allah\t apne\t fazl\t se\t apne\t jis\t\nbande\tpar\tchāhe\twahee\tutāre\tto\tghazab\tpar\t\nghazab\t ke\t saza-wār\t huwe\t aur\t kāfiroñ\t ke\t\nliye\tzillat\tka\t‘azāb\thai\t"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "91",
    "arabicText": "وَإِذَا قِيلَ لَهُمْ ءَامِنُوا۟ بِمَآ أَنزَلَ ٱللَّهُ قَالُوا۟ نُؤْمِنُ بِمَآ أُنزِلَ عَلَيْنَا وَيَكْفُرُونَ بِمَا وَرَآءَهُۥ وَهُوَ ٱلْحَقُّ مُصَدِّقًۭا لِّمَا مَعَهُمْ ۗ قُلْ فَلِمَ تَقْتُلُونَ أَنۢبِيَآءَ ٱللَّهِ مِن قَبْلُ إِن كُنتُم مُّؤْمِنِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t when\t it\t is\t said\t to\t them,\t “Believe\t in\t\nwhat\t Allah has\t sent\t down\",\t they\t say,\t “We\t\nbelieve\t in\t what\t was\t sent\t down\t to\t us,\t and\t\ndisbelieve\t in\t the\t rest”\t - whereas\t it\t is\t the\t\nTruth\t confirming\t what\t they\t possess!\t Say\t\n(to\tthem,\tO\tdear\tProphet\tMuhammad - peace\t\nand\t blessings\t be\t upon\t him),\t “Why\t did\t you\t\nthen\t martyr\t the\t earlier\t Prophets,\t if\t you\t\nbelieved\tin\tyour\tBook?”\t",
    "romanUrduTranslationText": "Aur\t jab\t unse\t kaha\t jāye\t ke\t utāre\t par\t Imān\t\nlao\tto\tkahte\thaiñ\two\tjo\tham\tpar\tutra\tus\tpar\t\nImān\t lāte\t haiñ\t aur\t baqi\t se\t munkir\t hote\t\nhaiñ,\t halāñke\t woh\t haq\t hai\t unke\t pās\t wāle\t ki\t tasdeeq\t farmāta\t huwa\t tum\t farmao\t ke\t phir\t agle\nAmbiya\tko\tkiyuñ\tshaheed\tkiya\tagar\ttumheiñ\tapni\tkitāb\tpar\tImān\ttha\t"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "92",
    "arabicText": " وَلَقَدْ جَآءَكُم مُّوسَىٰ بِٱلْبَيِّنَـٰتِ ثُمَّ ٱتَّخَذْتُمُ ٱلْعِجْلَ مِنۢ بَعْدِهِۦ وَأَنتُمْ ظَـٰلِمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tindeed\tMoosa\tcame\tto\tyou\twith\tclear\tsigns,\tand\tafter\tit\tyou\tworshipped\tthe\tcalf\t- and\tyou\t\nwere\tunjust.\t”\t",
    "romanUrduTranslationText": ". Aur\t beshak\t tumhāre\t pās\t Mūsā khuli\t nishāniyāñ\t lekar\t tashreef\t lāya\t phir\t tum\t ne\t uske\t b'ād\t\nbachrde\tko\tma'bood\tbana\tliya\taur\ttum\tzalim\tthey"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "93",
    "arabicText": "وَإِذْ أَخَذْنَا مِيثَـٰقَكُمْ وَرَفَعْنَا فَوْقَكُمُ ٱلطُّورَ خُذُوا۟ مَآ ءَاتَيْنَـٰكُم بِقُوَّةٍۢ وَٱسْمَعُوا۟ ۖ قَالُوا۟ سَمِعْنَا وَعَصَيْنَا وَأُشْرِبُوا۟ فِى قُلُوبِهِمُ ٱلْعِجْلَ بِكُفْرِهِمْ ۚ قُلْ بِئْسَمَا يَأْمُرُكُم بِهِۦٓ إِيمَـٰنُكُمْ إِن كُنتُم مُّؤْمِنِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t remember\twhen\tWe\tmade\ta\t covenant\twith\t you\tand\t raised\t the\tMount\t Tur\t(Sinai)\tabove\t\nyou;\t “Accept\t and\t hold\t fast\t to\t what\t We\t give\t you,\t and\t listen”;\t they\t said,\t “We\t hear\t and\t we\t\ndisobey”;\tand\tthe\tcalf\twas\tstill\tembedded\tin\ttheir\thearts\tbecause\tof\ttheir\tdisbelief;\tsay\t(O\tdear\t\nProphet\tMuhammad - peace\tand\tblessings\tbe\tupon\thim),\t “What\tan\tevil\tcommand\tis\twhat\tyour\t\nfaith\torders\tyou,\tif\tyou\tare\tbelievers!”\t",
    "romanUrduTranslationText": "Aur\tyād\tkaro\tjab\tham\tne\ttum\tse\tpaiman\tliya\taur\tKoh-e-Toor\t\tko\ttumhāre saroñ\tpar\tbulañd\tkiya\t\nlo\tjo\tham\ttumheiñ\tdete\thaiñ zor\tse\taur\tsuno\tbole\tham\tne\tsuna\taur\tna\tmāna\taur\tunke\tdiloñ\tmeiñ\t\nbachrda\t rach\t raha\t tha\t unke\t kufr\t ke\t sabab, tum\t farmado\t kiya\t bura\t hukm\t deta\t hai\t tumko\t\ntumhāra\tImān\tagar\tImān\trakhte\tho"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "94",
    "arabicText": "قُلْ إِن كَانَتْ لَكُمُ ٱلدَّارُ ٱلْـَٔاخِرَةُ عِندَ ٱللَّهِ خَالِصَةًۭ مِّن دُونِ ٱلنَّاسِ فَتَمَنَّوُا۟ ٱلْمَوْتَ إِن كُنتُمْ صَـٰدِقِينَ ",
    "urduTranslationText": "",
    "englishTranslationText": "Say\t(O\tdear\tProphet\tMuhammad - peace\tand\t\nblessings\tbe\tupon\thim),\t “If\t the\tabode\tof\t the\t\nHereafter\t in\t the\t sight\t of\t Allah is\t for\t you\t\nalone\t and\t none else,\t then\tlong\t for\t death\tif\t\nyou\tare\ttruthful!”",
    "romanUrduTranslationText": "Tum\t farmao\t agar\t pichla\t ghar\t Allah\t ke\t\nnazdeek\tkhālis\ttumhāre\tliye\tho\tna\tauroñ\tke\t\nliye\t to\t bhala\t maut\t ki\t āarzoo\t to\t karo\t agar\t\nsachhe\tho"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "95",
    "arabicText": "وَلَن يَتَمَنَّوْهُ أَبَدًۢا بِمَا قَدَّمَتْ أَيْدِيهِمْ ۗ وَٱللَّهُ عَلِيمٌۢ بِٱلظَّـٰلِمِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t they\t will\t never\t long\t for\t it,\t because\t of\t\nthe\t evil\t deeds\t they\t have\t done\t in\t the\t past;\t\nand\tAllah knows\tthe\tunjust,\tvery\twell",
    "romanUrduTranslationText": "Aur\thargiz\tkabhi\tuski\tāarzu\tna\tkareñge\tun\t\nbad\t a'amaliyoñ\t ke\t sabab\t jo\t āge\t kar\t chuke\t\naur\tAllah\tkhoob\tjānta\thai\tzālimon\tko"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "96",
    "arabicText": "وَلَتَجِدَنَّهُمْ أَحْرَصَ ٱلنَّاسِ عَلَىٰ حَيَوٰةٍۢ وَمِنَ ٱلَّذِينَ أَشْرَكُوا۟ ۚ يَوَدُّ أَحَدُهُمْ لَوْ يُعَمَّرُ أَلْفَ سَنَةٍۢ وَمَا هُوَ بِمُزَحْزِحِهِۦ مِنَ ٱلْعَذَابِ أَن يُعَمَّرَ ۗ وَٱللَّهُ بَصِيرٌۢ بِمَا يَعْمَلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". And\tyou\twill\tsurely\tfind\tthem\tthe\tgreediest\t\namong\t mankind\t for\t life;\t and\t (likewise)\t\namong\tthe\tpolytheists\t(idolaters);\teach\tone\t\nof\t them\t yearns\t to\t live\t a\t thousand\t years;\t\nand\t the\tgrant\tof\tsuch\tage\twill\tnot\tdistance\t\nhim\t from\t the\t punishment;\t and\t Allah is\t\nseeing their\tmisdeeds.\t",
    "romanUrduTranslationText": "Aur\tbeshak\ttum\tzaroor\tunheñ\tpāo\tge\tke\tsab\t\nlogoñ\tse\tziyada\tjeene\tki\thawas\trakhte\thaiñ\t\naur\t mushrikoñ\t se\t ek\t ko\t tamanna\t hai\t ke\t\nkaheeñ\thazār\tbaras\tjiye\taur\twoh\tusey\t‘azāb\t\nse\t door\t na\t Karega\t itni\t umar\t diya\t jāna\t aur\t\nAllah\t unke\t Kautak (Bure\t Amal) dekh\t raha\t\nhai"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "97",
    "arabicText": "قُلْ مَن كَانَ عَدُوًّۭا لِّجِبْرِيلَ فَإِنَّهُۥ نَزَّلَهُۥ عَلَىٰ قَلْبِكَ بِإِذْنِ ٱللَّهِ مُصَدِّقًۭا لِّمَا بَيْنَ يَدَيْهِ وَهُدًۭى وَبُشْرَىٰ لِلْمُؤْمِنِينَ",
    "urduTranslationText": "",
    "englishTranslationText": ". Say\t(O\tdear\tProphet\tMuhammad - peace\tand\t\nblessings\t be\t upon\t him),\t “Whoever\t is\t an\t\nenemy\tto\tJibreel\t(Gabriel)”\t- for\tit\tis\the\twho\t\nhas\tbrought\tdown\tthis\tQu’ran\tto\tyour\theart\t\nby\tAllah’s\t command,\t confirming\t the\tBooks\t\nbefore\tit,\tand\ta\tguidance\tand\tglad\ttidings\tto\t\nMuslims.\t-\t\n",
    "romanUrduTranslationText": "Tum\t farmado\tjo\tkoi\t Jibreel\tka\tdushman\tho\t\nto\t us\t (Jibreel)\t ne\t to\t tumhāre\t dil\t par\t Allah\t\nke\thukm\tse\tyeh\tQur'ān\tutāra\tagli\tkitāboñ\tki\t\ntasdeeq\t farmāta\t aur\t hidāyat-o-basharat\t\nMusalmanoñ\tko"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "98",
    "arabicText": "مَن كَانَ عَدُوًّۭا لِّلَّهِ وَمَلَـٰٓئِكَتِهِۦ وَرُسُلِهِۦ وَجِبْرِيلَ وَمِيكَىٰلَ فَإِنَّ ٱللَّهَ عَدُوٌّۭ لِّلْكَـٰفِرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "“Whoever\t is\t an\t enemy\t to\t Allah,\t and\t His\t\nangels\t and\t His\t Noble\t Messengers,\t and\t\nJibreel\tand\tMikaeel\t(Michael)\t-,\tthen\t(know\t\nthat),\tAllah is\tan\tenemy\tof\tthe\tdisbelievers.”\t\n",
    "romanUrduTranslationText": ". Jo\tkoi\tdushman\tho\tAllah\taur\tuske\tFirishtoñ\t\nka\tuske\tRasooloñ\taur\tJibreel\taur\tMikaēel\tka\t\nto\tAllah\tdushman\thai\tkafiroñ\tka"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "99",
    "arabicText": "وَلَقَدْ أَنزَلْنَآ إِلَيْكَ ءَايَـٰتٍۭ بَيِّنَـٰتٍۢ ۖ وَمَا يَكْفُرُ بِهَآ إِلَّا ٱلْفَـٰسِقُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". We\t have\t indeed\t sent\t down\t to\t you\t clear\t signs;\t and\t none\t will\t disbelieve\t in\t them\t except\t the\t\nsinners.\t\t\n",
    "romanUrduTranslationText": "Aur\tbeshak\thum\tne\t tumhāri\t taraf\traushan\tĀyateiñ\tutāreeñ\taur\tunke\tmunkir\tna\thoñge\tmagar\t\nfāsiq\tlog"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "100",
    "arabicText": "أَوَكُلَّمَا عَـٰهَدُوا۟ عَهْدًۭا نَّبَذَهُۥ فَرِيقٌۭ مِّنْهُم ۚ بَلْ أَكْثَرُهُمْ لَا يُؤْمِنُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tis\tit\tthat\twhenever\tthey\tmake\ta\tcovenant,\tonly\ta\tgroup\tof\tthem\tthrows\tit\taside?\tIn\tfact,\t\nmost\tof\tthem\tdo\tnot have\tfaith.",
    "romanUrduTranslationText": "Aur\tkiya\tjab\tkabhi\tkoi\t‘ahed\tkarte\thaiñ\tun\tmeiñ\tka\tek\tfareeq\tusey\tpheñk\tdeta\thai\tbalki\tun\tmeiñ\t\nbahuteroñ\tko\tImān\tnahi"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "101",
    "arabicText": "وَلَمَّا جَآءَهُمْ رَسُولٌۭ مِّنْ عِندِ ٱللَّهِ مُصَدِّقٌۭ لِّمَا مَعَهُمْ نَبَذَ فَرِيقٌۭ مِّنَ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَـٰبَ كِتَـٰبَ ٱللَّهِ وَرَآءَ ظُهُورِهِمْ كَأَنَّهُمْ لَا يَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t when\t a\t Noble\t Messenger\t from\t Allah came\t to\t them,\t confirming\t the\t Book(s)\t which\t they\t\npossessed,\ta\tgroup\tof\tthose\twho\thave\treceived\tthe\tBook(s)\tflung\tthe\tBook\tof\tAllah behind\ttheir\t\nbacks\tas\tif\tthey\twere\ttotally\tunaware",
    "romanUrduTranslationText": ". Aur\tjab\tunke\tpās\ttashreef\tlāya\tAllah\tke\tyahāñ\tse\tek\tRasool\tunki\tkitāboñ\tki\ttasdeeq\tfarmāta\tto\t\nkitāb\twāloñ\tse\tek\tgiroh\tne\tAllah\tki\tkitāb\tapne\tpeeth\tpeechhe\tphenk\tdi\tgoya\twoh\tkuch\tilm\thi\t\nnahiñ\trakhte"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "102",
    "arabicText": "وَٱتَّبَعُوا۟ مَا تَتْلُوا۟ ٱلشَّيَـٰطِينُ عَلَىٰ مُلْكِ سُلَيْمَـٰنَ ۖ وَمَا كَفَرَ سُلَيْمَـٰنُ وَلَـٰكِنَّ ٱلشَّيَـٰطِينَ كَفَرُوا۟ يُعَلِّمُونَ ٱلنَّاسَ ٱلسِّحْرَ وَمَآ أُنزِلَ عَلَى ٱلْمَلَكَيْنِ بِبَابِلَ هَـٰرُوتَ وَمَـٰرُوتَ ۚ وَمَا يُعَلِّمَانِ مِنْ أَحَدٍ حَتَّىٰ يَقُولَآ إِنَّمَا نَحْنُ فِتْنَةٌۭ فَلَا تَكْفُرْ ۖ فَيَتَعَلَّمُونَ مِنْهُمَا مَا يُفَرِّقُونَ بِهِۦ بَيْنَ ٱلْمَرْءِ وَزَوْجِهِۦ ۚ وَمَا هُم بِضَآرِّينَ بِهِۦ مِنْ أَحَدٍ إِلَّا بِإِذْنِ ٱللَّهِ ۚ وَيَتَعَلَّمُونَ مَا يَضُرُّهُمْ وَلَا يَنفَعُهُمْ ۚ وَلَقَدْ عَلِمُوا۟ لَمَنِ ٱشْتَرَىٰهُ مَا لَهُۥ فِى ٱلْـَٔاخِرَةِ مِنْ خَلَـٰقٍۢ ۚ وَلَبِئْسَ مَا شَرَوْا۟ بِهِۦٓ أَنفُسَهُمْ ۚ لَوْ كَانُوا۟ يَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tthey\tfollowed\twhat\tthe\tdevils\tused\tto\t\nread\tduring\tthe\trule\tof\tSulaiman\t(Solomon\t\n- peace\t and\t blessings\t be\t upon\t him);\t and\t\nSulaiman did\tnot\tdisbelieve,\tbut\tthe\tdevils\t\ndisbelieved\t- they\tteach\tpeople\tmagic;\tand\t\nthat\t which\t was\t sent\t down\t to\t the\t two\t\nangels,\t Harut\t and\t Marut\t in\t Babylon;\t and\t\nthe\t two\t(angels)\t never\t taught\t a\t thing\t to\t\nanyone\t until\t they\t used\t to\t say,\t “We\t are\t\nonly\t a\t trial,\t therefore\t do\t not\t lose\t your\t\nfaith”\t and\t they\t used\t to\t learn\t from\t them\t\nthat\t by\t which\t they\t cause\t division\t\nbetween\t man\t and\t his\t wife;\t and\t they\t\ncannot\t harm\t anyone\t by\t it\t except\t by\t\nAllah’s\t command;\t and\t they\t learn\t what\t\nwill\t harm\t them,\t not\t benefit\t them;\t and\t\nsurely\t they\t know\tthat\t whoever\t bargains\t\nfor\t this\t will\t not\t have\t a\t share\t in\t the\t\nHereafter;\t and\t for\t what\t an\t abject\t thing\t\nthey\t have\t sold\t themselves;\t if\t only\t they\t\nknew!",
    "romanUrduTranslationText": "Aur\t uske\t pairo\t huwe\t jo\t shaitān\t padha\t\nkarte\tthey\tSaltanat-e-SulaImān ke\tzamāne\t\nmeiñ\t aur\t Sulaimān ne\t kufr\t na\t kiya\t hāñ\t\nshaitān\t kāfir\t huwe\tlogoñ\t ko\tjādu\t sikhāte\t\nhaiñ\t aur\t woh\t (jādu)\t jo\t Bābil\t meiñ\t do\t\nFirishtoñ\tHāroot\twa Māroot\t par\t utra\taur\t\nwoh\tdonoñ\tkisi\tko\tkuch na\tsikhāte\tjab\ttak\t\nyeh\t na\t kah\t lete\t ke\t ham\t to\t niri\t āzmāish\t\nhaiñ\ttu\tapnā\tImān\tna\tkho\tto unse\tseekhte\t\nwoh\t jis\t se\t judāi\t dāleiñ\t mard\t aur\t uski\t\naurat\tmeiñ\taur\tusse\tzarar\tnahi\tpahoñcha\t\nsakte\tkisi\tko\tmagar\tKhuda\tke\thukm\tse\taur\t\nwoh\t seekhte\t haiñ\tjo\t unheiñ\t nuqsān\t dega\t\nnafa'\t na\t dega\t aur\t beshak\t zaroor\t unheiñ\t\nma'loom\t hai\t ke\t jis\t ne\t yeh\t sauda\t liya\t\nĀkhirat\t me\t uska\t kuch\t hissa\t nahi\t aur\t\nbeshak\tkya\tburi\tcheez\thai\twoh\tjiske\tbadle\t\nunhoñ\tne\tapni\tjāneiñ\tbaychiñ\tkisi\ttarah\tunheiñ\tilm\thota"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "103",
    "arabicText": "وَلَوْ أَنَّهُمْ ءَامَنُوا۟ وَٱتَّقَوْا۟ لَمَثُوبَةٌۭ مِّنْ عِندِ ٱللَّهِ خَيْرٌۭ ۖ لَّوْ كَانُوا۟ يَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t had\t they\t believed\t and\t been\t pious,\t\nthen\t the\t recompense\t from\t Allah is\t\nextremely\tgood;\tif\tonly\tthey\tknew!\t",
    "romanUrduTranslationText": "Aur\tagar\twoh\tIman\tlāte\taur\tparhez-gāri\tkarte\tto\tAllah\tke\tyahāñ\tka\tswaab\tbahut\tachcha\thai\tkisi\t\ntarah\tunheiñ\tilm\thota\t\n"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "104",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَقُولُوا۟ رَٰعِنَا وَقُولُوا۟ ٱنظُرْنَا وَٱسْمَعُوا۟ ۗ وَلِلْكَـٰفِرِينَ عَذَابٌ أَلِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": ". O People\twho\t Believe,\t do\t not\t say\t(to\t the\t\nProphet\t Muhammad- peace\t and\t blessings\t\nbe\tupon\thim),\t“Raena\t(Be\tconsiderate\ttowards\tus)”\tbut\tsay,“Unzurna\t(Look\tmercifully\tupon\tus)\",\t\nand\t listen\t attentively\t from\t the\t start;\t and\t for\t the\t disbelievers\t is\t a\t painful\t punishment.\t (To\t\ndisrespect\tthe\tHoly\tProphet\t– peace\tand\tblessings\tbe\tupon\thim\t– is\tblasphemy.)",
    "romanUrduTranslationText": "Aey\tImān\twālo* Rā'ēna\tna\tkaho\taur\tyuñ\tarz\tkaro\tke\thuzoor\tham\tpar\tnazar\trakheiñ\taur\tpahle\thi\t\nse\tbaghaur\tsuno\taur\tkāfiro\tke\tliye\tdard\tnāk\t‘azāb\thai"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "105",
    "arabicText": "مَّا يَوَدُّ ٱلَّذِينَ كَفَرُوا۟ مِنْ أَهْلِ ٱلْكِتَـٰبِ وَلَا ٱلْمُشْرِكِينَ أَن يُنَزَّلَ عَلَيْكُم مِّنْ خَيْرٍۢ مِّن رَّبِّكُمْ ۗ وَٱللَّهُ يَخْتَصُّ بِرَحْمَتِهِۦ مَن يَشَآءُ ۚ وَٱللَّهُ ذُو ٱلْفَضْلِ ٱلْعَظِيمِ",
    "urduTranslationText": "",
    "englishTranslationText": "Those\twho\tdisbelieve\t- the\tPeople\tgiven\t the\tBook(s)\tor\t the\tpolytheists\t- do\tnot\twish\t that\tany\t\ngood\t be\t sent\t down\t upon\t you\t from\t your\t Lord;\t and\tAllah chooses\t whomever\t He wills\t by\t His\t\nMercy;\tand\tAllah is\tthe\tMost\tMunificent.\t",
    "romanUrduTranslationText": "Woh\tjo\tkāfir\thaiñ\tkitābi\tya\tmushrik\twoh\tnahi\tchāhte\tke\ttum\tpar\tkoi\tbhalāi\tutre\ttumhāre\tRab\tke\t\npās\tse\taur\tAllah\tapni\trahmat\tse\tkhās\tkarta\thai\tjise\tchāhe\taur\tAllah\tbade\tfazl\twala\thai."
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "105",
    "arabicText": "مَّا يَوَدُّ ٱلَّذِينَ كَفَرُوا۟ مِنْ أَهْلِ ٱلْكِتَـٰبِ وَلَا ٱلْمُشْرِكِينَ أَن يُنَزَّلَ عَلَيْكُم مِّنْ خَيْرٍۢ مِّن رَّبِّكُمْ ۗ وَٱللَّهُ يَخْتَصُّ بِرَحْمَتِهِۦ مَن يَشَآءُ ۚ وَٱللَّهُ ذُو ٱلْفَضْلِ ٱلْعَظِيمِ",
    "urduTranslationText": "",
    "englishTranslationText": "Those\twho\tdisbelieve\t- the\tPeople\tgiven\t the\tBook(s)\tor\t the\tpolytheists\t- do\tnot\twish\t that\tany\t\ngood\t be\t sent\t down\t upon\t you\t from\t your\t Lord;\t and\tAllah chooses\t whomever\t He wills\t by\t His\t\nMercy;\tand\tAllah is\tthe\tMost\tMunificent.\t",
    "romanUrduTranslationText": "Woh\tjo\tkāfir\thaiñ\tkitābi\tya\tmushrik\twoh\tnahi\tchāhte\tke\ttum\tpar\tkoi\tbhalāi\tutre\ttumhāre\tRab\tke\t\npās\tse\taur\tAllah\tapni\trahmat\tse\tkhās\tkarta\thai\tjise\tchāhe\taur\tAllah\tbade\tfazl\twala\thai."
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "106",
    "arabicText": " مَا نَنسَخْ مِنْ ءَايَةٍ أَوْ نُنسِهَا نَأْتِ بِخَيْرٍۢ مِّنْهَآ أَوْ مِثْلِهَآ ۗ أَلَمْ تَعْلَمْ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌ",
    "urduTranslationText": "",
    "englishTranslationText": "When\tWe\tabrogate\ta\tverse\tor\tcause\tit\tto\t\nbe\t forgotten,\t We\t will\t bring\t one\t better\t\nthan\tit\tor\tone\tsimilar;\tdo\tyou\tnot\tknow\t\nthat\tAllah is\tAble\tto\tdo\tall\tthings?\t",
    "romanUrduTranslationText": "Jab\tkoi\tĀayat\tham\tmansookh\t farmāyeiñ\t\nya\tbhula\tdeiñ\t to\tus\tse\tbehtar\tya\tus\tjaisi\t\nle\t āyeiñ\t ge.\t kya\t tujhe\t khabar\t nahi\t ke\t\nAllah\tsab\tkuch\tkar\tsakta\thai\t."
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "107",
    "arabicText": " أَلَمْ تَعْلَمْ أَنَّ ٱللَّهَ لَهُۥ مُلْكُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۗ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِن وَلِىٍّۢ وَلَا نَصِيرٍ",
    "urduTranslationText": "",
    "englishTranslationText": "Do\t you\t not\t know\t that\t for\tAllah only\t is\t\nthe\t kingship\t of\t the\t heavens\t and\t the\t\nearth?\t And\t except\t Allah, you\t have\t\nneither\ta\tprotector\tnor\tany\tsupporter?\t\t",
    "romanUrduTranslationText": "Kya\ttujhe\tkhabar\tnahi\tke\tAllah\thi\t\tke\tliye\t\nhai\tāsmanoñ\twa\tzameen\tki\tbādshahi\taur\t\nAllah\t ke\t siwa\t tumhāra\t na\t koi\t himayati\t\nna\tmadad-gār"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "108",
    "arabicText": "أَمْ تُرِيدُونَ أَن تَسْـَٔلُوا۟ رَسُولَكُمْ كَمَا سُئِلَ مُوسَىٰ مِن قَبْلُ ۗ وَمَن يَتَبَدَّلِ ٱلْكُفْرَ بِٱلْإِيمَـٰنِ فَقَدْ ضَلَّ سَوَآءَ ٱلسَّبِيلِ",
    "urduTranslationText": "",
    "englishTranslationText": "Do\t you\t wish\t to\t ask\t your\t Noble\t\nMessenger\t a\t question\t similar\t to\t what\t\nMoosa\twas\t asked\t before?\tAnd\twhoever\t\nchooses\t disbelief\t instead\t of\t faith\t has\t\ngone\tastray\tfrom\tthe\tRight\tPath\t\t",
    "romanUrduTranslationText": "Kya\t yeh\t chāhte\t ho\t ke\t apne\t Rasool\t se\t\nwaisa\tsuwāl\tkaro\tjo\tMūsā\tse\tpahle\thuwa\t\ntha\t aur\t jo\t Imān\t ke\t badle\t kufr\t le\t woh\t\ntheek\trāsta\tbahek\tgaya"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "109",
    "arabicText": "وَدَّ كَثِيرٌۭ مِّنْ أَهْلِ ٱلْكِتَـٰبِ لَوْ يَرُدُّونَكُم مِّنۢ بَعْدِ إِيمَـٰنِكُمْ كُفَّارًا حَسَدًۭا مِّنْ عِندِ أَنفُسِهِم مِّنۢ بَعْدِ مَا تَبَيَّنَ لَهُمُ ٱلْحَقُّ ۖ فَٱعْفُوا۟ وَٱصْفَحُوا۟ حَتَّىٰ يَأْتِىَ ٱللَّهُ بِأَمْرِهِۦٓ ۗ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "Many\t among\t People\t given\t the\t Book(s)\t\nwished\tto\tturn\tyou\tto\tdisbelief\tafter\tyou\t\nhad\t accepted\t faith;\t out\t of\t hearts’\t envy,\t\nafter\tthe\ttruth\thas\tbecome\tvery\tclear\tto\t\nthem;\t so\t leave\t them\t and\t be\t tolerant,\t\nuntil\tAllah brings\tHis\tcommand;\tindeed\t\nAllah is\tAble\tto\tdo\tall\tthings\t",
    "romanUrduTranslationText": "Bahut\tkitābiyoñ\tne\tchāha\tkāsh\t tumheiñ\t\nImān\t ke\t b’ad\t kufr\t ki\t taraf\t pher\t deiñ\t\napne\t diloñ\t ki\t jalan\t se\t b’ad\t iske\t ke\t haq\t\nunpar\t khoob\t zahir\t ho\t chuka\t hai\t to\t tum\t\nchodo\t aur\t dar-guzar\t karo\t yahāñ\t tak ki\t\nAllah\tapna\thukm\tlāye\tbeshak\tAllah\thar\tcheez\tpar\tqādir\thai"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "110",
    "arabicText": "وَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ ۚ وَمَا تُقَدِّمُوا۟ لِأَنفُسِكُم مِّنْ خَيْرٍۢ تَجِدُوهُ عِندَ ٱللَّهِ ۗ إِنَّ ٱللَّهَ بِمَا تَعْمَلُونَ بَصِيرٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t keep\t the\t prayer\t established,\t and\t\npay\tthe\tcharity;\tand\twhatever\tgood\tyou\t\nsend\tahead\t for\tyourselves,\tyou\twill\t find\t\nit\twith\tAllah;\tindeed\tAllah is\tseeing\tyour\t\ndeeds.\t\t",
    "romanUrduTranslationText": "Aur\tNamāz\tqāim\trakho\taur\tZakāt\tdo\taur\tapni\tjānoñ\tke\tliye\tjo\tbhalāi\tāge\tbhejo\tge\tusey\tAllah\tke\t\nyahāñ\tpao\tge\tbeshak\tAllah\ttumhāre\tkām\tdekh\traha\thai"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "111",
    "arabicText": "وَقَالُوا۟ لَن يَدْخُلَ ٱلْجَنَّةَ إِلَّا مَن كَانَ هُودًا أَوْ نَصَـٰرَىٰ ۗ تِلْكَ أَمَانِيُّهُمْ ۗ قُلْ هَاتُوا۟ بُرْهَـٰنَكُمْ إِن كُنتُمْ صَـٰدِقِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t the\t People\t given\t the\t Book(s)\t said,\t “None\t will\t enter\t Paradise\t unless\t he\t is\t a\t Jew\t or\t a\t\nChristian”;\t these\t are\t their\t own\t imaginations;\t say\t (O\t dear\t Prophet\t Muhammad - peace\t and\t\nblessings\tbe\tupon\thim),\t“Bring\tyour\tproof,\tif\tyou\tare\ttruthful.”",
    "romanUrduTranslationText": "Aur\tAhle-Kitāb\tbole\thargiz\tJannat\tmeiñ\tna\tjāye\tga\tmagar\twoh\tjo\tYahūdi\tya\tNasrāni\tho\tyeh\tunki\t\nkhayāl\tbandiyāñ\thaiñ\ttum\tfarmao\tlao\tapni\tdaleel\tagar\tsachche\tho"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "112",
    "arabicText": "بَلَىٰ مَنْ أَسْلَمَ وَجْهَهُۥ لِلَّهِ وَهُوَ مُحْسِنٌۭ فَلَهُۥٓ أَجْرُهُۥ عِندَ رَبِّهِۦ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Yes,\twhy\tnot?\tWhoever\tsubmits\this\tface\tfor\tthe\tsake\tof\tAllah,\tand\tis\tvirtuous,\this\treward\tis\twith\t\nhis\tLord;\tand\tthere\tshall\tbe\tno\tfear\tupon\tthem\tnor\tshall\tthey\tgrieve.\t",
    "romanUrduTranslationText": ". Hān\t kiyuñ\t nahi\t jis\t ne\t apna\t muñh\t jhukāya\t Allah\t ke\t liye\t aur\t woh\t nek-o-kār\t hai\t to\t uska\t neg\t\n(Badla)\tuske\tRab\tke\tpās\thai\taur\tunheiñ\tna\tkuch andesha\tho\taur\tna\tkuch\tgham"
  }
]