[
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "21",
    "arabicText": "وَإِذَآ أَذَقْنَا ٱلنَّاسَ رَحْمَةًۭ مِّنۢ بَعْدِ ضَرَّآءَ مَسَّتْهُمْ إِذَا لَهُم مَّكْرٌۭ فِىٓ ءَايَاتِنَا ۚ قُلِ ٱللَّهُ أَسْرَعُ مَكْرًا ۚ إِنَّ رُسُلَنَا يَكْتُبُونَ مَا تَمْكُرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t when\t We\t give\t mankind\t the\t taste\t of\t\nmercy\t after\t some\t hardship\t which\t had\t\nafflicted\t them,\t they\t immediately\t start\t\nconspiring\t against\t Our\t signs;\t proclaim,\t\n“The\t secret\t plan\t of\t Allah is\t the\t fastest”;\t\nindeed\tOur\tangels\trecord\tyour\tscheming.\t",
    "romanUrduTranslationText": "Aur\tjab\thum\tādmiyoñ\tko\trahmat\tka\tmaza\t\ndete\t haiñ\t kisi\t taklif\t ke\t bad\t jo\t unheiñ\t\npahuñchi\t thi\tjabhi\twoh\thamāri\tāyatoñ\tke\t\nsāth\t dāoñ\t chalte\t haiñ\t tum\t farmādo\tAllāh\t\nki\t khufyā\t tadbir sab\t se\t jald\t ho\t jāti\t hai\t\nbeshak\t Hamāre\t Firishte\t tumhāre\t makr\t\nlikh\trahe\theiñ"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "22",
    "arabicText": "هُوَ ٱلَّذِى يُسَيِّرُكُمْ فِى ٱلْبَرِّ وَٱلْبَحْرِ ۖ حَتَّىٰٓ إِذَا كُنتُمْ فِى ٱلْفُلْكِ وَجَرَيْنَ بِهِم بِرِيحٍۢ طَيِّبَةٍۢ وَفَرِحُوا۟ بِهَا جَآءَتْهَا رِيحٌ عَاصِفٌۭ وَجَآءَهُمُ ٱلْمَوْجُ مِن كُلِّ مَكَانٍۢ وَظَنُّوٓا۟ أَنَّهُمْ أُحِيطَ بِهِمْ ۙ دَعَوُا۟ ٱللَّهَ مُخْلِصِينَ لَهُ ٱلدِّينَ لَئِنْ أَنجَيْتَنَا مِنْ هَـٰذِهِۦ لَنَكُونَنَّ مِنَ ٱلشَّـٰكِرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "It\tis\tHe\tWho\ttransports\tyou\tover\tthe\tland\t\nand\t the\t sea;\t to\t the\t extent\t that\t when\t you\t\nare\tin\tships\t- and\tthe\tships\tsail\twith\tthem\t\nwith\ta\t favourable\tbreeze\tand\tthey\trejoice\t\nat\tit\t- a\tgust\tof\tstrong\twind\treaches\tthem\t\nand\twaves\tcome\t to\t them\t from\tevery\tside\t\nand\tthey\trealise\tthat\tthey\tare\tsurrounded,\t\n- thereupon\t they\t pray\t to\t Allah as\t His\t\nsincere\t bondmen\t that,\t “If\t You\t rescue\t us\t\nfrom\tthis,\twe\twill\tsurely\tbe\tthankful.”\t\t",
    "romanUrduTranslationText": "Wohi\t hai\t ki\t tumheiñ\t khushki\t aur\t tari\t\nmeiñ\t chalāta\t hai\t yahāñ\t tak\t ke\t jab\t tum\t\nkashti\t meiñ\t ho\t aur\t woh\t achi\t hawā\t se\t\nunheiñ\t le\t kar\t chaleiñ\t aur\t us\t par\t khush\t\nhuwe\tun\tpar\tāañdhi\tka\tjhokā\tāayā\taur\thar\t\ntaraf\tlehroñ\t ne\t unheiñ\t āaliyā\t aur\t samajh\t\ngaye\t ke\t hum\t ghir\t gaye\t us\t waqt\t Allāh\t ko\t\npukārte\thaiñ\tnire\t(khālis)\tus\tke\tbande\tho\t\nkar\tke\tagar\t tu\tis\tse\thameiñ\tbachā\tlegā\t to\t\nhum\tzarur\tshukr\tguzār\thoñge."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "23",
    "arabicText": "فَلَمَّآ أَنجَىٰهُمْ إِذَا هُمْ يَبْغُونَ فِى ٱلْأَرْضِ بِغَيْرِ ٱلْحَقِّ ۗ يَـٰٓأَيُّهَا ٱلنَّاسُ إِنَّمَا بَغْيُكُمْ عَلَىٰٓ أَنفُسِكُم ۖ مَّتَـٰعَ ٱلْحَيَوٰةِ ٱلدُّنْيَا ۖ ثُمَّ إِلَيْنَا مَرْجِعُكُمْ فَنُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Then\t when\t He\t rescues\t them,\t they\t start\t\nwrongfully\t committing\t oppression\t in\t the\t\nearth;\tO\tmankind!\tYour\toppression\tis\tonly\t\na\t torment\t against\t yourselves;\t derive\t the\t\nbenefit\t until\t you\t live\t in\t this\t world;\t you\t\nhave\t then\t to\t return\t to\tUs\t and\t thereupon\t\nWe\tshall\tshow\tyou\tyour\tmisdeeds.\t\nat\tit\t- a\tgust\tof\tstrong\twind\treaches\tthem\t\nand\twaves\tcome\t to\t them\t from\tevery\tside\t\nand\tthey\trealise\tthat\tthey\tare\tsurrounded,\t\n- thereupon\t they\t pray\t to\t Allah as\t His\t\nsincere\t bondmen\t that,\t “If\t You\t rescue\t us\t\nfrom\tthis,\twe\twill\tsurely\tbe\tthankful.”\t\t",
    "romanUrduTranslationText": ". Phir\tAllāh\tjab\tunheiñ\tbachā\tleta\thai\tjabhi\t\nwoh\t zameen\t meiñ\t nā\t haq\t ziyādti\t karne\t\nlagte\t haiñ\t aye\t logo\t tumhāri\t ziyādti\t\ntumhāri\t hi\t jānoñ\t ka\t wabāl\t hai\t dunyā\t ke\t\njite\t ji\t barat\t lo\t (fāidāh\t uthā\t lo)\t phir\t\ntumheiñ\t hamāri\t taraf\t phirnā\t hai\t us\twaqt\t\nhum\ttumheiñ\tjatā\tdeñge\tjo\ttumhāre\tkotak\t\n(kartoot)\tthe"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "24",
    "arabicText": "إِنَّمَا مَثَلُ ٱلْحَيَوٰةِ ٱلدُّنْيَا كَمَآءٍ أَنزَلْنَـٰهُ مِنَ ٱلسَّمَآءِ فَٱخْتَلَطَ بِهِۦ نَبَاتُ ٱلْأَرْضِ مِمَّا يَأْكُلُ ٱلنَّاسُ وَٱلْأَنْعَـٰمُ حَتَّىٰٓ إِذَآ أَخَذَتِ ٱلْأَرْضُ زُخْرُفَهَا وَٱزَّيَّنَتْ وَظَنَّ أَهْلُهَآ أَنَّهُمْ قَـٰدِرُونَ عَلَيْهَآ أَتَىٰهَآ أَمْرُنَا لَيْلًا أَوْ نَهَارًۭا فَجَعَلْنَـٰهَا حَصِيدًۭا كَأَن لَّمْ تَغْنَ بِٱلْأَمْسِ ۚ كَذَٰلِكَ نُفَصِّلُ ٱلْـَٔايَـٰتِ لِقَوْمٍۢ يَتَفَكَّرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". The\t example\t of\t the\t life\t of\t this\t world\t is\t\nsimilar\tto\tthe\twater\twhich\tWe\tsent\tdown\t\nfrom\t the\t sky,\t so\t due\t to\t it\t the\t earth’s\t\nvegetation\t grew\t in\t abundance\t - that\t\nwhich\t men\t and\t cattle\t eat;\t to\t the\t extent\t\nthat\t when\t the\t earth\t has\t taken\t on\t her\t\nornaments\tand\tis\twell\t beautified,\tand\t her\t owners\t thought\t that\tit\tis\twithin\t their\t control,\tOur\t\ncommand\t came\t to\t it\t at\t night\t or\t at\t day\t - so\t We\t made\t it\t harvested\t as\t if\t it\t had\t not\t existed\t\nyesterday;\tthis\tis\thow\tWe\texplain\tthe\tverses\tfor\tthe\tpeople\twho\tponder.",
    "romanUrduTranslationText": ". Dunyā\t ki\t zindagi\t ki kahāwat\t to\taeysi\t hi\t hai\tjaise\twoh\t pāni\t ke\t hum\t ne\tāasmān\t se\t utārā\t to\t us\t\nsabab\tzameen\tse\tugne\twāli\tchizeñ\tghani\t(ziyādah)\tho\tkar\tnikleñ\tjo\tkuch\tāadmi\taur\tchaupāye\t\nkhāte\thaiñ\t yahāñ\t tak\t ke\tjab\tzameen\tne\tapna\t singār\tle\tliyā\taur\t khoob\tārāsta\tho\tgai\taur\tus\t ke\t\nmālik\tsamjhe\tke\tyeh\thamāre\tbas\tmeiñ\tāgayi\thamārā\thukm\tus\tpar\tāayā\trāt\tmeiñ\tya\tdin\tmeiñ\tto\t\nhum\tne\tuse\tkar\tdiyā\tkāti\thui\tgoyā\tkal\t thi\thi\tnahiñ\thum\tyooñ\thi\tāyateiñ\tmufassal\tbayān\tkarte\t\nheiñ\tghaur\tkarne\twāloñ\tke\tliye"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "25",
    "arabicText": "وَٱللَّهُ يَدْعُوٓا۟ إِلَىٰ دَارِ ٱلسَّلَـٰمِ وَيَهْدِى مَن يَشَآءُ إِلَىٰ صِرَٰطٍۢ مُّسْتَقِيمٍۢ",
    "urduTranslationText": "",
    "englishTranslationText": ". And\tAllah calls\tto\tthe\tabode\tof\tpeace,\tand\tguides\twhomever\tHe\twills\ton\tthe\tStraight\tPath",
    "romanUrduTranslationText": "Aur\tAllāh\tsalāmati\tke\tghar\tki\ttaraf\tpukārtā\thai\taur\tjise\tchāhe\tseedhi\trāh\tchalātā\thai"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "26",
    "arabicText": "۞ لِّلَّذِينَ أَحْسَنُوا۟ ٱلْحُسْنَىٰ وَزِيَادَةٌۭ ۖ وَلَا يَرْهَقُ وُجُوهَهُمْ قَتَرٌۭ وَلَا ذِلَّةٌ ۚ أُو۟لَـٰٓئِكَ أَصْحَـٰبُ ٱلْجَنَّةِ ۖ هُمْ فِيهَا خَـٰلِدُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "For\t the\t people\t of\t virtue,\tis\tgoodness\tand\t\nmore\t than\t that;\t and\t neither\t will\t the\t\nblackness\t nor\t disgrace\t come\t upon\t their\t\nfaces;\t it\t is\t they\t who\t are\t the\t people\t of\t\nParadise;\tthey\twill\tabide\tin\tit\tforever.\t",
    "romanUrduTranslationText": "Bhalāi\twāloñ\tke\tliye\tbhalā\thai\taur\tis\tse\tbhi\t\nzāid\t aur\t un\t ke\t muñh\t par\t na\t chadhegi\t\nsiyāhi\t aur\t na\t khuwāri\t wohi\t Jannat\t wāle\t\nhaiñ\twoh\tus\tmeiñ\thamesha\traheñge."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "27",
    "arabicText": "وَٱلَّذِينَ كَسَبُوا۟ ٱلسَّيِّـَٔاتِ جَزَآءُ سَيِّئَةٍۭ بِمِثْلِهَا وَتَرْهَقُهُمْ ذِلَّةٌۭ ۖ مَّا لَهُم مِّنَ ٱللَّهِ مِنْ عَاصِمٍۢ ۖ كَأَنَّمَآ أُغْشِيَتْ وُجُوهُهُمْ قِطَعًۭا مِّنَ ٱلَّيْلِ مُظْلِمًا ۚ أُو۟لَـٰٓئِكَ أَصْحَـٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَـٰلِدُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t (for)\t those\t who\t earned\t evil\t *,\t the\t\nrecompense\t of\t evil\t is\t equal\t to\t it\t - and\t\ndisgrace\t will\t come\t upon\t them;\t they\t will\t\nhave\tno\tone\tto\tsave\tthem\tfrom\tAllah;\tas\tif\t\ntheir\t faces\tare\tcovered\twith\tpieces\tof\t the\t\ndark\tnight;\tit\tis\tthey\twho\tare\tthe\tpeople\tof\t\nthe\t fire;\t they\t will\t remain\tin\tit\t forever.\t(*\t\nThe\tdisbelievers.)",
    "romanUrduTranslationText": "Aur\t jinhoñ\t ne\t burāiyān\t kamāiñ\t to\t burāi\t\nka\t badlā\t usi\t jaisa\t aur\t un\t par\t zillat\t\nchadhegi\t unheiñ\t Allāh\t se\t bachāne\t wālā\t\nkoi\t na\t hogā\t goyā\t un\t ke\t chehroñ\t par\t\nandheri\t rāt\t ke\t tukde\t chadha\t diye\t haiñ\t\nwohi\t dozakh\t wāle\t haiñ\t woh\t us\t meiñ\t\nhamesha\traheñ\tge"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "28",
    "arabicText": "وَيَوْمَ نَحْشُرُهُمْ جَمِيعًۭا ثُمَّ نَقُولُ لِلَّذِينَ أَشْرَكُوا۟ مَكَانَكُمْ أَنتُمْ وَشُرَكَآؤُكُمْ ۚ فَزَيَّلْنَا بَيْنَهُمْ ۖ وَقَالَ شُرَكَآؤُهُم مَّا كُنتُمْ إِيَّانَا تَعْبُدُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\ton\tthe\tday\twhen\tWe\traise\tall\tof\tthem\t\ntogether,\tthen\tsay\tto\tthe\tpolytheists,\t“Stay\t\nin\tyour\tplace\t- you\tand\tyour\tpartners (false\t\ndeities)”;\t so\t We\t shall\t separate\t them\t from\t\nthe\tbelievers,\tand\ttheir\tpartners\twill\tsay\tto\t\nthem,\t“When\tdid\tyou\tever\tworship\tus!?”",
    "romanUrduTranslationText": "Aur\tjis\tdin\thum\tun\tsab\tko\tuthāyeñge\tphir\t\nmushrikoñ\t se\t farmāyeñ\t ge\t apni\t jagah\t\nraho\t tum\t aur\t tumhāre\t sharik\t to\t hum\t\nunheiñ\t Musalmānoñ\t se\t judā\t kar\t deñge\t\naur\t un\t ke\t sharik\t un\t se\t kaheñge\t tum\t\nhameiñ\tkab\tpoojte\tthe"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "29",
    "arabicText": "فَكَفَىٰ بِٱللَّهِ شَهِيدًۢا بَيْنَنَا وَبَيْنَكُمْ إِن كُنَّا عَنْ عِبَادَتِكُمْ لَغَـٰفِلِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "“Therefore\t Allah suffices\t as\t a\t Witness\t\nbetween\t us\t and\t you,\t that\t we\t were\t not\t\neven\taware\tthat\tyou\tworshipped\tus!”",
    "romanUrduTranslationText": "To\t Allāh\t gawāh\t kāfi\t hai\t hum\t meiñ\t aur\t\ntum\t meiñ\t ke\t Hameiñ\t tumhāre\t poojne\t ki\t\nkhabar\tbhi\tna\tthi"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "30",
    "arabicText": "هُنَالِكَ تَبْلُوا۟ كُلُّ نَفْسٍۢ مَّآ أَسْلَفَتْ ۚ وَرُدُّوٓا۟ إِلَى ٱللَّهِ مَوْلَىٰهُمُ ٱلْحَقِّ ۖ وَضَلَّ عَنْهُم مَّا كَانُوا۟ يَفْتَرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Here\twill\tevery\tsoul\tcome\tto\tknow\twhat\tit\t\nhas\tsent\tahead,\tand\tthey\twill\tbe\treturned\t\nto\tAllah - their\t true\tMaster,\tand\t they\twill\t\nlose\tall\tthat\tthey\tused\tto\tfabricate.\t",
    "romanUrduTranslationText": "Yahāñ\thar\tjān\tjanch\tlegi\tjo\tāage\tbhejā\taur\t\nAllāh\t ki\t taraf\t phere\t jāyeñ\t ge\t jo\t un\t ka\t\nsacha\tmaula\taur\tun\tki\tsāri\tbanawateñ\tun\t\nse\tgum\tho\tjāyeñgi."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "31",
    "arabicText": "قُلْ مَن يَرْزُقُكُم مِّنَ ٱلسَّمَآءِ وَٱلْأَرْضِ أَمَّن يَمْلِكُ ٱلسَّمْعَ وَٱلْأَبْصَـٰرَ وَمَن يُخْرِجُ ٱلْحَىَّ مِنَ ٱلْمَيِّتِ وَيُخْرِجُ ٱلْمَيِّتَ مِنَ ٱلْحَىِّ وَمَن يُدَبِّرُ ٱلْأَمْرَ ۚ فَسَيَقُولُونَ ٱللَّهُ ۚ فَقُلْ أَفَلَا تَتَّقُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Say,\t(O\t dear\t Prophet\t Muhammad - peace\t\nand\tblessings\tbe\tupon\thim),\t“Who\tprovides\t\nyou\t sustenance\t from\t the\t sky\t and\t the\t\nearth?\t Or\t Who\t is\t the\t Owner\t of\t the\t ears\t\nand\t the\teyes?\tAnd\tWho\t brings\t forth\t the\tliving\t from\t the\t dead\tand\tWho\t brings\t forth\t the\t dead\t\nfrom\tthe\tliving?\tAnd\tWho\tplans\tall\tmatters?”\tSo\tthey\twill\tnow\tsay,\t“Allah”;\ttherefore\tsay,\t“Then\t\nwhy\tdo\tyou\tnot\tfear?”\t",
    "romanUrduTranslationText": ". Tum\t farmāo\t tumheiñ\t kaun\t rozi\t detā\t hai\t\nāasmān\tAur\tzameen\tse\tya\tkaun\tmālik\thai\t\nkān\taur\tānkhoñ\tkā\taur\tkaun\tnikālta\thai\tzinda\tko\tmurde\tse\taur\tkaun\tnikālta\thai\tmurda\tko\tzinde\t\nse\taur\t kaun\t tamām\t kamoñ\t ki\t tadbir\t kartā\t hai\t to\tab\t kaheñge\t ke\tAllāh\t to\t tum\t farmāo\t to\t kyuñ\t\nnahiñ\tdarte\t"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "32",
    "arabicText": "فَذَٰلِكُمُ ٱللَّهُ رَبُّكُمُ ٱلْحَقُّ ۖ فَمَاذَا بَعْدَ ٱلْحَقِّ إِلَّا ٱلضَّلَـٰلُ ۖ فَأَنَّىٰ تُصْرَفُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "So\tsuch\tis\tAllah,\tyour\tTrue\tLord;\ttherefore\twhat\tremains\tafter\tthe\ttruth,\texcept\terror?\tSo\twhere\t\nare\tyou\treverting?\t",
    "romanUrduTranslationText": "To\tyeh\tAllāh\thai\ttumhārā\tsachā\tRab\tphir\thaq\tke\tb’ad\tkyā\thai\tmagar\tgumrāhi\tphir\tkahāñ\tphire\t\njāte\tho"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "33",
    "arabicText": "كَذَٰلِكَ حَقَّتْ كَلِمَتُ رَبِّكَ عَلَى ٱلَّذِينَ فَسَقُوٓا۟ أَنَّهُمْ لَا يُؤْمِنُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "This\tis\thow\tthe\tWord\tof\tyour\tLord\tis\tproved\tconcerning\tthe\tsinful,\tso\tthey\twill\tnot\tbelieve\t",
    "romanUrduTranslationText": "Yuñ\thi\tsābit\tho\tchuki\thai\ttere\tRab\tki\tbāt\tfāsiqoñ\tpar\tto\twoh\tImān\tnahiñ\tlāyeñge.\t"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "34",
    "arabicText": "قُلْ هَلْ مِن شُرَكَآئِكُم مَّن يَبْدَؤُا۟ ٱلْخَلْقَ ثُمَّ يُعِيدُهُۥ ۚ قُلِ ٱللَّهُ يَبْدَؤُا۟ ٱلْخَلْقَ ثُمَّ يُعِيدُهُۥ ۖ فَأَنَّىٰ تُؤْفَكُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Say,\t “Is\t there\t any\t one\t among\t your\t\npartners\t(false\tdeities)\tthat\tcan\tcreate\t for\t\nthe\tfirst\ttime\tand\tthen\tafter\tits\textinction,\t\ncreate\t it\t again?”\t Proclaim,\t “Allah creates\t\nfor\t the\t first\t time\t and\t then\t after\t its\t\nextinction,\tcreates\tit\tagain\t- so\twhere\tare\t\nyou\treverting?”\t",
    "romanUrduTranslationText": "Tum\t farmāo\t tumhāre\t shārikoñ\t meiñ\t koi\t\naeysa\t hai\t ke\t awwal\t banāye\t phir\t fanā\t ke\t\nbād\t do\t barā\t banāye\t tum\t farmāo\t Allāh\t\nawwal\t banātā\t hai\t phir\t fanā\t ke\t bād\t do\t\nbarā\tbanāye\tga\tto\tkahāñ\tauñdhe\tjāte\tho?"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "35",
    "arabicText": "قُلْ هَلْ مِن شُرَكَآئِكُم مَّن يَهْدِىٓ إِلَى ٱلْحَقِّ ۚ قُلِ ٱللَّهُ يَهْدِى لِلْحَقِّ ۗ أَفَمَن يَهْدِىٓ إِلَى ٱلْحَقِّ أَحَقُّ أَن يُتَّبَعَ أَمَّن لَّا يَهِدِّىٓ إِلَّآ أَن يُهْدَىٰ ۖ فَمَا لَكُمْ كَيْفَ تَحْكُمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Say,\t “Is\t there\t any\t among\t your\t partners\t\nthat\t shows\t the\t right\t path?”\t Say,\t “Allah\nshows\t the\t right\t path;\t so\t who\t should\t be\t\nobeyed\t - the\t One\t Who\t shows\t the right\t\npath,\t or\t one\t who\t does\t not\t even\t find\t the\t\nright\t path\t unless\t he\t is\t guided?\t So\t what\t\nhas\t happened\t to\t you?\t What\t sort\t of\t a\t\njudgement\tyou\timpose!”",
    "romanUrduTranslationText": ". Tum\t farmāo\t tumhāre\t shārikoñ\t meiñ\t koi\t\naeysa\t hai\t ke\t Haq\t ki\t rāh\t dikhāye\t tum\t\nfarmāo\tke\tAllāh\thaq\tki\trāh\tdikhāta\thai\tto\t\nkyā\tjo\thaq\tki\trāh\tdikhāye\tus\tke\thukm\tpar\t\nchalnā\tchāhiye\tyā\tus\tke\tjo\tkhud\thi\trāh\tna\t\npāye\t jab\t tak\t rāh\t na\t dikhāyā\t jaye\t to\t\ntumheiñ\tkyā\thuwā\tkaisa\thukm\tlagāte\tho"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "36",
    "arabicText": "وَمَا يَتَّبِعُ أَكْثَرُهُمْ إِلَّا ظَنًّا ۚ إِنَّ ٱلظَّنَّ لَا يُغْنِى مِنَ ٱلْحَقِّ شَيْـًٔا ۚ إِنَّ ٱللَّهَ عَلِيمٌۢ بِمَا يَفْعَلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tmost\tof\t them\tdo\tnot\t follow\tanything\t\nexcept\t assumptions;\t indeed\t assumption\t\ndoes\tnot\tserve\tthe\tleast\tpurpose\t(in\tplace)\t\nof\t the\t truth;\t indeed\t Allah knows\t their\t\ndeeds.\t",
    "romanUrduTranslationText": "Aur\tun\tmeiñ\taksar\t to\tnahiñ\tchalte\tmagar\t\ngumān\t par\t beshak\t gumān\t haq\t kā\t kuch\t\nkām\t nahiñ\t deta\t beshak\t Allāh\t un\t ke\t\nkāmoñ\tko\tjāntā\thai"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "37",
    "arabicText": "وَمَا كَانَ هَـٰذَا ٱلْقُرْءَانُ أَن يُفْتَرَىٰ مِن دُونِ ٱللَّهِ وَلَـٰكِن تَصْدِيقَ ٱلَّذِى بَيْنَ يَدَيْهِ وَتَفْصِيلَ ٱلْكِتَـٰبِ لَا رَيْبَ فِيهِ مِن رَّبِّ ٱلْعَـٰلَمِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t this\t noble\t Qur’an\t is\t not\t such\t that\t\nanyone\t can\t invent\t it,\t without\t Allah\nrevealing\tit\t- but\tit\tsurely\tis\ta\tconfirmation\t\nof\t the\t Books\t preceding\t it\t and\t is\t an\t\nexplanation\t of\t all\t that\t is\t written\t on\t the\t\n(preserved)\ttablet\t- there\tis\tno\tdoubt\tin\tit\t-\nit\tis\tfrom\tthe\tLord\tOf\tThe\tCreation",
    "romanUrduTranslationText": "Aur\t is\t Qur’ān\t ki\t yeh\t Shān\t nahiñ\t ke\t koi\t\napni\ttaraf\tse\tbanā\tle\tbe\tAllāh\tke\tutāre\thāñ\t\nwoh\t agli\t kitāboñ\t ki\t tasdiq\t aur\tlauh\tmeiñ\t\njo\tkuch\tlikhā\tsab\tki\ttafsil\thai\tis\tmeiñ\tkuch\t\nshak\t nahiñ\t Parwardigār-e-Ālam\t ki\t taraf\t\nse\thai"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "38",
    "arabicText": "أَمْ يَقُولُونَ ٱفْتَرَىٰهُ ۖ قُلْ فَأْتُوا۟ بِسُورَةٍۢ مِّثْلِهِۦ وَٱدْعُوا۟ مَنِ ٱسْتَطَعْتُم مِّن دُونِ ٱللَّهِ إِن كُنتُمْ صَـٰدِقِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "What!\t They\t dare\t say\t that\t “He\t has\t\nfabricated\t it”?\t Say,\t “Then\t bring\t one\t\nchapter\t like\t it\t and,\t other\t than\tAllah,\t call\t\neveryone\tyou\tcan\tif\tyou\tare\ttruthful.”\t",
    "romanUrduTranslationText": "Kyā\tyeh\tkehte\thaiñ\tunhoñ\tne\tise\tbanā\tliyā\t\nhai\ttum\tfarmāo\tto\tis\tjaisi\tek\tsoorat\tle\tāao\t\naur\tAllāh\tko\tchod\tkar\tjo\tmil\tsakeñ\tsab\tko\t\nbulā\tlāo\tagar\ttum\tsache\tho"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "39",
    "arabicText": "بَلْ كَذَّبُوا۟ بِمَا لَمْ يُحِيطُوا۟ بِعِلْمِهِۦ وَلَمَّا يَأْتِهِمْ تَأْوِيلُهُۥ ۚ كَذَٰلِكَ كَذَّبَ ٱلَّذِينَ مِن قَبْلِهِمْ ۖ فَٱنظُرْ كَيْفَ كَانَ عَـٰقِبَةُ ٱلظَّـٰلِمِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "On\tthe\tcontrary,\tthey\tdenied\tthe\tthing\tthe\tknowledge\tof\twhich\tthey\tcould\tnot\tmaster,\twhereas\t\nthey\thave\tnot\tyet\tseen\tits\toutcome;\tsimilarly\tthose\tbefore\tthem\thad\tdenied,\ttherefore\tsee\twhat\t\nsort\tof\tfate\tbefell\tthe\tunjust!\t",
    "romanUrduTranslationText": ". Balke\tuse\tjhutlayā\tjis\tke\t‘ilm\tpar\tqāboo\tna\tpāyā\taur\tabhi\tunhoñ\tne\tus\tka\tanjām\tnahiñ\tdekha\thai\t\naeyse\thi\tun\tse\tagloñ\tne\tjhutlayā\tthā\tto\tdekho\tzālimoñ\tkā\tanjām\tkaisa\thuwā"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "40",
    "arabicText": "وَمِنْهُم مَّن يُؤْمِنُ بِهِۦ وَمِنْهُم مَّن لَّا يُؤْمِنُ بِهِۦ ۚ وَرَبُّكَ أَعْلَمُ بِٱلْمُفْسِدِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tamong\t them\tis\t one\twho\taccepts\t faith\tin\tit,\tand\tamong\t them\tis\t one\twho\tdoes\tnot\taccept\t\nfaith\tin\tit;\tand\tyour\tLord\twell\tknows\tthe\tmischievous.\t",
    "romanUrduTranslationText": ". Aur\tun\tmeiñ\tkoi\tis\tpar\tImān\tlātā\taur\tkoi\tis\tpar\tImān\tnahiñ\tlātā\thai\taur\ttumhārā\tRab\tmufsidoñ\t\n(fasād\tkarne\twāloñ)\tko\tkhoob\tjāntā\thai."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "41",
    "arabicText": "وَإِن كَذَّبُوكَ فَقُل لِّى عَمَلِى وَلَكُمْ عَمَلُكُمْ ۖ أَنتُم بَرِيٓـُٔونَ مِمَّآ أَعْمَلُ وَأَنَا۠ بَرِىٓءٌۭ مِّمَّا تَعْمَلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". And\t if\t they\t deny\t you,\t say,\t “For\t me\t are\t my\t deeds,\t and\t for\t you\t are\t your\t deeds;\t you\t have\t no\t\nconcern\twith\twhat\tI\tdo,\tand\tI\thave\tno\trelation\twith\twhat\tyou\tdo.”\t",
    "romanUrduTranslationText": ". Aur\tagar\twoh\ttumheiñ\tjhutlāyeñ\tto\tfarmā\tdo\tke\tmere\tliye\tmeri\tkarni\taur\ttumhāre\tliye\ttumhāri\t\nkarni\ttumheiñ\tmere\tkām\tse\tilāqa\t(t’alluq)\tnahiñ\taur\tmujhe\ttumhāre\tkām\tse\tt’alluq\tnahiñ\t"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "42",
    "arabicText": "وَمِنْهُم مَّن يَسْتَمِعُونَ إِلَيْكَ ۚ أَفَأَنتَ تُسْمِعُ ٱلصُّمَّ وَلَوْ كَانُوا۟ لَا يَعْقِلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And among\tthem\tare\tsome\twho\tlisten\tto\tyou;\tso\twill\tyou\tmake\tthe\tdeaf\thear\teven\tif\tthey\tdo\tnot\t\nhave\tany\tsense?",
    "romanUrduTranslationText": "Aur\t un\tmeiñ\t koi\twoh\t haiñ\tjo\t tumhāri\t taraf\t kān\tlagāte\t haiñ\t to\t kyā\t tum\t behroñ\t ko\t sunā\t doge\t\nagarche\tunheiñ\taql\tna\tho"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "43",
    "arabicText": "وَمِنْهُم مَّن يَنظُرُ إِلَيْكَ ۚ أَفَأَنتَ تَهْدِى ٱلْعُمْىَ وَلَوْ كَانُوا۟ لَا يُبْصِرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tamong\tthem\tis\tone\twho\tgazes\tat\tyou;\t\nso\twill\t you\tguide\t the\t blind\t *\teven\tif\t they\t\ncannot\t perceive?\t (* Deaf or blind to \nguidance.) ",
    "romanUrduTranslationText": "Aur\tun\tmeiñ\tkoi\ttumhāri\ttaraf\ttaktā\thai\tto\t\nkyā\t tum\t andhoñ\t ko\t rāh\t dikhā\t doge\t\nagarche\twoh\tna\tsoojheñ\t(na\tdekh\tsakeñ)"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "44",
    "arabicText": "إِنَّ ٱللَّهَ لَا يَظْلِمُ ٱلنَّاسَ شَيْـًۭٔا وَلَـٰكِنَّ ٱلنَّاسَ أَنفُسَهُمْ يَظْلِمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". Indeed\tAllah does\tnot\toppress\tmen\tat\tall,\t\nbut\tthey\tdo\twrong\tthemselves.\t",
    "romanUrduTranslationText": ". Beshak\t Allāh\t logoñ\t par\t kuch\t zulm\t nahiñ\t\nkartā\thāñ log\thi\tapni\tjānoñ\tpar\tzulm\tkarte\t\nhaiñ"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "45",
    "arabicText": "وَيَوْمَ يَحْشُرُهُمْ كَأَن لَّمْ يَلْبَثُوٓا۟ إِلَّا سَاعَةًۭ مِّنَ ٱلنَّهَارِ يَتَعَارَفُونَ بَيْنَهُمْ ۚ قَدْ خَسِرَ ٱلَّذِينَ كَذَّبُوا۟ بِلِقَآءِ ٱللَّهِ وَمَا كَانُوا۟ مُهْتَدِينَ",
    "urduTranslationText": "",
    "englishTranslationText": ". And\t on\t the\t day\t when\tHe\t will\t raise\t all\t of\t\nthem\ttogether,\tas\tif\tthey\thad\tnever\tstayed\t\non\tearth\texcept\t for\ta\tmoment\t during\t the\t\nday,\t they\t will\t recognise\t one\t another;\t for\t\ncompletely\t ruined\t are\t those\t who\t denied\t\nthe\t meeting\t with\t Allah and\t were\t not\t on\t\nguidance.\t",
    "romanUrduTranslationText": "Aur\t jis\t din\t unheiñ\t uthāyega\t goyā\t dunyā\t\nmeiñ\tna\trahe\tthe\tmagar\tus\tdin\tki\tek\tghari\t\nāpas\tmeiñ\tpahchān\tkareñ\tge\tpoore\tghāte\t\nmeiñ\t rahe\t woh\t jinhoñ\t ne\t Allāh\t se\t milne\t\nko\tjhutlāyā\taur\thidāyat\tpar\tna\tthe"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "46",
    "arabicText": "وَإِمَّا نُرِيَنَّكَ بَعْضَ ٱلَّذِى نَعِدُهُمْ أَوْ نَتَوَفَّيَنَّكَ فَإِلَيْنَا مَرْجِعُهُمْ ثُمَّ ٱللَّهُ شَهِيدٌ عَلَىٰ مَا يَفْعَلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t whether\t We\t show\t you\t (O\t dear\t\nProphet\tMuhammad - peace\t and\t blessings\t\nbe\t upon\t him)\t part\t of\t what\t We\t promise\t\nthem\tor\twhether\tWe\tcall\tyou\t towards\tUs\t\nbefore\tit\t- in\tany\tcase\tthey\thave\tto\treturn\t\nto\t Us\t- then\tAllah is\t the\tWitness\t of\t their\t\ndeeds.\t\t",
    "romanUrduTranslationText": "Aur\tagar\thum\ttumheiñ\tdikhā\tdeiñ\tkuch\tus\t\nmeiñ\t se\tjo\t unheiñ\tw’adā\t de\t rahe\t haiñ\t yā\t\ntumheiñ\t pehle\t hi\t apne\t pās\t bulā\t leiñ\t ba\u0002har\t hāl\t unheiñ\t hamāri\t taraf\t palatkar\t ānā\t\nhai\tphir\tAllāh\tgawāh\thai\tun\tke\tkāmoñ\tpar."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "47",
    "arabicText": "وَلِكُلِّ أُمَّةٍۢ رَّسُولٌۭ ۖ فَإِذَا جَآءَ رَسُولُهُمْ قُضِىَ بَيْنَهُم بِٱلْقِسْطِ وَهُمْ لَا يُظْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". And\t in\t every\t nation\t was\t a\t Noble\t\nMessenger\t (from\t Allah);\t so\t when\t their\t\nNoble\tMessenger\tcame\tto\tthem,\tthey\twere\t\njudged\t with\t fairness,\t and\t they\t were\t not\t\nwronged\t",
    "romanUrduTranslationText": "Aur\thar\tummat\tmeiñ\tek\tRasool\thuwā\tjab\t\nunka\tRasool\tunke\tpās\tāatā\tun\tpar\tinsāf\tka\t\nfaislā\t kar\t diya\t jāta\t aur\t un\t par\t zulm\t na\t\nhota"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "48",
    "arabicText": "وَيَقُولُونَ مَتَىٰ هَـٰذَا ٱلْوَعْدُ إِن كُنتُمْ صَـٰدِقِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t they\t say,\t “When\t will\t this\t promise\t\ncome,\tif\tyou\tare\ttruthful?",
    "romanUrduTranslationText": "Aur\tkehte\thaiñ\tyeh\twadā\tkab\tāye\tga\tagar\t\ntum\tsache\tho\t\n"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "49",
    "arabicText": "قُل لَّآ أَمْلِكُ لِنَفْسِى ضَرًّۭا وَلَا نَفْعًا إِلَّا مَا شَآءَ ٱللَّهُ ۗ لِكُلِّ أُمَّةٍ أَجَلٌ ۚ إِذَا جَآءَ أَجَلُهُمْ فَلَا يَسْتَـْٔخِرُونَ سَاعَةًۭ ۖ وَلَا يَسْتَقْدِمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Say,\t “I\t have\t no\t autonomy\t to\t benefit\t or\t\nhurt\tmyself,\texcept\twhat\tAllah wills\t*;\tfor\t\nevery\t nation\t is\t a\t fixed\t promise;\t when\t\ntheir\t promise\t comes,\t they\t cannot\t postpone\t it\t nor\t can\t they\t advance\t it\t one\t moment.\t (*\t To\t\nempower\tme.)\t",
    "romanUrduTranslationText": ". Tum\t farmāo\tmaiñ\tapni\tjān\tke\tbhale\tbure\t\nkā\t źati\t ikhtiyār\t nahiñ\t rakhtā\t magar\t jo\t\nAllāh\tchāhe\thar\tgiroh\tka\tek\tw’adā\thai\tjab\t\nunka\t w’adā\t āaye\t ga\t to\t ek\t ghari\t na\t piche\t\nhateñ\tna\tāage\tbadheñ"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "50",
    "arabicText": "قُلْ أَرَءَيْتُمْ إِنْ أَتَىٰكُمْ عَذَابُهُۥ بَيَـٰتًا أَوْ نَهَارًۭا مَّاذَا يَسْتَعْجِلُ مِنْهُ ٱلْمُجْرِمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Say,\t“What\tis\tyour\topinion\t- if\tHis\tpunishment\tcomes\tupon\tyou\tat\tnight\tor\tduring\t the\tday,\tso\t\nwhat\tis\tthere\tin\tit\tfor\twhich\tthe\tguilty\tare\tbeing\thasty?”",
    "romanUrduTranslationText": "Tum\tfarmāo\tbhalā\tbatāo\tto\tagar\tus\tkā\t‘azāb\ttum\tpar\trāt\tko\tāye\tyā\tdin\tko\tto\tus\tmeiñ\twoh\tkaunsi\t\nchiz\thai\tke\tmujrimoñ\tko\tjis\tki\tjaldi\thai"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "51",
    "arabicText": "أَثُمَّ إِذَا مَا وَقَعَ ءَامَنتُم بِهِۦٓ ۚ ءَآلْـَٔـٰنَ وَقَدْ كُنتُم بِهِۦ تَسْتَعْجِلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "So\twill\t you\t believe\tit\t only\twhen\tit\t has\t occurred?\tWhat!\t You\t believe\tin\tit\t now,\twhereas\t you\t\nwere\timpatient\t*\tfor\tit\tbefore?\t(*\tEagerly\tdemanding\tfor\tit\tto\toccur.)",
    "romanUrduTranslationText": "To\tkyā\tjab\tho\tpade\tgā\tus\twaqt\tus\tkā\tyaqin\tkaroge\tkyā\tab\tmānte\tho\tpahle\t to\tis\tki\tjaldi\tmachā\t\nrahe\tthe"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "52",
    "arabicText": "ثُمَّ قِيلَ لِلَّذِينَ ظَلَمُوا۟ ذُوقُوا۟ عَذَابَ ٱلْخُلْدِ هَلْ تُجْزَوْنَ إِلَّا بِمَا كُنتُمْ تَكْسِبُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Then\tthe\tunjust\twill\tbe\ttold,\t“Taste\tthe\tpunishment\t forever;\tand\tyou\twill\tbe\trepaid\tonly\twhat\t\nyou\tused\tto\tearn.”\t",
    "romanUrduTranslationText": "Phir\tzālimoñ\tse\tkahā\tjāyegā\thameshā\tkā\t‘azāb\tchakho\ttumheiñ\tkuch\taur\tbadlā\tna\tmile\tgā\tmagar\t\nwohi\tjo\tkamāte\tthe"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "53",
    "arabicText": "۞ وَيَسْتَنۢبِـُٔونَكَ أَحَقٌّ هُوَ ۖ قُلْ إِى وَرَبِّىٓ إِنَّهُۥ لَحَقٌّۭ ۖ وَمَآ أَنتُم بِمُعْجِزِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tthey\task\tyou\t“Is\tit\ta\treality\t*?”\tSay,\t“Yes,\tby\toath\tof\tmy\tLord,\tindeed\tsurely\tit\tis\ta\treality,\t\nand\tyou\twill\tnot\tbe\table\tto\tescape.”\t(*\tThe\tpunishment\tof\tthe\thereafter.)",
    "romanUrduTranslationText": "Aur\t tum\t se\t poochte\t haiñ\t kyā\t woh\tHaq\t hai\t tum\t farmāo\t hāñ\tmere\t Rab\t ki\t qasam\t beshak\t woh\t\nzaroor\thaq\thai\taur\ttum\tkuch\tthakā\tna\tsakoge"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "54",
    "arabicText": "وَلَوْ أَنَّ لِكُلِّ نَفْسٍۢ ظَلَمَتْ مَا فِى ٱلْأَرْضِ لَٱفْتَدَتْ بِهِۦ ۗ وَأَسَرُّوا۟ ٱلنَّدَامَةَ لَمَّا رَأَوُا۟ ٱلْعَذَابَ ۖ وَقُضِىَ بَيْنَهُم بِٱلْقِسْطِ ۚ وَهُمْ لَا يُظْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tif\teach\tunjust\tsoul\towned\teverything\t\nthat\tis\tin\tthe\tearth,\tit\twould\thave\tcertainly\t\ngiven\tit\tin\torder\tto\tredeem\titself;\tand\tthey\t\nsecretly\tfelt\trepentant\twhen\tthey\tsaw\tthe\t\npunishment;\t and\t it\t has\t been\t judged\t\nbetween\tthem\twith\tfairness\tand\tthey\twill\t\nnot\tbe\twronged.\t",
    "romanUrduTranslationText": "Aur\t agar\t har\t zālim\t jān\t zameen\t meiñ\t jo\t\nkuch\t hai\t sab\t ki\tmālik\t hoti\t zarur\tapni\tjān\t\nchudāne\t meiñ\t deti\t aur\t dil\t meiñ\t chupke\t\nchupke\t pashemāñ\t huwe\t jab\t ‘azāb\t dekhā\t\naur\t un\tmeiñ\tinsāf\t se\t faislā\t kar\t diya\t gayā\t\naur\tun\tpar\tzulm\tna\thogā."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "55",
    "arabicText": "أَلَآ إِنَّ لِلَّهِ مَا فِى ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۗ أَلَآ إِنَّ وَعْدَ ٱللَّهِ حَقٌّۭ وَلَـٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Pay\theed!\tIndeed\teverything\tthat\tis\tin\tthe\t\nheavens\t and\t the\t earth\t belongs\t only\t to\t\nAllah;\tpay\theed!\tIndeed\tAllah’s\tpromise\tis\t\ntrue,\tbut\tmost\tof\tthem\tdo\tnot\tknow.\t",
    "romanUrduTranslationText": "Sun\t lo\t beshak\t Allāh\t hi\t kā\t hai\t jo\t kuch\t\nāsmānoñ\t meiñ\t hai\t aur\t zameen\t meiñ\t sun\t\nlo\tbeshak\tAllāh\tkā\tw’adā\tsachā\thai\tmagar\t\nun\tmeiñ\taksar\tko\tkhabar\tnahiñ.\t"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "56",
    "arabicText": "هُوَ يُحْىِۦ وَيُمِيتُ وَإِلَيْهِ تُرْجَعُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t He\t gives\t life\t and\t gives\t death,\t and\t\ntowards\tHim\tyou\twill\treturn.\t",
    "romanUrduTranslationText": ". Woh\t jilātā\t aur\t mārtā\t hai\t aur\t usi\t ki\t taraf\t\nphiroge"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "57",
    "arabicText": "يَـٰٓأَيُّهَا ٱلنَّاسُ قَدْ جَآءَتْكُم مَّوْعِظَةٌۭ مِّن رَّبِّكُمْ وَشِفَآءٌۭ لِّمَا فِى ٱلصُّدُورِ وَهُدًۭى وَرَحْمَةٌۭ لِّلْمُؤْمِنِينَ",
    "urduTranslationText": "",
    "englishTranslationText": ". O\t mankind!\t The\t advice\t has\t come\t to\t you\t\nfrom\tyour\tLord\tand\ta\tcure\tfor\tthe\thearts\t-\nand\tguidance\tand\tmercy\tfor\tbelievers.\t",
    "romanUrduTranslationText": "Aye\t logoñ\t tumhāre\t pās\t tumhāre\t Rab\t ki\t\ntaraf\tse\tnasihat\tāayi\taur\tdiloñ\tki\tsehat\taur\t\nhidāyat\taur\trahmat\tImān\twāloñ\tke\tliye."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "58",
    "arabicText": "قُلْ بِفَضْلِ ٱللَّهِ وَبِرَحْمَتِهِۦ فَبِذَٰلِكَ فَلْيَفْرَحُوا۟ هُوَ خَيْرٌۭ مِّمَّا يَجْمَعُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Say,\t “Upon\tAllah’s\t munificence\t and\t upon\t\nHis\tmercy\t- upon\tthese\tshould\tthe\tpeople\t\nrejoice”;\tthat\tis\tbetter\tthan\tall\ttheir\twealth\t\nand\tpossessions.\t",
    "romanUrduTranslationText": "Tum\t farmāo\t Allāh\t hi\t ke\t fazl\t aur\t usi\t ki\t\nrahmat\t aur\t usi\t par\t chahiye\t ke\t khushi\t\nkareiñ\t woh\t un\t ke\t sab\t dhan\t daulat\t se\t\nbehtar\thai"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "59",
    "arabicText": "قُلْ أَرَءَيْتُم مَّآ أَنزَلَ ٱللَّهُ لَكُم مِّن رِّزْقٍۢ فَجَعَلْتُم مِّنْهُ حَرَامًۭا وَحَلَـٰلًۭا قُلْ ءَآللَّهُ أَذِنَ لَكُمْ ۖ أَمْ عَلَى ٱللَّهِ تَفْتَرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Say,\t “What\t is\t your\t opinion\t - (regarding)\t\nthe\t sustenance\t that\t Allah has\t sent\t down\t\nfor\t you?\t So\t you\t have,\t on\t your\t own,\t\ndeemed\t lawful\t and\t unlawful\t in\t it!”;\t say,\t\n“Has\tAllah given\tyou\tpermission\t for\tit,\tor\t\ndo\tyou\tfabricate\ta\tlie\tagainst\tAllah?”",
    "romanUrduTranslationText": "Tum\t farmāo\tto\tbhalā\tbatāo\tto\tjo\tAllāh\tne\t\ntumhāre\t liye\t rizq\t utārā\t us\t meiñ\t tum\t ne\t\napni\t taraf\t se\t Harām-o-Halāl\t thehrā\t liyā\t\ntum\t farmāo\t kyā\t Allāh\t ne\t is\t ki\t tumheiñ\t\nijāzat\tdi\tyā\tAllāh\tpar\tjhoot\tbāñdhte\tho."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "60",
    "arabicText": "وَمَا ظَنُّ ٱلَّذِينَ يَفْتَرُونَ عَلَى ٱللَّهِ ٱلْكَذِبَ يَوْمَ ٱلْقِيَـٰمَةِ ۗ إِنَّ ٱللَّهَ لَذُو فَضْلٍ عَلَى ٱلنَّاسِ وَلَـٰكِنَّ أَكْثَرَهُمْ لَا يَشْكُرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t what\t do\t they,\t who\t fabricate\t lies\t\nagainst\t Allah,\t assume\t will\t be\t their\t state\t on\t the\t Day\t of\t Resurrection?\t Indeed\t Allah is\t Most\t\nMunificent\tupon\tmankind,\tbut\tmost\tpeople\tare\tnot\tthankful.",
    "romanUrduTranslationText": "Aur\tkyā\tgumān\thai\tun\tkā\tjo\tAllāh\tpar\tjhoot\tbāndhte\thaiñ\tke\tQiyāmat\tmeiñ unka\tkyā\thāl\thoga\t\nbeshak\tAllāh\tlogoñ\tpar\tfazl\tkartā\thai\tmagar\taksar\tlog\tshukr\tnahiñ\tkarte"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "61",
    "arabicText": "وَمَا تَكُونُ فِى شَأْنٍۢ وَمَا تَتْلُوا۟ مِنْهُ مِن قُرْءَانٍۢ وَلَا تَعْمَلُونَ مِنْ عَمَلٍ إِلَّا كُنَّا عَلَيْكُمْ شُهُودًا إِذْ تُفِيضُونَ فِيهِ ۚ وَمَا يَعْزُبُ عَن رَّبِّكَ مِن مِّثْقَالِ ذَرَّةٍۢ فِى ٱلْأَرْضِ وَلَا فِى ٱلسَّمَآءِ وَلَآ أَصْغَرَ مِن ذَٰلِكَ وَلَآ أَكْبَرَ إِلَّا فِى كِتَـٰبٍۢ مُّبِينٍ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t whatever\t work\t you\t(O\t dear\t Prophet\tMuhammad - peace\t and\t blessings\t be\t upon\t him)\t are\t\nengaged\t in\t and\t recite\t a\t part\t of\t the\t Qur’an\t from\t Him,\t and\t whatever\t you\t people\t do,\t We\t are\t\nWitness\tupon\tyou\tfrom\tthe\ttime\tyou\tbegin\tit;\tand\tthere\tis\tnothing\tin\tthe\tearth\tor\tin\tthe\theaven\t\nworth\t the\t weight\t of\t the\t smallest\t particle\t hidden\t from\t your\t Lord,\t nor anything\t smaller\t or\t\ngreater\tthan\tit,\twhich\tis\tnot\trecorded\tin\ta\tclear\tBook.",
    "romanUrduTranslationText": "Aur\ttum\tkisi\tkām\tmeiñ\tho\taur\tus\tki\ttaraf\tse\tkuch\tQur'ān\tpadho\taur\ttum\tlog\tkoi\tkām\tkaro\thum\t\ntum\tpar\tgawāh\thote\thaiñ\tjab\ttum\tus\tko\tshuru’\tkarte\tho\taur\ttumhāre\tRab\tse\tźarrāh\tbhar\tkoi\tchiz\t\nghāib\t nahiñ\t zameen\tmeiñ\t nā\t āasmān\tmeiñ\t aur\t nā\tis\t se\t choti\t aur\t nā\tis\t se\t badi\t koi\t chiz\tjo\t ek\t\nroushan\tkitāb\tmeiñ\tnā\tho"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "62",
    "arabicText": "أَلَآ إِنَّ أَوْلِيَآءَ ٱللَّهِ لَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Pay\t heed!\t Indeed\t upon\t the\t friends\t of\t\nAllah is\t neither\t any\t fear,\t nor\t any\t grief.\t\n(The\t friends\t of\t Allah are\t the\t best\t in\t the\t\ncreation.)",
    "romanUrduTranslationText": "Sun\t lo\t beshak\t Allāh\t ke\t waliyoñ\t par\t na\t\nkuch\tkhauf\thai\tna\tkuch\tgham."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "63",
    "arabicText": "ٱلَّذِينَ ءَامَنُوا۟ وَكَانُوا۟ يَتَّقُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Those\t who\t have\t accepted\t faith\t and\t\npractice\tpiety.\t",
    "romanUrduTranslationText": "Woh\tjo\t Imān\tlaye\taur\t parhez-gari\t karte\t\nhaiñ\t."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "64",
    "arabicText": "لَهُمُ ٱلْبُشْرَىٰ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا وَفِى ٱلْـَٔاخِرَةِ ۚ لَا تَبْدِيلَ لِكَلِمَـٰتِ ٱللَّهِ ۚ ذَٰلِكَ هُوَ ٱلْفَوْزُ ٱلْعَظِيمُ",
    "urduTranslationText": "",
    "englishTranslationText": "There\t are\t good\t tidings\t for\t them\t in\t the\t\nlife\t of\t this\t world\t and\t in\t the\t Hereafter;\t\nthe\tWords\tof\tAllah cannot\tchange;\tthis\tis\t\nthe\tsupreme\tsuccess.\t",
    "romanUrduTranslationText": ". Unheiñ khushkhabri\t hai\t dunyā\t ki\t\nzindagi\t meiñ\t aur\t ākhirat\t meiñ\t Allāh\t ki\t\nbāteiñ\t badal\t nahiñ\t saktiñ\t yahi\t badi\t\nkāmyābi\thai."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "65",
    "arabicText": "وَلَا يَحْزُنكَ قَوْلُهُمْ ۘ إِنَّ ٱلْعِزَّةَ لِلَّهِ جَمِيعًا ۚ هُوَ ٱلسَّمِيعُ ٱلْعَلِيمُ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t do\t not\t grieve\t at\t their\t speech\t (O\t\ndear\t Prophet\t Muhammad - peace\t and\t\nblessings\t be\t upon\t him);\t indeed\t all\t\nhonour\t is\t for\t Allah and\t He\t is\t the\t All\t\nHearing,\tthe\tAll\tKnowing.\t\nthe\tsupreme\tsuccess.\t",
    "romanUrduTranslationText": "Aur\t tum\t un\t ki\t bātoñ\t ka\t gham\t na\t karo\t\nbeshak\t izzat\t sari\t Allāh\t ke\t liye\t hai\t wohi\t\nsuntā\tjāntā\thai."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "66",
    "arabicText": "أَلَآ إِنَّ لِلَّهِ مَن فِى ٱلسَّمَـٰوَٰتِ وَمَن فِى ٱلْأَرْضِ ۗ وَمَا يَتَّبِعُ ٱلَّذِينَ يَدْعُونَ مِن دُونِ ٱللَّهِ شُرَكَآءَ ۚ إِن يَتَّبِعُونَ إِلَّا ٱلظَّنَّ وَإِنْ هُمْ إِلَّا يَخْرُصُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Indeed\t all\t those\t in\t the\t heavens\t and\t all\t\nthose\tin\tthe\tearth\tare\tin\tAllah’s\tcontrol;\t\nand\t what\t do\t those\t who\t pray\t to\t the\t\npartners\t instead\t of\t Allah,\t follow?\t They\t\ndo\t not\t follow\t anything\t except\t\nassumption,\t and\t they\t only\t make\t\nguesses.\t",
    "romanUrduTranslationText": "Sun\tlo\tbeshak\tAllāh\thi\tki\tmilk\thaiñ\tjitne\t\nāsmānoñ\t meiñ\t haiñ\t aur\t jitne\t zaminoñ\t\nmeiñ\taur\tkāhe\tke\tpiche\tjā\trahe\thaiñ\twoh\t\njo\tAllāh\t ke\t siwā\t sharik\t pukār\t rahe\t haiñ\t\nwoh\tto\tpiche\tnahiñ\tjāte\tmagar\tgumān\tke\t\naur\twoh to\tnahiñ\tmagar\tatkaleñ\tdaudāte\t\n(andāze\tkarte)"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "67",
    "arabicText": "هُوَ ٱلَّذِى جَعَلَ لَكُمُ ٱلَّيْلَ لِتَسْكُنُوا۟ فِيهِ وَٱلنَّهَارَ مُبْصِرًا ۚ إِنَّ فِى ذَٰلِكَ لَـَٔايَـٰتٍۢ لِّقَوْمٍۢ يَسْمَعُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "It\tis\tHe\tWho\tcreated\tthe\tnight\tfor\tyou\tso\t\nthat\tyou\tmay\tgain\trest\tin\tit\tand\tthe\tday\tgiving\tsight;\tindeed\tin\tthis\tare\tsigns\tfor\tthe\tpeople\twho\t\nheed.\t",
    "romanUrduTranslationText": "Wohi\thai\tjis\tne\ttumhāre\tliye\trāt\tbanāi\tke\t\nis\t meiñ\t chain\t pāo\t aur\t din\t banāyā\t\ntumhāri\tāñkheiñ\tkholtā\tbeshak\tis\tmeiñ\tnishāniyāñ\thaiñ\tsun\tne\twāloñ\tke\tliye"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "68",
    "arabicText": "قَالُوا۟ ٱتَّخَذَ ٱللَّهُ وَلَدًۭا ۗ سُبْحَـٰنَهُۥ ۖ هُوَ ٱلْغَنِىُّ ۖ لَهُۥ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۚ إِنْ عِندَكُم مِّن سُلْطَـٰنٍۭ بِهَـٰذَآ ۚ أَتَقُولُونَ عَلَى ٱللَّهِ مَا لَا تَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "They\tsaid,\t“Allah has\tcreated\ta\tson\tfor\tHimself”- Purity\tis\tto\tHim!\tHe\tis\tthe\tPerfect\t(Unwanting,\t\nfree of\t needs);\t to\tHim\t only\t belongs\t all\t whatever\tis\tin\t the\t heavens\t and\t all\t whatever\tis\tin\t the\t\nearth;\t“You\tdo\tnot\thave\tany\tproof\tof\tthis;\tdo\tyou\tsay\ta\tthing\tconcerning\tAllah which\tyou\tdo\tnot\t\nknow?”\t\t",
    "romanUrduTranslationText": "Bole\tAllāh\tne\tapne\tliye\taulād\tbanāi\tpāki\tus\t ko\twohi\tbe\tniyāz\thai\tusi\t kā\thai\tjo\tKuch\tāsmānoñ\t\nmeiñ\thai\taur\tjo\tkuch\tzameen\tmeiñ\ttumhāre\tpās\tus\tki\tkoi\tbhi\tsanad\tnahiñ\tkyā\tAllāh\tpar\twoh\tbāt\t\nbatāte\tho\tjis\tka\ttumheiñ\t‘ilm\tnahiñ."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "69",
    "arabicText": "قُلْ إِنَّ ٱلَّذِينَ يَفْتَرُونَ عَلَى ٱللَّهِ ٱلْكَذِبَ لَا يُفْلِحُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Say,\t“Indeed\tthose\twho\tfabricate\tlies\tagainst\tAllah will\tnever\tsucceed.”\t",
    "romanUrduTranslationText": "Tum\tfarmāo\twoh\tjo\tAllāh\tpar\tjhoot\tbāndhte\thaiñ\tun\tkā\tbhalā\tna\thogā."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "70",
    "arabicText": "مَتَـٰعٌۭ فِى ٱلدُّنْيَا ثُمَّ إِلَيْنَا مَرْجِعُهُمْ ثُمَّ نُذِيقُهُمُ ٱلْعَذَابَ ٱلشَّدِيدَ بِمَا كَانُوا۟ يَكْفُرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Enjoying\ta\tlittle\tin\tthe\tearth,\tthey\thave\tthen\tto\treturn\tto\tUs\t- We\twill\tthen\tmake\tthem\ttaste\ta\t\nsevere\tpunishment,\tthe\trecompense\tof\ttheir\tdisbelief.\t",
    "romanUrduTranslationText": "Dunyā\t meiñ\t kuch\t bar’at\t lena\t (faida\t uthānā)\t hai\t phir\t unheiñ\t hamāri\t taraf\t wāpas\t āanā\t phir\t\nunheiñ\thum\tsakht\t‘azāb\tchakhāyeñ\tge\tbadlā\tun\tke\tkufr\tkā."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "71",
    "arabicText": "۞ وَٱتْلُ عَلَيْهِمْ نَبَأَ نُوحٍ إِذْ قَالَ لِقَوْمِهِۦ يَـٰقَوْمِ إِن كَانَ كَبُرَ عَلَيْكُم مَّقَامِى وَتَذْكِيرِى بِـَٔايَـٰتِ ٱللَّهِ فَعَلَى ٱللَّهِ تَوَكَّلْتُ فَأَجْمِعُوٓا۟ أَمْرَكُمْ وَشُرَكَآءَكُمْ ثُمَّ لَا يَكُنْ أَمْرُكُمْ عَلَيْكُمْ غُمَّةًۭ ثُمَّ ٱقْضُوٓا۟ إِلَىَّ وَلَا تُنظِرُونِ",
    "urduTranslationText": "",
    "englishTranslationText": "Read\tto\tthem\tthe\tstory\tof\tNooh;\twhen\the\t\ntold\t his\t people,\t “O\t my\t people\t - if\t my\t\nstanding\t here\t and\t reminding\t you\t of\t\nAllah’s\tsigns\thave\tbeen\tintolerable\tfor\tyou\t\n- so\tI\thave\ttrusted\tonly\tAllah - then\twork\t\njointly\t and\t strengthen\t your\t work\t along\t\nwith\t your\t false\t deities,\t leaving\t no\t doubt\t\nregarding\t your\t work\t- then\t do\t whatever\t\nyou\t can\t to\t me,\t and\t do\t not\t give\t me\t\nrespite.",
    "romanUrduTranslationText": ". Aur\t unheiñ\t Nūh ki\t khabar\t padh\t kar\t\nsunāo; jab\tus\tne\tapni\tqaum\tse\tkahā, “aye\t\nmeri\tqaum - agar\ttum\tpar\tshāq\t(nāgawār)\t\nguzrā\t hai\t merā\t khadā\t honā\t aur\t Allāh\t ki\t\nnishaniyañ\t yād\t dilānā\t- to\t maiñ ne\t Allāh\t\nhi\t par\t bharosā\t kiyā\t to\t mil\t kar\t kām\t karo\t\naur\t apne\t jhoote\tm'aboodoñ\t samait, apnā\t\nkām\t pakkā\t kar\t lo\t - phir\t tumhāre\t kām\t\nmeiñ\t tum\t par\t kuch\t gunjalak\t (uljhan-o\u0002posheedgi)\t na\t rahe\t phir\tjo\t ho\t sake\tmerā\t\nkar\tlo\taur\tmujhe\tmohlat\tna\tdo”\n"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "72",
    "arabicText": "فَإِن تَوَلَّيْتُمْ فَمَا سَأَلْتُكُم مِّنْ أَجْرٍ ۖ إِنْ أَجْرِىَ إِلَّا عَلَى ٱللَّهِ ۖ وَأُمِرْتُ أَنْ أَكُونَ مِنَ ٱلْمُسْلِمِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "“Then\tif\t you\t turn\t away,\t I\t do\t not\t ask\t any\t\nfee\t from\t you;\t my\t reward\t is\t only\t upon\t\nAllah,\t and\t I\t am\t commanded\tto\t be\t of\t the\t\nMuslims.”\t\n",
    "romanUrduTranslationText": ". Phir\tagar\ttum\tmuñh\tphero\tto\tmaiñ\ttum\tse\t\nkuch\tujrat\tnahiñ\tmāñgtā\tmerā\tajr\tto\tnahiñ\t\nmagar\t Allāh\t par\t aur\t mujhe\t hukm\t hai ke\t\nmaiñ\tMusalmānoñ\tse\thooñ."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "73",
    "arabicText": "فَكَذَّبُوهُ فَنَجَّيْنَـٰهُ وَمَن مَّعَهُۥ فِى ٱلْفُلْكِ وَجَعَلْنَـٰهُمْ خَلَـٰٓئِفَ وَأَغْرَقْنَا ٱلَّذِينَ كَذَّبُوا۟ بِـَٔايَـٰتِنَا ۖ فَٱنظُرْ كَيْفَ كَانَ عَـٰقِبَةُ ٱلْمُنذَرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "In\t response\t they\t denied\t him,\t so\t We\t\nrescued\t him\t and\t those\t with\t him\t in\t the\t\nship,\t and\t made\t them\t caliphs,\t and\t We\t\ndrowned\t those\t who\t denied\t Our\t signs;\t\ntherefore\tsee\twhat\tsort\tof\tfate\tbefell\tthose\t\nwho\thad\tbeen\twarned!\t",
    "romanUrduTranslationText": "To\t unhoñ\t ne\t use\tjhutlāyā\t to\t hum\t ne\t use\t\naur\t jo\t us\t ke\t sāth\t kashti\t meiñ\t the\t un\t ko\t\nnajāt\tdi\taur\tunheiñ\thum\tne\tnāib\tkiyā\taur\t\njinhoñ\t ne\t hamāri Āyateñ\t jhutlāiñ\t un\t ko\t\nhum\tne\tdubo\tdiyā\tto\tdekho\tdarāye\thuwoñ\t\nkā\tanjām\tkaisa\thuw"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "74",
    "arabicText": "ثُمَّ بَعَثْنَا مِنۢ بَعْدِهِۦ رُسُلًا إِلَىٰ قَوْمِهِمْ فَجَآءُوهُم بِٱلْبَيِّنَـٰتِ فَمَا كَانُوا۟ لِيُؤْمِنُوا۟ بِمَا كَذَّبُوا۟ بِهِۦ مِن قَبْلُ ۚ كَذَٰلِكَ نَطْبَعُ عَلَىٰ قُلُوبِ ٱلْمُعْتَدِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Then\t after\t him,\t We\t sent\t other\t Noble\t\nMessengers\tto\ttheir\trespective\tpeople\t- so\t\nthey\t came\t to\t them\twith\t clear\t proofs\t- so\t\nthey\twere\t not\t such\t as\t to\t believe\tin\twhat\t\nthey\thad\tdenied\tbefore;\tthis\tis\thow\tWe\tset\t\nseals\tupon\tthe\thearts\tof\trebels.\t",
    "romanUrduTranslationText": ". Phir\t is\t ke\t bad\t aur\t Rasool\t hum\t ne\t un\t ki\t\nqaumoñ\t ki\t taraf\t bheje\t to\t woh\t un\t ke\t pās\t\nroushan\tdalileñ\tlaye\tto\twoh\taise\tna\tthe\tke\t\nImān\t lāte\t us\t par\t jise\t pehle\t jhutlā\t chuke\t\nthe\thum\tyuñhi\tmohar\tlagā\tdete\thaiñ\tsarkashoñ\tke\tdiloñ\tpar."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "75",
    "arabicText": "ثُمَّ بَعَثْنَا مِنۢ بَعْدِهِم مُّوسَىٰ وَهَـٰرُونَ إِلَىٰ فِرْعَوْنَ وَمَلَإِي۟هِۦ بِـَٔايَـٰتِنَا فَٱسْتَكْبَرُوا۟ وَكَانُوا۟ قَوْمًۭا مُّجْرِمِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Then\t after\t them,\t We\t sent\t Moosa\t and\t\nHaroon\t along\t with\t Our\t signs,\t to\t Firaun\t\nand\t his\t court\t members,\t so\t they\t were\t\nproud\tand\twere\ta\tguilty\tpeople.\t",
    "romanUrduTranslationText": ". Phir\t un\t ke\t b’ad\t hum\t ne\t Mūsā aur\t Hāroon ko\t fir’aon\t aur\t us\t ke darbāriyoñ\t ki\t taraf\t apni\t\nnishaniyañ\tde\tkar\tbhejā\tto\tunhoñ\tne\ttakabbur\tkiya\taur\twoh\tmujrim\tlog\tthe"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "76",
    "arabicText": "فَلَمَّا جَآءَهُمُ ٱلْحَقُّ مِنْ عِندِنَا قَالُوٓا۟ إِنَّ هَـٰذَا لَسِحْرٌۭ مُّبِينٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "So\twhen\tthe\ttruth\tcame\tto\tthem\tfrom\tUs,\tthey\tsaid,\t“Indeed\tthis\tis\ta\tclear\tmagic.",
    "romanUrduTranslationText": "To\tjab\tun\tke\tpās\thamāri\ttaraf\tse\thaq\tāyā\tbole\tyeh\tto\tzaroor\tkhulā\tjādoo\thai."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "77",
    "arabicText": "قَالَ مُوسَىٰٓ أَتَقُولُونَ لِلْحَقِّ لَمَّا جَآءَكُمْ ۖ أَسِحْرٌ هَـٰذَا وَلَا يُفْلِحُ ٱلسَّـٰحِرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Said\tMoosa,\t“What!\tYou\tspeak\tin\tthis\tmanner\tregarding\tthe\ttruth\twhen\tit\thas\tcome\tto\tyou?\tIs\t\nthis\tmagic?\tAnd\tmagicians\tnever\tsucceed.”\t",
    "romanUrduTranslationText": "Mūsā ne\tkahā\tkyā\thaq\tki\tnisbat\taeysa\tkehte\tho\tjab\twoh\ttumhāre\tpās\tāayā\tkyā\tyeh\tjādoo\thai\taur\t\njādoogar\tmurād\tko\tnahiñ\tpahuñchte"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "78",
    "arabicText": "قَالُوٓا۟ أَجِئْتَنَا لِتَلْفِتَنَا عَمَّا وَجَدْنَا عَلَيْهِ ءَابَآءَنَا وَتَكُونَ لَكُمَا ٱلْكِبْرِيَآءُ فِى ٱلْأَرْضِ وَمَا نَحْنُ لَكُمَا بِمُؤْمِنِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "They\tsaid,\t “Have\t you\t two\tcome\t to\tus\t to\trevert\tus\t from\twhat\twe\t found\tour\t fathers\tupon,\tand\t\nthat\t the\t leadership\t in\t the\t land\t may\t only\t be\t for\t you\t two?\t And\t we\t shall\t never\t believe\t in\t you\t\nboth.”\t",
    "romanUrduTranslationText": "Bole\tkyā\ttum\thamāre\tpās\tis\tliye\tāaye\tho\tke\thameiñ\tis\tse\tpher\tdo\tjis\tpar\thum\tne\tapne\tbāp\tdādā\t\nko\tpāyā\taur\tzameen\tmeiñ\ttumheiñ\tdonoñ\tki\t\tbadāi\trahe\taur\thum\ttum\tpar\tImān\tlāne\tke\tnahiñ"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "79",
    "arabicText": "وَقَالَ فِرْعَوْنُ ٱئْتُونِى بِكُلِّ سَـٰحِرٍ عَلِيمٍۢ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t Firaun\t said,\t “Bring\t every\t expert\t\nmagician\tto\tme.”\t",
    "romanUrduTranslationText": "Aur\t fir’aon\tbolā\thar\tjādoogar\tilm\twāle\tko\t\nmere\tpās\tle\tāo"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "80",
    "arabicText": "فَلَمَّا جَآءَ ٱلسَّحَرَةُ قَالَ لَهُم مُّوسَىٰٓ أَلْقُوا۟ مَآ أَنتُم مُّلْقُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "So\twhen\t the\tmagicians\t came,\tMoosa\t said\t\nto\t them,\t “Cast\t whatever\t you\t intend\t to\t\ncast.”",
    "romanUrduTranslationText": "Phir\tjab\tjādoogar\tāye\tun\tse\tMūsā ne\tkahā\t\ndālo\tjo\ttumheiñ\tdālnā\thai."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "81",
    "arabicText": "فَلَمَّآ أَلْقَوْا۟ قَالَ مُوسَىٰ مَا جِئْتُم بِهِ ٱلسِّحْرُ ۖ إِنَّ ٱللَّهَ سَيُبْطِلُهُۥٓ ۖ إِنَّ ٱللَّهَ لَا يُصْلِحُ عَمَلَ ٱلْمُفْسِدِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Therefore\t when\t they\t had\t cast,\t Moosa\t\nsaid,\t “This\t what\t you\t have\t brought,\t is\t\nmagic;\tAllah will\tnow\tmake\tit\tvoid;\tindeed\t\nAllah does\t not\t make\t the\t works\t of\t the\t\nmischievous\tsuccessful.”\t",
    "romanUrduTranslationText": "Phir\tjab\tunhoñ\tne\tdālā\tMūsā ne\tkahā\tyeh\t\njo\t tum\t lāye\t yeh\t jādoo\t hai\t ab\t Allāh\t use\t\nbātil\t kar\t degā\t Allāh\t mufsidoñ\t kā\t kām\t\nnahiñ\tbanātā."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "82",
    "arabicText": "وَيُحِقُّ ٱللَّهُ ٱلْحَقَّ بِكَلِمَـٰتِهِۦ وَلَوْ كَرِهَ ٱلْمُجْرِمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "“And\t Allah will\t prove\t the\t truth\t by\t His\t\nWords,\teven\tif\tthe\tguilty\tget\tannoyed.”\t",
    "romanUrduTranslationText": "Aur\t Allāh\t apni\t bātoñ\t se\t haq\t ko\t haq\t kar\t\ndikhātā\thai\tpade\tburā\tmāneñ\tmujrim."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "83",
    "arabicText": "فَمَآ ءَامَنَ لِمُوسَىٰٓ إِلَّا ذُرِّيَّةٌۭ مِّن قَوْمِهِۦ عَلَىٰ خَوْفٍۢ مِّن فِرْعَوْنَ وَمَلَإِي۟هِمْ أَن يَفْتِنَهُمْ ۚ وَإِنَّ فِرْعَوْنَ لَعَالٍۢ فِى ٱلْأَرْضِ وَإِنَّهُۥ لَمِنَ ٱلْمُسْرِفِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "So\tnone\taccepted\tfaith\tin\tMoosa,\texcept\ta\t\nfew\t descendants\t of\t his\t people,\t fearing\t\nFiraun\t and\t his\t court\t members,\t that\t they\t\nwould\t force\t them\t to\t revert;\t and\t indeed\t\nFiraun\twas\ta\trebel\tin\tthe\tland;\tand\tindeed\t\nhe\tcrossed\tthe\tlimits.\t",
    "romanUrduTranslationText": "To\t Mūsā par\t Imān\t na\t lāye\t magar\t us\t ki\t\nqaum\t ki\t aulād\t se\t kuch\t log\t fir’aun\t aur\t us\t\nke\t darbāriyoñ\t se\t darte\t huwe\t ke\t kahiñ\t\nunheiñ\thatne\tpar\tmajboor\tna\tkar\tdeiñ\taur\t\nbeshak\t fir’aun\t zameen\t meiñ\t sar\t uthāne\t\nwālā\t thā\t aur\t beshak\t woh\t had\t se\t guzar\t\ngayā."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "84",
    "arabicText": "وَقَالَ مُوسَىٰ يَـٰقَوْمِ إِن كُنتُمْ ءَامَنتُم بِٱللَّهِ فَعَلَيْهِ تَوَكَّلُوٓا۟ إِن كُنتُم مُّسْلِمِينَ",
    "urduTranslationText": "",
    "englishTranslationText": ". And\tMoosa\tsaid,\t“O\tmy\tpeople!\tIf\tyou\thave\t\naccepted\t faith\t in\t Allah,\t then\t you\t should\t\nrely\tonly\tupon\tHim,\tif\tyou\tare\tMuslims.”\t",
    "romanUrduTranslationText": "Aur\t Mūsā ne\t kahā\t aye\t meri\t qaum\t agar\t\ntum\t Allāh\t par\t Imān\t lāye\t to\t usi\t par\t\nbharosa\tkaro\tagar\tislām\trakhte\tho"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "85",
    "arabicText": "فَقَالُوا۟ عَلَى ٱللَّهِ تَوَكَّلْنَا رَبَّنَا لَا تَجْعَلْنَا فِتْنَةًۭ لِّلْقَوْمِ ٱلظَّـٰلِمِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "They\t said,\t “We\t have\t relied\t only\t upon\t\nAllah;\t Our\t Lord!\t Do\t not\tmake\t us\t a\t test\t *\t\nfor\t the\t unjust\t people.”\t(*\t By\t giving\t them\t\npower\tover\tus.)\t",
    "romanUrduTranslationText": "Bole\thum\tne\tAllāh\thi\tpar\tbharosā\tkyā\tilāhi\t\nhum\t ko\t zālim\t logoñ\t ke\t liye\t āzmāish\t na\t\nbanā."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "86",
    "arabicText": "وَنَجِّنَا بِرَحْمَتِكَ مِنَ ٱلْقَوْمِ ٱلْكَـٰفِرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "“And\twith\tYour\tmercy,\trescue\tus\tfrom\tthe\t\ndisbelievers.”",
    "romanUrduTranslationText": "Aur\t apni\t rahmat\t farmā\t kar\t hameiñ\t\nkāfiroñ\tse\tnajāt\tde"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "87",
    "arabicText": "وَأَوْحَيْنَآ إِلَىٰ مُوسَىٰ وَأَخِيهِ أَن تَبَوَّءَا لِقَوْمِكُمَا بِمِصْرَ بُيُوتًۭا وَٱجْعَلُوا۟ بُيُوتَكُمْ قِبْلَةًۭ وَأَقِيمُوا۟ ٱلصَّلَوٰةَ ۗ وَبَشِّرِ ٱلْمُؤْمِنِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tWe\tsent\tthe\tdivine\trevelation\tto\tMoosa\tand\this\tbrother\tthat,\t“Build\thouses\tfor\tyour\tpeople\t\nin\tEgypt\tand\tmake\tyour\thouses\tas\tplaces\tof\tworship,\tand\tkeep\tthe\tprayer\testablished,\tand\tgive\t\nglad\ttidings\tto\tthe\tMuslims.”\t",
    "romanUrduTranslationText": "Aur\thum\tne\tMūsā aur\tus\tke\tbhāi\tko\twahi\tbheji\tke\tmisr\tmeiñ\tapni\tqaum\tke\tliye\tmakānāt\tbanāo\t\naur\t apne\t gharoñ\t ko\t Namāz\t ki\t jagah\t karo\t aur\t namāz\t qāim\t rakho\t aur\t Musalmānoñ\t ko\t\nkhushkhabri\tsunā"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "89",
    "arabicText": "قَالَ قَدْ أُجِيبَت دَّعْوَتُكُمَا فَٱسْتَقِيمَا وَلَا تَتَّبِعَآنِّ سَبِيلَ ٱلَّذِينَ لَا يَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "He\t said,\t “The\t prayer\t of\t you\t two\t is\t\naccepted,\t therefore\t remain\t firm,\t and\t do\t\nnot\tfollow\tthe\tway\tof\tthe\tunwise.”\t",
    "romanUrduTranslationText": ". Farmāyā\ttum\tdonoñ\tki\tdu’ā\tqubool\thui\tto\t\nsābit\t qadam\t raho\t aur\tnādānoñ\t ki\t rāh\t na\t\nchalo"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "90",
    "arabicText": "۞ وَجَـٰوَزْنَا بِبَنِىٓ إِسْرَٰٓءِيلَ ٱلْبَحْرَ فَأَتْبَعَهُمْ فِرْعَوْنُ وَجُنُودُهُۥ بَغْيًۭا وَعَدْوًا ۖ حَتَّىٰٓ إِذَآ أَدْرَكَهُ ٱلْغَرَقُ قَالَ ءَامَنتُ أَنَّهُۥ لَآ إِلَـٰهَ إِلَّا ٱلَّذِىٓ ءَامَنَتْ بِهِۦ بَنُوٓا۟ إِسْرَٰٓءِيلَ وَأَنَا۠ مِنَ ٱلْمُسْلِمِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t We\t transported\t the\t Descendants\t of\t\nIsrael\tacross\tthe\tsea,\ttherefore\tFiraun\tand\t\nhis\tarmy\tpursued\tthem\twith\trebellion\tand\t\ninjustice;\t until\t when\t the\t drowning\t\novercame\thim\the\tcried,\t“I\taccept\tfaith\tthat\t\nthere\t is\t no\t True\t God\t except\t the\t One\t in\t\nWhom\t the\t Descendants\t of\t Israel\t believe,\t\nand\tI\tam\ta\tMuslim.”\t",
    "romanUrduTranslationText": "Aur\thum\tbani\tIsra’il\tko\tdaryā\tpāar\tle\tgaye\t\nto\t fir’aun\t aur\t us\t ke\t lashkaroñ\t ne\t un\t kā\t\npicha\tkiyā\tsarkashi\taur\tzulm\tse\tyahāñ\ttak\t\nke\t jab\t use\t doobne\t ne\t āliya\t bolā\t maiñ\t\nImān\t lāyā\t ke\t koi\t sacha\t m’abood\t nahiñ\t\nsiwā\tus\tke\tjis\tpar\tbani\tIsrail\tImān\tlaye\taur\t\nmaiñ\tMusalmān\thooñ."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "91",
    "arabicText": "ءَآلْـَٔـٰنَ وَقَدْ عَصَيْتَ قَبْلُ وَكُنتَ مِنَ ٱلْمُفْسِدِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "“What!\t Now?*\t Whereas\t you\t were\t\ndisobedient\t from\t the\t start\t and\t you\t were\t\nmischievous!”\t(This\t was\t said\t to\t Firaun.\t *\t\nAccepting\tfaith\tat\tthe\ttime\tof\tdeath\tis\tof\tno\t\nuse.)",
    "romanUrduTranslationText": "Kyā\t ab\t aur\t pehle\t se\t nā\t farmān\t rahā\t aur\t\ntoo\tfasādi\tthā"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "92",
    "arabicText": "فَٱلْيَوْمَ نُنَجِّيكَ بِبَدَنِكَ لِتَكُونَ لِمَنْ خَلْفَكَ ءَايَةًۭ ۚ وَإِنَّ كَثِيرًۭا مِّنَ ٱلنَّاسِ عَنْ ءَايَـٰتِنَا لَغَـٰفِلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "“This\t day\tWe\t shall\t salvage\t your\t body\t so\t\nthat\tyou\tmay\tbe\ta\tsign\tfor\tthose\tafter\tyou;\t\nand\tindeed\tmost\t people\t are\t neglectful\t of\t\nOur\tsigns.”\t",
    "romanUrduTranslationText": "Āaj\t Hum\t teri\t lāsh\t ko\t utrā\t deiñ\t (bāqi\t\nrakheiñ)\t ge\t ke\t too\t apne\t pichloñ\t ke\t liye\t\nnishāni\tho\taur\tbeshak\tlog\tHamāri\tĀyatoñ\t\nse\tghāfil\thaiñ"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "93",
    "arabicText": "وَلَقَدْ بَوَّأْنَا بَنِىٓ إِسْرَٰٓءِيلَ مُبَوَّأَ صِدْقٍۢ وَرَزَقْنَـٰهُم مِّنَ ٱلطَّيِّبَـٰتِ فَمَا ٱخْتَلَفُوا۟ حَتَّىٰ جَآءَهُمُ ٱلْعِلْمُ ۚ إِنَّ رَبَّكَ يَقْضِى بَيْنَهُمْ يَوْمَ ٱلْقِيَـٰمَةِ فِيمَا كَانُوا۟ فِيهِ يَخْتَلِفُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tindeed\tWe\tprovided\tthe\tDescendants\t\nof\t Israel\ta\tplace\tof\thonour,\tand\tbestowed\t\ngood\t sustenance\t to\t them;\t and\t they\t did\t\nnot\t fall\t into\t dispute\t except\t after\t the\t\nknowledge\t had\t come\t to\t them;\t indeed\t\nyour\tLord\twill\tjudge\tbetween\tthem\ton\tthe\t\nDay\t of\t Resurrection\t concerning\t the\t\nmatters\tin\twhich\tthey\tused\tto\tdiffer.\t",
    "romanUrduTranslationText": "Aur\tbeshak\thum\tne\tbani\tIsra’il\tko\tizzat ki\t\njagha\t di\t aur\t unheiñ\t suthri\t rozi\t atā\t ki\t to\t\nikhtilāf\t meiñ\t nā\t pade\t magar\t ilm\t āane\t ke\t\nb’ād\tbeshak\ttumhārā\tRab\tQiyāmat\tke\tdin\t\nun\t meiñ\t faislā\t kar\t dega\t jis\t bāt\t meiñ\t\njhagadte\tthe."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "94",
    "arabicText": "فَإِن كُنتَ فِى شَكٍّۢ مِّمَّآ أَنزَلْنَآ إِلَيْكَ فَسْـَٔلِ ٱلَّذِينَ يَقْرَءُونَ ٱلْكِتَـٰبَ مِن قَبْلِكَ ۚ لَقَدْ جَآءَكَ ٱلْحَقُّ مِن رَّبِّكَ فَلَا تَكُونَنَّ مِنَ ٱلْمُمْتَرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tif\tyou,\tO\tlistener,\thave\tany\tdoubt\tin\twhat\tWe\thave\tsent\tdown\ttowards\tyou,\tthen\tquestion\t\nthose\twho\thave\tread\tthe\tBook\tbefore\tyou;\tundoubtedly,\ttowards\tyou\thas\tcome\tthe\ttruth\tfrom\t\nyour\tLord,\ttherefore\tdo\tnot\tbe\tof\tthose\twho\tdoubt.\t",
    "romanUrduTranslationText": "Aur\t aye\t sunne\t wāle\t agar\t tujhe\t kuch\t\nshubah\tho\tus\tmeiñ\tjo\thum\tne\tteri\ttaraf\tutārā\tto\tun\tse\tpooñch\tdekh\tjo\ttujh\tse\tpehle\tkitāb\tparhne\t\nwāle\theiñ\tbeshak\ttere\tpas\ttere\tRab\tki\ttaraf\tse\tHaq\tāayā\tto\ttu\thar\tgiz\tshak\twāloñ\tmeiñ\tna\tho."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "95",
    "arabicText": "وَلَا تَكُونَنَّ مِنَ ٱلَّذِينَ كَذَّبُوا۟ بِـَٔايَـٰتِ ٱللَّهِ فَتَكُونَ مِنَ ٱلْخَـٰسِرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tnever\tbe\tof\tthose\twho\tdenied\tthe\tsigns\tof\tAllah,\tfor\tyou\twill\tthen\tbe\tof\tthe\tlosers.\t",
    "romanUrduTranslationText": "Aur\thar\tgiz\tun\tmeiñ\tna\thonā\tjinhoñ\tne\tAllāh\tki\tĀyateiñ\tjhutlāyeiñ\tke\ttu\tkhasāre\twāloñ\tmeiñ\tho\t\njāega"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "96",
    "arabicText": "إِنَّ ٱلَّذِينَ حَقَّتْ عَلَيْهِمْ كَلِمَتُ رَبِّكَ لَا يُؤْمِنُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Indeed\tthose\tfor\twhom\tthe\tWord\tof\tyour\tLord\thas\tproved\ttrue,\twill\tnot\tbelieve.",
    "romanUrduTranslationText": "Beshak\twoh\tjin\tpar\ttere\tRab\tki\tbāt\tthik\tpadh\tchuki\thai\tImān\tna\tlāeñge"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "97",
    "arabicText": "وَلَوْ جَآءَتْهُمْ كُلُّ ءَايَةٍ حَتَّىٰ يَرَوُا۟ ٱلْعَذَابَ ٱلْأَلِيمَ",
    "urduTranslationText": "",
    "englishTranslationText": "Even\tif\tevery\tsign\tcomes\tto\tthem,\tuntil\tthey\twitness\tthe\tpainful\tpunishment.",
    "romanUrduTranslationText": "Agarche\tsab\tnishaniyañ\tun\tke\tpās\tāyeñ\tjab\ttak\tdard-nāk\t‘azāb\tna\tdekh\tleiñ"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "98",
    "arabicText": "فَلَوْلَا كَانَتْ قَرْيَةٌ ءَامَنَتْ فَنَفَعَهَآ إِيمَـٰنُهَآ إِلَّا قَوْمَ يُونُسَ لَمَّآ ءَامَنُوا۟ كَشَفْنَا عَنْهُمْ عَذَابَ ٱلْخِزْىِ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا وَمَتَّعْنَـٰهُمْ إِلَىٰ حِينٍۢ",
    "urduTranslationText": "",
    "englishTranslationText": "So\t if\t only\t had\t there\t been\t one\t dwelling\t *\t\nthat\t believed\t and\t its\t belief\t would\t have\t\nbenefited\t it\t- except\t the\t nation\t of\t Yunus\t\n(Jonah)!\t When\t they\t accepted\t faith,\t We\t\nremoved\t the\t disgraceful\t punishment\t in\t\nthe\t life\t of\t this\t world\t from\t them,\t and\t let\t\nthem\t enjoy\t for\t a\t while.\t (*\t That\t was\t\ndestroyed\tafter\tbeing\twarned.)\t",
    "romanUrduTranslationText": "To\t huwi\t hoti\t na\t koi\t basti\t ke\tImān\tlāti\t to\t\nus\tkā\tImān\tkām\tātā\thāñ\tYūnus ki\tqaum\tjab\t\nImān\t lāye\t hum\t ne\t un\t se\t ruswāi\t kā\t ‘azāb\t\ndunyā\t ki\t zindagi\t meiñ\t hatā\t diyā\t aur\t ek\t\nwaqt\ttak\tunheiñ\tbaratne\tdiyā."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "99",
    "arabicText": "وَلَوْ شَآءَ رَبُّكَ لَـَٔامَنَ مَن فِى ٱلْأَرْضِ كُلُّهُمْ جَمِيعًا ۚ أَفَأَنتَ تُكْرِهُ ٱلنَّاسَ حَتَّىٰ يَكُونُوا۟ مُؤْمِنِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tif\tyour\tLord\twilled,\tall\tthose\twho\tare\t\nin\t the\t earth\t - everyone\t of\t them\t - would\t\nhave\t accepted\t faith;\t so\t will\t you\t (O\t dear\t\nProphet\tMuhammad - peace\t and\t blessings\t\nbe\t upon\t him)\t force\t the\t people\t until\t they\t\nbecome\tMuslims?\t",
    "romanUrduTranslationText": "Aur\t agar\t tumhārā\t Rab\t chāhtā\t zameen\t\nmeiñ\tjitne\theiñ\tsab\t ke\tsab\t Imān\tle\tāte\t to\t\nkyā\t tum\t logoñ\t ko\t zabardasti\t karoge\t\nyahāñ\ttak\tke\tMusalmān\tho\tjāeiñ."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "100",
    "arabicText": "وَمَا كَانَ لِنَفْسٍ أَن تُؤْمِنَ إِلَّا بِإِذْنِ ٱللَّهِ ۚ وَيَجْعَلُ ٱلرِّجْسَ عَلَى ٱلَّذِينَ لَا يَعْقِلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tno\tsoul\tcan\taccept\tfaith\texcept\tby\tthe\t\ncommand\t of\t Allah;\t and\t He\t sets\t the\t\npunishment\tupon\t those\twho\tdo\tnot\thave\t\nsense.\t",
    "romanUrduTranslationText": "Aur\tkisi\tjān\tki\tqudrat\tnahiñ\tke\tImān\tle\tāye\t\nmagar\tAllāh\tke\thukm\tse\taur\t‘azāb\tun\tpar\t\ndālta\thai\tjinheiñ\taql\tnahiñ."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "101",
    "arabicText": "قُلِ ٱنظُرُوا۟ مَاذَا فِى ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۚ وَمَا تُغْنِى ٱلْـَٔايَـٰتُ وَٱلنُّذُرُ عَن قَوْمٍۢ لَّا يُؤْمِنُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Proclaim,\t“Observe\twhat\tis\tin\tthe\theavens\t\nand\t the\t earth”;\t and\t the\t signs\t and\t the\t\nNoble\t Messengers\t do\t not\t benefit\t the\t\npeople\twho\tare\tnot\tdestined\tto\tbelieve.\t",
    "romanUrduTranslationText": ". Tum\t farmāo\t dekho\tāsmānoñ\taur\tzameen\t\nmeiñ\t kyā\t kyā\t hai\t aur\t āyateiñ\t aur\t Rasool\t\nunheiñ\t kuch\t nahiñ\t dete\t jin\t ke\t naseeb\t\nmeiñ\tImān\tnahiñ"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "102",
    "arabicText": "فَهَلْ يَنتَظِرُونَ إِلَّا مِثْلَ أَيَّامِ ٱلَّذِينَ خَلَوْا۟ مِن قَبْلِهِمْ ۚ قُلْ فَٱنتَظِرُوٓا۟ إِنِّى مَعَكُم مِّنَ ٱلْمُنتَظِرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "So\t what\t are\t they\t waiting\t for,\t except\t the\t\ndays\t similar\t to\t the\t days\t of\t those\t who\t\npassed\t away\t before\t them?\t Say,\t “Then\t\nwait!\tI\ttoo\tam\twaiting\twith\tyou.”\t",
    "romanUrduTranslationText": "To\t unheiñ\t kāhe\t kā\t intiżār\t hai\t magar\t\nunhiñ\tlogoñ\tke\tse\tdinoñ\tkā\tjo\tun\tse\tpehle\t\nho\tguzre\ttum\tfarmāo\tto\tintiżār\tkaro\tmaiñ\t\nbhi\ttumhāre\tsāth\tintiżār\tmeiñ\thooñ"
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "103",
    "arabicText": "ثُمَّ نُنَجِّى رُسُلَنَا وَٱلَّذِينَ ءَامَنُوا۟ ۚ كَذَٰلِكَ حَقًّا عَلَيْنَا نُنجِ ٱلْمُؤْمِنِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Then\tWe\tshall\tsave\tOur\tNoble\tMessengers\t\nand\t the\t believers\t - this\t is\t it;\t it\t is\t\nincumbent\t upon\t Our\t mercy\t to\t save\t the\t\nMuslims.\t",
    "romanUrduTranslationText": "Phir\thum\tapne\tRasooloñ\taur\t Imān\twāloñ\t\nko\t najāt\t deiñ\t ge\t bāt\t yahi\t hai\t hamāre\t\nzimma-e-karam\t par\t haq\t hai\tMusalmānoñ\t\nko\tnajāt\tdena."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "104",
    "arabicText": "قُلْ يَـٰٓأَيُّهَا ٱلنَّاسُ إِن كُنتُمْ فِى شَكٍّۢ مِّن دِينِى فَلَآ أَعْبُدُ ٱلَّذِينَ تَعْبُدُونَ مِن دُونِ ٱللَّهِ وَلَـٰكِنْ أَعْبُدُ ٱللَّهَ ٱلَّذِى يَتَوَفَّىٰكُمْ ۖ وَأُمِرْتُ أَنْ أَكُونَ مِنَ ٱلْمُؤْمِنِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Say\t(O\t dear\t Prophet\tMuhammad - peace\t and\t blessings\t be\t upon\t him),\t “O\t people!\t If\t you\t are\tin\t\ndoubt\tconcerning\tmy\treligion,\tthen\t(know\tthat)\tI\twill\tnever\tworship\tthose\twhom you\tworship\t\ninstead\tof\tAllah - but\tI\tworship\tAllah Who\twill\tgive\tyou\tdeath;\tand\tI\tam\tcommanded\tto\tbe\tof\tthe\t\nbelievers.”\t",
    "romanUrduTranslationText": "Tum\t farmāo\t aye\tlogoñ\t agar\t tum\tmere\t din\t ki\t taraf\t se\t kisi\t shubeh\tmeiñ\t ho\t to\tmaiñ\t to\t use\t na\t\npoojuñga\tjise\ttum\tAllāh\tke\tsiwā\tpoojte\tho\thān\tus\tAllāh\tko\tpoojtā\thooñ\tjo\ttumhāri\tjān\tnikāle\tgā\t\naur\tmujhe\thukm\thai\tke\tImān\twāloñ\tmeiñ\thuñ."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "106",
    "arabicText": "وَأَنْ أَقِمْ وَجْهَكَ لِلدِّينِ حَنِيفًۭا وَلَا تَكُونَنَّ مِنَ ٱلْمُشْرِكِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "“And\tthat\t‘Set\tyour\tface\tstraight\t*\tfor\treligion,\tapart\tfrom\tall\tothers;\tand\tnever\tbe\tof\tthose\twho\t\nascribe\tpartners\t(to\tAllah)’.”\t(*\tYour\tintention\tsincerely\tfor\treligion.)\t",
    "romanUrduTranslationText": "Aur\tyeh\tke\tapnā\tmuñh\tdin\tke\tliye\tseedhā\trakh\tsab\tse\talag\tho\tkar\taur\thargiz\tshirk\twāloñ\tmeiñ\t\nna\thonā."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "107",
    "arabicText": "وَلَا تَدْعُ مِن دُونِ ٱللَّهِ مَا لَا يَنفَعُكَ وَلَا يَضُرُّكَ ۖ فَإِن فَعَلْتَ فَإِنَّكَ إِذًۭا مِّنَ ٱلظَّـٰلِمِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "“And\tother\tthan\tAllah,\tdo\tnot\tworship\tthat\twhich\tcannot\tbenefit\tyou\tnor\tcause\tyou\tharm;\tthen\t\nif\tyou\tdo\tso,\tyou\twould\tbe\tof\tthe\tunjust.”\t(*\tSome\tthings\tlike\tthe\tsun,\tstars,\ttrees\tare\tuseful\tbut\t\nthey\ttoo\tare\tcreated\tby Allah.\tTheir\tworship\twill\tnot\tbenefit\t- in\tfact\tit\tis\tharmful.)",
    "romanUrduTranslationText": ". Aur\tAllāh\tke\tsiwā\tus\tki\tbandagi\tna\tkar\tjo\tterā\tna\tbhalā\tkar\tsake\tna\tburā\tphir\tagar\taisa\tkare\tto\tus\t\nwaqt\ttu\tzālimoñ\tse\thogā."
  },
  {
   
  },

  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "108",
    "arabicText": "قُلْ يَـٰٓأَيُّهَا ٱلنَّاسُ قَدْ جَآءَكُمُ ٱلْحَقُّ مِن رَّبِّكُمْ ۖ فَمَنِ ٱهْتَدَىٰ فَإِنَّمَا يَهْتَدِى لِنَفْسِهِۦ ۖ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيْهَا ۖ وَمَآ أَنَا۠ عَلَيْكُم بِوَكِيلٍۢ",
    "urduTranslationText": "",
    "englishTranslationText": "Say,\t“O\tpeople!\tThe\ttruth\t*\thas\tcome\tto\tyou\tfrom\t\nyour\t Lord;\t so\t whoever\t came\t to\t guidance,\t has\t\ncome\t to\t guidance\t for\t his\t own\t benefit;\t and\t\nwhoever\tstrayed,\thas\tstrayed\t for\this\town\tharm;\t\nand\t I\t am\t not\t a\t trustee\t over\t you.”\t (*\t Prophet\t\nMuhammad - peace\tand\tblessings\tbe\tupon\thim,\tor\t\nIslam\tor\tthe\tQur’an.)\t",
    "romanUrduTranslationText": ". Tum\tfarmāo\taye\tlogo\ttumhāre\tpās\ttumhāre\tRab\t\nki\ttaraf\thaq\tāyā\tto\tjo\trāh\tpar\tāyā\twoh\tapne\tbhale\t\nko\t rāh\t par\t āyā\t aur\tjo\t behkā\twoh\t apne\t bure\t ko\t\nbehkā\t aur\t kuch\t maiñ\t tum\t par\t kadodā\t\n(nigehbān)\tnahiñ."
  },
  {
    "juz": {
      "id": "11"
    },
    "surah": {
      "id": "10"
    },
    "ayatNumber": "109",
    "arabicText": "وَٱتَّبِعْ مَا يُوحَىٰٓ إِلَيْكَ وَٱصْبِرْ حَتَّىٰ يَحْكُمَ ٱللَّهُ ۚ وَهُوَ خَيْرُ ٱلْحَـٰكِمِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t (O\t dear\t Prophet\t Muhammad - peace\t and\t\nblessings\t be\t upon\t him)\t follow\t what\t is\t divinely\t\nrevealed\t to\t you,\t and\t have\t patience\t till\t Allah\ngives\tHis\tcommand;\tand\tHe\tis\tthe\tBest\tof\tRulers.",
    "romanUrduTranslationText": "Aur\t us\t par\t chalo\t jo\t tum\t par\t wahi\t hoti\t hai\t aur\t\nsabr\tkaro\tyahāñ\ttak\tke\tAllāh\thukm\tfarmāye\taur\t\nwoh\tsab\tse\tbehtar\thukm\tfarmāne\twālā\thai.\t"
  }
]