[
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "139",
    "arabicText": "ٱلَّذِينَ يَتَّخِذُونَ ٱلْكَـٰفِرِينَ أَوْلِيَآءَ مِن دُونِ ٱلْمُؤْمِنِينَ ۚ أَيَبْتَغُونَ عِندَهُمُ ٱلْعِزَّةَ فَإِنَّ ٱلْعِزَّةَ لِلَّهِ جَمِيعًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "Those\twho\tleave\tthe\tMuslims\tto\tbefriend\t\nthe\t disbelievers;\t do\t they\t seek\t honour\t\nfrom\tthem?\tThen\t(know\tthat)\tundoubtedly all\thonour\tis\tfor\tAllah",
    "romanUrduTranslationText": "Woh\tjo\tMusalmanoñ\tko\tchord\tkar\tkāfiroñ\tko\tdost\tbanāte\thaiñ\tkya\tun\tke\tpās\tizzat\tdhooñdhte\t\nhaiñ\tto\tizzat\tto\tsāri\tAllah\tke\tliye\thai."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "140",
    "arabicText": "وَقَدْ نَزَّلَ عَلَيْكُمْ فِى ٱلْكِتَـٰبِ أَنْ إِذَا سَمِعْتُمْ ءَايَـٰتِ ٱللَّهِ يُكْفَرُ بِهَا وَيُسْتَهْزَأُ بِهَا فَلَا تَقْعُدُوا۟ مَعَهُمْ حَتَّىٰ يَخُوضُوا۟ فِى حَدِيثٍ غَيْرِهِۦٓ ۚ إِنَّكُمْ إِذًۭا مِّثْلُهُمْ ۗ إِنَّ ٱللَّهَ جَامِعُ ٱلْمُنَـٰفِقِينَ وَٱلْكَـٰفِرِينَ فِى جَهَنَّمَ جَمِيعًا",
    "urduTranslationText": "",
    "englishTranslationText": "And\tindeed\tAllah has\tsent\tdown\tto\tyou\tin\tthe\tBook\tthat\twhenever\tyou\thear\tthe\tsigns\tof\tAllah\nbeing\t rejected\t or\t being\tmade\t fun\t of,\t do\t not\t sit\twith\t those\t people,\t until\t they\t engage\tin\t some\t\nother\tconversation;\tor\telse\tyou\ttoo\tare\tlike them;\tundoubtedly\tAllah will\tgather\tthe\thypocrites\t\nand\tthe\tdisbelievers,\tall\ttogether,\tinto\thell",
    "romanUrduTranslationText": "Aur\tbeshak\tAllah\t tum\tpar\tKitāb\tmeiñ\tutār\tchuka\tke\tjab\t tum\tAllah\tki\tāyatoñ\tko\tsuno\tke\tunka\t\ninkār\tkiya\tjāta\taur\tunki\thañsi\tbanāyi\tjāti\thai\tto\tun\tlogoñ\tke\tsāth\tna\tbaitho\tjab\ttak\twoh\taur\tbāt\t\nmeiñ\tmashghool\tna\thoñ\twarna\ttum\tbhi\tunke\tjaise\tho\tbeshak\tAllah\tmunāfiqoñ\taur\tkāfiroñ\tsab\t\nko\tjahannam\tmeiñ\tikhat-tha\tkareg"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "141",
    "arabicText": "ٱلَّذِينَ يَتَرَبَّصُونَ بِكُمْ فَإِن كَانَ لَكُمْ فَتْحٌۭ مِّنَ ٱللَّهِ قَالُوٓا۟ أَلَمْ نَكُن مَّعَكُمْ وَإِن كَانَ لِلْكَـٰفِرِينَ نَصِيبٌۭ قَالُوٓا۟ أَلَمْ نَسْتَحْوِذْ عَلَيْكُمْ وَنَمْنَعْكُم مِّنَ ٱلْمُؤْمِنِينَ ۚ فَٱللَّهُ يَحْكُمُ بَيْنَكُمْ يَوْمَ ٱلْقِيَـٰمَةِ ۗ وَلَن يَجْعَلَ ٱللَّهُ لِلْكَـٰفِرِينَ عَلَى ٱلْمُؤْمِنِينَ سَبِيلًا",
    "urduTranslationText": "",
    "englishTranslationText": "Those\t who\t keep\t watching\t your\t\ncircumstances;\t so\t if\t a\t victory\t comes\t to\t\nyou\t from\t Allah,\t they\t say,\t “Were\t we\t not\t\nwith\t you?”;\t and\t if\t victory\t is\t for\t\ndisbelievers,\t they\t say,\t “Did\t we\t not\t have\t\ncontrol\t over\t you,\t and\t protect\t you\t from\t\nthe\t Muslims?”\t Allah will\t judge\t between\t\nyou\t all\t on\t the\t Day\t of\t Resurrection;\t and\t\nAllah will\tnot\tprovide\tthe\tdisbelievers\tany\t\nway\tover\tthe\tMuslims.\t",
    "romanUrduTranslationText": "Woh\tjo\t tumhāri\t hālat\t takā\t (Dekha)\t karte\t\nhaiñ\tto\tagar\tAllah\tki\ttaraf\tse\ttum\tko\tfatāh\t\nmile\tkaheñ\tkya\tham\ttumhāre\tsāth\tna\tthey\t\naur\tagar\tkāfiroñ\tka\thissa\tho\tto\tunse\tkaheñ\t\nkya\thameiñ\ttum\tpar\tqābu\tna\ttha\taur\tham\t\nne\t tumheiñ\t Musalmānoñ\t se\t bachāya\t to\t\nAllah\ttum\tsab\tmeiñ\tQayāmat\tke\tdin\tfaislā\t\nkardega\taur\tAllah\tkāfiroñ\tko\tMusalmanoñ\t\npar\tkoi\trāh\tna\tdega\t."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "142",
    "arabicText": "مُّذَبْذَبِينَ بَيْنَ ذَٰلِكَ لَآ إِلَىٰ هَـٰٓؤُلَآءِ وَلَآ إِلَىٰ هَـٰٓؤُلَآءِ ۚ وَمَن يُضْلِلِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ سَبِيلًۭا",
    "urduTranslationText": "",
    "englishTranslationText": ". Undoubtedly\t the\t hypocrites,\t in\t their\t\nfancy,\t seek\t to\t deceive\t Allah whereas\t He\t\nwill\t extinguish\t them\t while\t making\t them\t\noblivious;\t and\t when\t they\t stand\t up\t for\t\nprayer,\t they\t do\t it\t unwillingly\t and\t for\t\nothers\t to\tsee,\tand\t they\tdo\tnot\t remember\t\nAllah except\ta\tlittle.\t",
    "romanUrduTranslationText": "Beshak\t munāfiq\t log\t apne\t gumān\t meiñ\t\nAllah\t ko\t fareb\t diya\t chāhte\t haiñ\taur\twohi\t\nunheiñ ghāfil\t karke\t mārega\t aur\t jab\t\nNamāz\tko\tkhade\thoñ\tto\thāre\tji\tse\tlogoñ\tko\t\ndikhāwa\tkarte\thaiñ\taur\tAllah\tko\tyād\tnahi\t\nkarte\tmagar\tthoda.\t."
  },
   
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "143",
    "arabicText": "مُّذَبْذَبِينَ بَيْنَ ذَٰلِكَ لَآ إِلَىٰ هَـٰٓؤُلَآءِ وَلَآ إِلَىٰ هَـٰٓؤُلَآءِ ۚ وَمَن يُضْلِلِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ سَبِيلًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "Fluctuating\tin\tthe\tmiddle;\tneither\there\t(in\t\nfaith)\tnor\t there\t(in\tdisbelief);\tand\t for\tone\t\nwhom\t Allah sends\t astray,\t you\t will\t not\t\nfind\ta\tway.\t\t",
    "romanUrduTranslationText": "Beech\t meiñ\t dagmaga\t rahe\t haiñ\t na\t idhar\t\nke\tna\tudhar\tke\taur\tjise\tAllah\tgumrāh\tkare\t\nto\tuske\tliye\tkoi\trāh\tna\tpāye\tga."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "144",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَتَّخِذُوا۟ ٱلْكَـٰفِرِينَ أَوْلِيَآءَ مِن دُونِ ٱلْمُؤْمِنِينَ ۚ أَتُرِيدُونَ أَن تَجْعَلُوا۟ لِلَّهِ عَلَيْكُمْ سُلْطَـٰنًۭا مُّبِينًا",
    "urduTranslationText": "",
    "englishTranslationText": "O\t People\t who\t Believe!\t Do\t not\t befriend\t\ndisbelievers\t in\t place\t of\t Muslims;\t do\t you\t\nwish\t to give\t Allah a\t clear\t proof\t against\t\nyou?\t\t",
    "romanUrduTranslationText": "Aey\tImān\twālo!\tKāfiroñ\tko\tdost\tna\tbanāo\t\nMusalmanoñ\t ke\t siwa\t kya\t yeh\t chāhte\t ho\t\nke\t apne\t upar\t Allah\t ke\t liye\t sareeh\t hujjat\t\nkar\tlo"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "145",
    "arabicText": "إِنَّ ٱلْمُنَـٰفِقِينَ فِى ٱلدَّرْكِ ٱلْأَسْفَلِ مِنَ ٱلنَّارِ وَلَن تَجِدَ لَهُمْ نَصِيرًا",
    "urduTranslationText": "",
    "englishTranslationText": "Undoubtedly\t the\t hypocrites\t are\t in\t the\t\ndeepest\t segment\t of\t hell;\t and\t you\t will\t\nnever\tfind\tany\tsupporter\tfor\tthem.\t",
    "romanUrduTranslationText": "Beshak\tmunāfiq\tdozakh\tke\tsabse\tneeche\ttabqe\tmeiñ\thaiñ\thargiz\tunka\tkoi\tmadad-gār\tna\tpāye\tga"
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "146",
    "arabicText": "إِلَّا ٱلَّذِينَ تَابُوا۟ وَأَصْلَحُوا۟ وَٱعْتَصَمُوا۟ بِٱللَّهِ وَأَخْلَصُوا۟ دِينَهُمْ لِلَّهِ فَأُو۟لَـٰٓئِكَ مَعَ ٱلْمُؤْمِنِينَ ۖ وَسَوْفَ يُؤْتِ ٱللَّهُ ٱلْمُؤْمِنِينَ أَجْرًا عَظِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": "Except\t those\twho\t repented\tand\t reformed\t themselves\tand\t held\t fast\t to\tAllah’s\t rope\tand\tmade\t\ntheir\treligion\tsincerely\tonly\tfor\tAllah - so\tthey\tare\twith\tthe\tMuslims;\tand\tAllah will\tsoon\tbestow\t\nupon\tthe\tbelievers\ta\tgreat\treward.\t",
    "romanUrduTranslationText": "Magar\twoh\tjinhoñ\tne\ttauba\tki\taur\tsañwre\t(Apni\tIslāh ki\t)\taur\tAllah\tki\tRassi\tmazboot\tthāmi\taur\t\napna\tDeen\t khālis\t Allah\t ke\tliye\t kar\tliyā\t to\t yeh Musalmanoñ\t ke\t sāth\t haiñ\t aur\t an-qareeb\t Allah\t\nMusalmanoñ\tko\tbadā\tsawāb\tdega."
  },
  {
    "juz": {
      "id": "5"
    },
    "surah": {
      "id": "4"
    },
    "ayatNumber": "147",
    "arabicText": "مَّا يَفْعَلُ ٱللَّهُ بِعَذَابِكُمْ إِن شَكَرْتُمْ وَءَامَنتُمْ ۚ وَكَانَ ٱللَّهُ شَاكِرًا عَلِيمًۭا",
    "urduTranslationText": "",
    "englishTranslationText": ". And\twhat\twill\tAllah gain\tby\tpunishing\tyou,\tif\tyou\tacknowledge\tthe\ttruth\tand\taccept\tfaith?\tAnd\t\nAllah is\tMost\tAppreciative,\tAll\tKnowing.\t",
    "romanUrduTranslationText": ". Aur\tAllah\ttumheiñ\tázāb\tdekar\tkiya\tkarega\tagar\ttum\tHaq\tmāno\taur\t Imān\tlāo\taur\tAllah\thai\tsilā\t\ndene\twāla\tjān\tne\twāla"
  }
]