[
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "18",
    "arabicText": "صُمٌّۢ بُكْمٌ عُمْىٌۭ فَهُمْ لَا يَرْجِعُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Deaf,\tdumb\tand\tblind;\tand\tthey\tare\tnot\tto\t\nreturn.\t",
    "romanUrduTranslationText": "Bahre\tgooñge\tandhe\tto\twoh\tphir\tāne\twāle\t\nnhiñ\t"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "19",
    "arabicText": "أَوْ كَصَيِّبٍۢ مِّنَ ٱلسَّمَآءِ فِيهِ ظُلُمَـٰتٌۭ وَرَعْدٌۭ وَبَرْقٌۭ يَجْعَلُونَ أَصَـٰبِعَهُمْ فِىٓ ءَاذَانِهِم مِّنَ ٱلصَّوَٰعِقِ حَذَرَ ٱلْمَوْتِ ۚ وَٱللَّهُ مُحِيطٌۢ بِٱلْكَـٰفِرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Or\tlike\ta\trainstorm\tfrom\tthe\tsky,\tin\twhich\t\nare\tdarkness,\tthunder\tand\tlightning;\tthey\t\nthrust\ttheir\tfingers\tin\ttheir\tears\tdue\tto\tthe\t\nthunderclaps,\tfearing\tdeath;\tand\tAllah has\t\nthe\tdisbelievers\tencompassed.. Or\tlike\ta\trainstorm\tfrom\tthe\tsky,\tin\twhich\t\nare\tdarkness,\tthunder\tand\tlightning;\tthey\t\nthrust\ttheir\tfingers\tin\ttheir\tears\tdue\tto\tthe\t\nthunderclaps,\tfearing\tdeath;\tand\tAllah has\t\nthe\tdisbelievers\tencompassed.",
    "romanUrduTranslationText": "Ya\t jaise\t āsmān\t se\t utarta\t pāni\t ke\t is meiñ\t\nandheriyāñ haiñ\t aur\t garaj\t aur\t chamak\t\napne\t kānoñ\t meiñ\t ungliyāñ thooñs\t rahe\t\nhaiñ\t kadak\t ke\t sabab,\tmaut\t ke\t dar\t se\t aur\t\nAllah\tkafiroñ ko\tghere\thuwe\thai"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "20",
    "arabicText": "يَكَادُ ٱلْبَرْقُ يَخْطَفُ أَبْصَـٰرَهُمْ ۖ كُلَّمَآ أَضَآءَ لَهُم مَّشَوْا۟ فِيهِ وَإِذَآ أَظْلَمَ عَلَيْهِمْ قَامُوا۟ ۚ وَلَوْ شَآءَ ٱللَّهُ لَذَهَبَ بِسَمْعِهِمْ وَأَبْصَـٰرِهِمْ ۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "It\t seems\t the\t lightning\t may\t snatch\t away\t\ntheir\tsight\tfrom\tthem;\twhenever\tit\tflashes\t\nthey\twalk\tin\tit,\tand\twhen\tit\tdarkens\t they\t\nstand\t still;\t if\t Allah willed,\t He\t could\t take\t\naway\ttheir\thearing\tand\ttheir\tsight;\tindeed\t\nAllah is\tAble\tto\tdo\tall\tthings",
    "romanUrduTranslationText": "Ya\t jaise\t āsmān\t se\t utarta\t pāni\t ke\t is meiñ\t\nBijli\t yooñ\t ma'loom\t hoti\t hai\t ke\t unki\t\nnigaheiñ\tuchak\tle\tjayegi\tjab\tkuch\tchamak\t\nhuyi\tus\tmeiñ\tchalne\tlage\taur\tjab\tandhera\t\nhuwa\t khade\t rah\t gye\t aur\t Allah\t chāhta\t to\t\nunke\t kān\t aur\t ānkheiñ\t le\t jāta\t be-shak\t\nAllah\tsab\tkuch\tkar\tsakta\thai\t"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "21",
    "arabicText": "يَـٰٓأَيُّهَا ٱلنَّاسُ ٱعْبُدُوا۟ رَبَّكُمُ ٱلَّذِى خَلَقَكُمْ وَٱلَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "O\tmankind!\tWorship\tyour\tLord,\tWho\thas\t\ncreated\t you\t and\t those\t before\t you,\tin\t the\t\nhope\tof\tattaining\tpiety",
    "romanUrduTranslationText": "Aey\t logon!\t apney\t Rab\t ko\t poojo\t jis\t ne\t\ntumheiñ\t aur\t tum\t se\t agloñ\t ko\t paida\t kiya\t\nyeh\tummeed\tkarte\thue\tke\t tumhe\tparhez\u0002gāri\tmil"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "22",
    "arabicText": "ٱلَّذِى جَعَلَ لَكُمُ ٱلْأَرْضَ فِرَٰشًۭا وَٱلسَّمَآءَ بِنَآءًۭ وَأَنزَلَ مِنَ ٱلسَّمَآءِ مَآءًۭ فَأَخْرَجَ بِهِۦ مِنَ ٱلثَّمَرَٰتِ رِزْقًۭا لَّكُمْ ۖ فَلَا تَجْعَلُوا۟ لِلَّهِ أَندَادًۭا وَأَنتُمْ تَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "The\t One\t Who\t has\t appointed\t the\t earth\t a\t\nbase\t for\t you,\t and\t the\t sky\t a\t canopy\t- and\t\ncaused\twater\tto\tpour\tdown\t from\tthe\tsky,\t\nthereby\t producing\t fruits\t as\t food for\t you;\t\nand\t do\t not\t knowingly\t set\t up\t rivals\t to\t\nAllah",
    "romanUrduTranslationText": "Woh jis\t ne\t tumhare\t liye\t zameen\t ko\t\nbichauna\t aur\t āasman\t ko\t imarat\t banaya\t\naur\tāasman\tse\tpāni\tutāra\tto\tus\tse\tkuch\tphal\tnikāle\ttumhāre\tkhāne\tko\tto\tAllah\tke\tliye\tjān\tboojh\t\nkar\tbarabar\twala\tna\tthahrao\t"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "23",
    "arabicText": "وَإِن كُنتُمْ فِى رَيْبٍۢ مِّمَّا نَزَّلْنَا عَلَىٰ عَبْدِنَا فَأْتُوا۟ بِسُورَةٍۢ مِّن مِّثْلِهِۦ وَٱدْعُوا۟ شُهَدَآءَكُم مِّن دُونِ ٱللَّهِ إِن كُنتُمْ صَـٰدِقِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t if\t you\t are\t in\t any\t doubt\t concerning\t\nwhat\tWe\thave\tsent\tdown\tupon\tOur\tdistinguished\tbondman\t(Prophet\tMuhammad - peace\t and\t\nblessings\t be\t upon\t him),\tbring\t forth\ta\t single\t surah\t(chapter)\tequal\t to\tit;\tand\tcall\tupon\tall\t your\t\nsupporters,\tother\tthan\tAllah,\tif\tyou\tare\ttruthful.",
    "romanUrduTranslationText": "Aur\tagar\t tumheiñ\t kuchh\t shak\t ho\tis\tmeiñ\tjo\t ham\t ne\tapne\t khās\t bande\t per\t utāra\t to\tus jaisi\tek\t\nsoorat\tto\tle\tāao\taur\tAllah\tke\tsiwa\tapne\tsab\thimayatiyoñ\tko\tbula\tlo\tagar\ttum\tsachche ho"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "24",
    "arabicText": "فَإِن لَّمْ تَفْعَلُوا۟ وَلَن تَفْعَلُوا۟ فَٱتَّقُوا۟ ٱلنَّارَ ٱلَّتِى وَقُودُهَا ٱلنَّاسُ وَٱلْحِجَارَةُ ۖ أُعِدَّتْ لِلْكَـٰفِرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tif\tyou\tare\tunable\tto\tbring\tforth\t(one\tchapter)\t- and\tWe\tdeclare\tthat\tyou\tcan\tnever\tbring\tone\t\n- then\tfear\tthe\tfire\t(of\thell),\tthe\tfuel\tof\twhich\tis\tmen\tand\tstones;\tkept\tready\tfor\tthe\tdisbelievers.",
    "romanUrduTranslationText": "Phir\tagar\tna\tla\tsako\taur\tham\t farmaye\tdete\thaiñ\tke\thargiz\tna\tla\tsakoge\t to\tdaro\tus\tāg\tse\tjis\tka\t\neeñdhan\tādmi\taur\tpatthar\thaiñ\ttayyar\trakhi\thai\tkāfiroñ\tke\tliye"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "25",
    "arabicText": "وَبَشِّرِ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ أَنَّ لَهُمْ جَنَّـٰتٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ ۖ كُلَّمَا رُزِقُوا۟ مِنْهَا مِن ثَمَرَةٍۢ رِّزْقًۭا ۙ قَالُوا۟ هَـٰذَا ٱلَّذِى رُزِقْنَا مِن قَبْلُ ۖ وَأُتُوا۟ بِهِۦ مُتَشَـٰبِهًۭا ۖ وَلَهُمْ فِيهَآ أَزْوَٰجٌۭ مُّطَهَّرَةٌۭ ۖ وَهُمْ فِيهَا خَـٰلِدُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tgive\tglad\ttidings\tto\tthose\twho\tbelieve\t\nand\t do\t good\t deeds;\t that\t for\t them\t are\t\nGardens\tbeneath\twhich\trivers\tflow;\twhen\t\nthey\t are\t provided\t with\t a\t fruit\t of\t the\t\nGardens,\t they\t will\t say,\t “This\t is\t the\t same\t\nfood\t as\t what\t was\t given\t to\t us\t before”\t\nwhereas\t it\t is\t in\t resemblance;\t and\t in\t the\t\nGardens\t are\t pure\t spouses\t for\t them;\t and\t\nthey\tshall\tabide\tin\tit\tforever.",
    "romanUrduTranslationText": "Aur\tkhush\tkhabri\tde\tunheiñ\tjo\t Īmān\tlāye\t\nAur\t achchhe\t kām\t kiye\t ke\t unke\t liye\t bāgh\t\nhaiñ\t jinke\t neeche\t nahreiñ\t rawāñ\t jab\t\nunheiñ\t un\t bāghoñ\t se\t phal\t khane\t ko\tdiya\t\njaye\t ga\t soorat\t dekh\t kar\t kaheñ\t ge\t yeh\t to\t\nwohi\trizq\thai\tjo\thameiñ\tpahle\tmila\ttha\taur\t\nwoh\t soorat\t meiñ\t milta\t julta\t unheiñ\t diya\t\ngaya\taur\tunke\tliye\tun\tbāghoñ\tmeiñ\tsuthri\t\nbiwiyāñ\t haiñ\t aur\t woh\t un\t meiñ\t hamesha\t\nraheiñ\tge"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "26",
    "arabicText": "۞ إِنَّ ٱللَّهَ لَا يَسْتَحْىِۦٓ أَن يَضْرِبَ مَثَلًۭا مَّا بَعُوضَةًۭ فَمَا فَوْقَهَا ۚ فَأَمَّا ٱلَّذِينَ ءَامَنُوا۟ فَيَعْلَمُونَ أَنَّهُ ٱلْحَقُّ مِن رَّبِّهِمْ ۖ وَأَمَّا ٱلَّذِينَ كَفَرُوا۟ فَيَقُولُونَ مَاذَآ أَرَادَ ٱللَّهُ بِهَـٰذَا مَثَلًۭا ۘ يُضِلُّ بِهِۦ كَثِيرًۭا وَيَهْدِى بِهِۦ كَثِيرًۭا ۚ وَمَا يُضِلُّ بِهِۦٓ إِلَّا ٱلْفَـٰسِقِينَ",
    "urduTranslationText": "",
    "englishTranslationText": ". Indeed\t Allah does\t not,\t for\t the\t sake\t of\t\nexplanation,\t shy\t to\t illustrate\t an\t example\t\nof\t anything,\t whether\t it\t is\t of\t a\t gnat\t or\t\nsomething\tfurther\t(inferior)\tthan\tit;\tso the\t\nbelievers\t know\tit\tis\t the\t Truth\t from\t their\t\nLord;\t as\t for\t the\t disbelievers,\t they\t say,\t\n“What\t does\t Allah intend\t by\t such\t an\t\nexample?”\tHe\tmisleads\tmany\tthereby,\tand\t\nHe\t guides\t many\t thereby;\t and\t with\t it\t He\t\nmisleads\tonly\tthose\twho\tare\trebellious.",
    "romanUrduTranslationText": ". Beshak\t Allah\t is\t se\t haya\t nhi\t farmāta\t ke\t\nmisāl\t samjhane\t ko\t kaisi\t hi\t cheez\t ka\t zikr\t\nfarmaaye,\tmach-char\tho\tya\tus\tse\tbadh\tkar\t\nto\twoh\tjo\tĪmān\tlāye\twoh\tjānte\thaiñ\tke\tyeh\t\nunke\trab\tki\ttaraf\tse\thaq hai\trahe\tkāfir\twoh\t\nkahte\t haiñ\t aisi\t kahawat\t meiñ\t Allah\t ka\t\nkiya\t maqsood\t hai,\t Allah\t bahuteroñ\t ko\t is\t\nse\tgumrāh\tkarta\thai\taur\tbahuteroñ\tko\thidāyat\tfarmāta\thai\taur\tis\tse\tunheiñ\tgumrāh\tkarta\thai\tjo\t\nbe-hukm\thaiñ\t"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "27",
    "arabicText": "ٱلَّذِينَ يَنقُضُونَ عَهْدَ ٱللَّهِ مِنۢ بَعْدِ مِيثَـٰقِهِۦ وَيَقْطَعُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيُفْسِدُونَ فِى ٱلْأَرْضِ ۚ أُو۟لَـٰٓئِكَ هُمُ ٱلْخَـٰسِرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Those\t who\t break\t the\t covenant\t of\t Allah\nafter\t ratifying\t it\t - and\t sever\t what\t Allah\nhas\t ordered\t to\t join,\t and\t who\t cause\t\nturmoil\t (evil\t /\t religious\t chaos)\t in\t the\t\nearth;\tit\tis\tthey\twho\tare\tthe\tlosers.\t",
    "romanUrduTranslationText": "Woh\tjo\t Allah\t ke\t ‘ahed\t ko\t tord\t dete\t haiñ\t pakka\t hone\t ke\t b‘ād\t aur\t kāt-te\t hai\t us\t cheez\t ko\tjiske\t\njordne\tka\tKhuda\tne\thukm\tdiya\taur\tzameen\tme\tfasād\tphailāte\thaiñ\twohi\tnuqsān\tmeiñ\thaiñ"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "28",
    "arabicText": "كَيْفَ تَكْفُرُونَ بِٱللَّهِ وَكُنتُمْ أَمْوَٰتًۭا فَأَحْيَـٰكُمْ ۖ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ ثُمَّ إِلَيْهِ تُرْجَعُونَ",
    "urduTranslationText": "",
    "englishTranslationText": " What\t has\t made\t you\t disbelieve\t in\t Allah?\t\nWhereas\tyou\twere\tdead\tand\tHe\tgave\tyou\t\nlife;\t then\t He\t will\t give\t you\t death,\t then\t bring\t you\t to\t life\t again,\t and\t then\t it\t is\t to\t Him\t you\t will\t\nreturn!\t",
    "romanUrduTranslationText": "Bhala\ttum\tkiyuñ\tkar\tKhuda\tke\tmunkir\thoge\thalānke\ttum\tmurda\tthey\tUsne\ttumheiñ\tjilaya\tphir\t\ntumheiñ\tmārega\tphir\ttumheiñ\tjilaye\tga\tphir\tuski\ttaraf\tpalat\tkar\tjaoge"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "29",
    "arabicText": "هُوَ ٱلَّذِى خَلَقَ لَكُم مَّا فِى ٱلْأَرْضِ جَمِيعًۭا ثُمَّ ٱسْتَوَىٰٓ إِلَى ٱلسَّمَآءِ فَسَوَّىٰهُنَّ سَبْعَ سَمَـٰوَٰتٍۢ ۚ وَهُوَ بِكُلِّ شَىْءٍ عَلِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": " It\t is\t He\t Who\t created\t for\t you\t all\t that\t is\t in\t the\t earth;\t then\t He\t inclined\t towards\t the\t heaven,\t\ntherefore\tfashioning\tit\tas\tproper\tseven\theavens;\tand\tHe\tknows\teverything.",
    "romanUrduTranslationText": ". Wohi\thai\tjisne\ttumare\tliye\tbanāya\tjo\tkuch\tzameen\tmeiñ\thai\tphir\tāsmān\tki\ttaraf\tistiwa\t(qasad)\t\nfarmaya\tto\ttheek\tsāt\tāsmān\tbanāye\taur\twoh\tsab\tkuch\tjānta\thai"
  },
  {
    "juz": {
      "id": "1"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "30",
    "arabicText": "وَإِذْ قَالَ رَبُّكَ لِلْمَلَـٰٓئِكَةِ إِنِّى جَاعِلٌۭ فِى ٱلْأَرْضِ خَلِيفَةًۭ ۖ قَالُوٓا۟ أَتَجْعَلُ فِيهَا مَن يُفْسِدُ فِيهَا وَيَسْفِكُ ٱلدِّمَآءَ وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ وَنُقَدِّسُ لَكَ ۖ قَالَ إِنِّىٓ أَعْلَمُ مَا لَا تَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". And\t(remember)\twhen\tyour\tLord\tsaid\tto\t\nthe\t angels,\t “I\t am\t about\t to\t place\t My\t\nCaliph\tin\tthe\tearth”;\tthey\tsaid,\t“Will\tYou\t\nplace\t(as\t a\t caliph)\tone\twho\twill\t spread\t\nturmoil\t in\t it\t and\t shed\t blood?\t Whereas\t\nwe\tglorify\tYou\twith\tpraise\tand\tproclaim\t\nYour\t Sanctity”;\t He\t said,\t “I\t know\t what\t\nyou\tdo\tnot.”",
    "romanUrduTranslationText": ". Aur\t yād\t karo\t jab\t tumhāre\t Rab\t ne\t\nFarishtoñ\tse\tfarmāya\tmaiñ\tzameen\tmeiñ\t\napna\t nāyeb\t banane\t wala\t huñ\t bole\t kiya\t\naise\t ko\t nāyeb\t karega\t jo\t us\t meiñ\t fasād\t\nphailāye\t aur\t khooñ\t reziyāñ\t kare\t aur\t\nhum\t tujhe\t sarahte\t huwe\t teri\t tasbeeh\t\nkarte\t aur\t teri\t pāki\t bolte\t haiñ,\t farmāya\nmujhe\tma'loom\thai\tjo\ttum\tnhi\tjānte"
  }
]