[
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "97",
    "arabicText": "فِيهِ ءَايَـٰتٌۢ بَيِّنَـٰتٌۭ مَّقَامُ إِبْرَٰهِيمَ ۖ وَمَن دَخَلَهُۥ كَانَ ءَامِنًۭا ۗ وَلِلَّهِ عَلَى ٱلنَّاسِ حِجُّ ٱلْبَيْتِ مَنِ ٱسْتَطَاعَ إِلَيْهِ سَبِيلًۭا ۚ وَمَن كَفَرَ فَإِنَّ ٱللَّهَ غَنِىٌّ عَنِ ٱلْعَـٰلَمِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "In\tit\tare\tclear\tsigns\t- the\tplace\twhere\tIbrahim\t\nstood\t(is\tone\tof\tthem);\tand\twhoever\tenters\tit\t\nshall\t be\t safe;\t and\t performing\t the\t Hajj\t\n(pilgrimage) of\t this\t house,\t for\t the\t sake\t of\t\nAllah,\t is\t a\t duty\t upon\t mankind,\t for\t those\t\nwho\tcan\treach\tit;\tand\twhoever\tdisbelieves\n– then\tAllah is\tIndependent\t(Unwanting)\tof\t\nthe\tentire\tcreation!\t",
    "romanUrduTranslationText": "Is\tmeiñ\tkhuli\tnishāniyāñ\thaiñ\tIbrāheem ke\t\nkhade\t hone\t ki\t jagah\t aur\t jo\t is\t meiñ\t āye\t\namān\tmeiñ\t ho\taur\tAllah\t ke\tliye\tlogoñ\t par\t\nus\tghar\tka\tHaj karna\thai\tjo\tus\ttak\tchal\tsake\t\naur\tjo\tmunkir\tho\tto\tAllah\tsāre\tjahān\tse\tbe\u0002parwah\thai"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "98",
    "arabicText": "قُلْ يَـٰٓأَهْلَ ٱلْكِتَـٰبِ لِمَ تَكْفُرُونَ بِـَٔايَـٰتِ ٱللَّهِ وَٱللَّهُ شَهِيدٌ عَلَىٰ مَا تَعْمَلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Say\t (O\t dear\t Prophet\t Muhammad - peace\t\nand\tblessings\tbe\tupon\thim),\t“O\tPeople\tgiven\tthe\tBook(s)!\tWhy\tdo\tyou\tnot\tbelieve\tin\tthe\tverses\t\n(or\tsigns)\tof\tAllah,\twhereas\tyour\tdeeds\tare\tbeing\twitnessed\tby\tAllah?”",
    "romanUrduTranslationText": ". Tum\tfarmāo\taey\tkitābiyoñ!\tAllah\tki\tĀyateiñ\t\nkiyuñ\t nahi\t mānte\t aur\t tumhāre\t kām\t Allah\t\nke\tsāmne\thaiñ"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "99",
    "arabicText": "قُلْ يَـٰٓأَهْلَ ٱلْكِتَـٰبِ لِمَ تَصُدُّونَ عَن سَبِيلِ ٱللَّهِ مَنْ ءَامَنَ تَبْغُونَهَا عِوَجًۭا وَأَنتُمْ شُهَدَآءُ ۗ وَمَا ٱللَّهُ بِغَـٰفِلٍ عَمَّا تَعْمَلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Say\t(O\tdear\tProphet\tMuhammad - peace\tand\tblessings\tbe\tupon\thim),\t“O\tPeople\tgiven\tthe\tBook(s)!\t\nWhy\t do\t you\t prevent\t those\t who\t have\t accepted\t faith\t from\t the\t way\t of\tAllah,\t seeking\t to\t cause\t\ndeviation\tin\tit,\twhereas\tyou\tyourselves\tare\twitnesses\t to\tit?\tAnd\tAllah is\tnot\tunaware\tof\tyour\t\ndeeds!”",
    "romanUrduTranslationText": ". Tum\tfarmāo\taey\tkitābiyoñ!\tKiyuñ\tAllah\tki\trāh\tse\trokte\tho\tusey\tjo\tImān\tlāye\tuse\ttedhā\tkiya\tchahte\t\nho\taur\ttum\tkhud\tis\tpar\tgawāh\tho\taur\tAllah\ttumhāre\tkoutakoñ\tse\tbe-khabar\tnahi.\t"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "100",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِن تُطِيعُوا۟ فَرِيقًۭا مِّنَ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَـٰبَ يَرُدُّوكُم بَعْدَ إِيمَـٰنِكُمْ كَـٰفِرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "O\tPeople\twho\tBelieve!\t If\tyou\tobey\tsome\tof\tPeople\tgiven\t the\tBook(s),\t they\twill\tdefinitely\t turn\t\nyou\tinto\tdisbelievers\tafter\tyour\thaving\taccepted\tfaith.",
    "romanUrduTranslationText": "Aey\tImān\twālo!\tAgar\ttum\tkuch kitābiyoñ\tke\tkahe\tpar\tchale\tto\twoh\ttumhāre\tImān\tke\tbād\ttumheiñ\t\nkāfir\tkar\tchordeñ\tge"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "101",
    "arabicText": "وَكَيْفَ تَكْفُرُونَ وَأَنتُمْ تُتْلَىٰ عَلَيْكُمْ ءَايَـٰتُ ٱللَّهِ وَفِيكُمْ رَسُولُهُۥ ۗ وَمَن يَعْتَصِم بِٱللَّهِ فَقَدْ هُدِىَ إِلَىٰ صِرَٰطٍۢ مُّسْتَقِيمٍۢ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t how\t can\t you\t disbelieve,\t whereas\t\nAllah’s\t verses\t are\t recited\t to\t you\t and\t His\t\nNoble\t Messenger\t is\t present\t amongst\t\nyou?!\t And\t whoever\t takes\t the\t support\t of\t\nAllah is\tindeed\tguided\tto\tthe\tright\tpath",
    "romanUrduTranslationText": "Aur\ttum\tkiyuñ\tkar\tkufr\tkaroge\ttum\tpar\tto\t\nAllah\t ki\t āyateiñ\t padhi\t jāti\t haiñ\t aur\t tum\t\nmeiñ\tus\tka\tRasool\t tashreef\t farma\thai\taur\t\njis ne\tAllah\tka\tsahāra\tliya\twoh\tseedhi\trāh\t\ndikhāya\tgaya"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "102",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱتَّقُوا۟ ٱللَّهَ حَقَّ تُقَاتِهِۦ وَلَا تَمُوتُنَّ إِلَّا وَأَنتُم مُّسْلِمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". O\t People\t who\t Believe!\t Fear\t Allah in\t the\t\nmanner\t He\t should\t rightfully\t be\t feared,\t\nand\tdo\tnot\tdie\texcept\tas\tMuslims.\t\n",
    "romanUrduTranslationText": "Aey\t Imān\t wālo!\t Allah\t se\t daro\t jaisa\t us\t se\t\ndarne\t ka\t haq\t hai\t aur\t hargiz\t na\t marna\t\nmagar\tMusalman"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "102",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱتَّقُوا۟ ٱللَّهَ حَقَّ تُقَاتِهِۦ وَلَا تَمُوتُنَّ إِلَّا وَأَنتُم مُّسْلِمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". O\t People\t who\t Believe!\t Fear\t Allah in\t the\t\nmanner\t He\t should\t rightfully\t be\t feared,\t\nand\tdo\tnot\tdie\texcept\tas\tMuslims.\t\n",
    "romanUrduTranslationText": "Aey\t Imān\t wālo!\t Allah\t se\t daro\t jaisa\t us\t se\t\ndarne\t ka\t haq\t hai\t aur\t hargiz\t na\t marna\t\nmagar\tMusalman"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "103",
    "arabicText": "وَٱعْتَصِمُوا۟ بِحَبْلِ ٱللَّهِ جَمِيعًۭا وَلَا تَفَرَّقُوا۟ ۚ وَٱذْكُرُوا۟ نِعْمَتَ ٱللَّهِ عَلَيْكُمْ إِذْ كُنتُمْ أَعْدَآءًۭ فَأَلَّفَ بَيْنَ قُلُوبِكُمْ فَأَصْبَحْتُم بِنِعْمَتِهِۦٓ إِخْوَٰنًۭا وَكُنتُمْ عَلَىٰ شَفَا حُفْرَةٍۢ مِّنَ ٱلنَّارِ فَأَنقَذَكُم مِّنْهَا ۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمْ ءَايَـٰتِهِۦ لَعَلَّكُمْ تَهْتَدُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t hold\t fast\t to\t the\t rope\t of\t Allah,\t all\t of\t\nyou\t together,\tand\t do\t not\t be\t divided;\tand\t\nremember\t Allah’s\t favour\t on\t you,\t that\t\nwhen\t there\twas\tenmity\t between\t you,\tHe\t\ncreated\taffection\tbetween\tyour\thearts,\tso\t\ndue\tto\tHis\tgrace\tyou\tbecame\tlike\tbrothers\t\nto\t each\t other;\t and\t you\twere\t on\t the\t edge\t\nof\ta\tpit\tof\tfire\t(hell),\tso\tHe\tsaved\tyou\tfrom\t\nit;\tthis\tis\thow\tAllah explains\tHis\tverses\tto\t\nyou,\tso\tthat\tyou\tmay\tbe\tguided.\t\n",
    "romanUrduTranslationText": "Aur\tAllah\tki\trassi\tmazboot\tthām\tlo\tsab\tmil\t\nkar\taur\tāpas\tmeiñ\tphat\tna\tjāna\taur\tAllah\t\nka\t ehsān\t apne\t upar\t yād\t karo\t jab\t tum\t\nmeiñ\t bair\t tha\t usne\t tumhāre\t diloñ\t meiñ\t\nmilāp\t kar\t diya\t to\t us\t ke\t fazl\t se\t tum\t āpas\t\nmeiñ\t bhāi\t ho\t gaye\t aur\t tum\t ek\t ghār-e\u0002dozakh\t ke\t kināre\t par\t they\t to\t us\t ne\t\ntumheiñ\t us\t se\t bacha\t diya\t Allah\t tum\t se\t\nyooñ\thi\tapni\tāyateiñ\tbayān\tfarmāta\thai\tke\t\nkahiñ\ttum\thidāyat\tpāo"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "104",
    "arabicText": "وَلْتَكُن مِّنكُمْ أُمَّةٌۭ يَدْعُونَ إِلَى ٱلْخَيْرِ وَيَأْمُرُونَ بِٱلْمَعْرُوفِ وَيَنْهَوْنَ عَنِ ٱلْمُنكَرِ ۚ وَأُو۟لَـٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t there\t should\t be\t a\t group\t among\t you\t\nthat\tinvites\tto\tgoodness,\tand\tenjoins\tgood\t\ndeeds\t and\t forbids\t immorality;\t it\t is\t they\t\nwho\tare\tthe\tsuccessful.\t\n",
    "romanUrduTranslationText": "Aur\t tum\tmeiñ\tek\tgiroh\taisa\thona\tchahiye\t\nke\t bhalāi\t ki\t taraf\t bulāyeiñ\t aur\t achhi\t bāt\t\nka\thukm\tdeiñ\taur\tburi\tbāt\tse\tmana\tkareiñ\t\naur\tyehi\tlog\tmurād\tko\tpahuñche"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "105",
    "arabicText": "وَلَا تَكُونُوا۟ كَٱلَّذِينَ تَفَرَّقُوا۟ وَٱخْتَلَفُوا۟ مِنۢ بَعْدِ مَا جَآءَهُمُ ٱلْبَيِّنَـٰتُ ۚ وَأُو۟لَـٰٓئِكَ لَهُمْ عَذَابٌ عَظِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t do\t not\t be\t like\t those\t who\t became\t\ndivided\tand\tdisputed\tafter\tthe\tclear\tsigns\t\nhad\t come\t to\t them;\t and\t for\t them\t is\t a\t\nterrible\tpunishment.\t\n",
    "romanUrduTranslationText": "Aur\t tum\tmeiñ\tek\tgiroh\taisa\thona\tchahiye\t\nke\t bhalāi\t ki\t taraf\t bulāyeiñ\t aur\t achhi\t bāt\t\nka\thukm\tdeiñ\taur\tburi\tbāt\tse\tmana\tkareiñ\t\naur\tyehi\tlog\tmurād\tko\tpahuñche"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "105",
    "arabicText": "وَلَا تَكُونُوا۟ كَٱلَّذِينَ تَفَرَّقُوا۟ وَٱخْتَلَفُوا۟ مِنۢ بَعْدِ مَا جَآءَهُمُ ٱلْبَيِّنَـٰتُ ۚ وَأُو۟لَـٰٓئِكَ لَهُمْ عَذَابٌ عَظِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t do\t not\t be\t like\t those\t who\t became\t\ndivided\tand\tdisputed\tafter\tthe\tclear\tsigns\t\nhad\t come\t to\t them;\t and\t for\t them\t is\t a\t\nterrible\tpunishment.\t\n",
    "romanUrduTranslationText": "Aur\t tum\tmeiñ\tek\tgiroh\taisa\thona\tchahiye\t\nke\t bhalāi\t ki\t taraf\t bulāyeiñ\t aur\t achhi\t bāt\t\nka\thukm\tdeiñ\taur\tburi\tbāt\tse\tmana\tkareiñ\t\naur\tyehi\tlog\tmurād\tko\tpahuñche"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "106",
    "arabicText": "يَوْمَ تَبْيَضُّ وُجُوهٌۭ وَتَسْوَدُّ وُجُوهٌۭ ۚ فَأَمَّا ٱلَّذِينَ ٱسْوَدَّتْ وُجُوهُهُمْ أَكَفَرْتُم بَعْدَ إِيمَـٰنِكُمْ فَذُوقُوا۟ ٱلْعَذَابَ بِمَا كُنتُمْ تَكْفُرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "On\t the\t Day\t(of\t Resurrection)\t when\t some\t\nfaces\t will\t be\t shining\t and\t some\t faces\t\nblack;\t so,\t (to)\t those\t whose\t faces\t are\t\nblackened,\t “What!\t You\t disbelieved\t after\t\nyou\t had\t accepted\t faith!\t Therefore\t now\t\ntaste\tthe\tpunishment,\tthe\tresult\tof\tyour\tdisbelief.”\n",
    "romanUrduTranslationText": "Jis\tdin\tkuch\tmuñh\tunjāle (raushan) hoñge\taur\tkuch\tmuñh\tkāle\tto\twoh\tjin\tke\tmuñh\tkāle\thuwe\t\nkiyā\ttum\tImān\tlākar\tkafir\thuwe\tto\tab\t‘azāb\tchakho\tapne\tkufr\tka\tbadla."
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "107",
    "arabicText": "وَأَمَّا ٱلَّذِينَ ٱبْيَضَّتْ وُجُوهُهُمْ فَفِى رَحْمَةِ ٱللَّهِ هُمْ فِيهَا خَـٰلِدُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tthose\twhose\tfaces\twill\tbe\tshining,\tare\tin\tthe\tmercy\tof\tAllah;\tthey\twill\tabide\tin\tit\tforever.\t",
    "romanUrduTranslationText": "Aur\twoh\tjin\tke\tmuñh\tunjāle (raushan) huwe\twoh\tAllah\tki\trahmat\tmeiñ\thaiñ\twoh\thamesha\tus\t\nmeiñ\traheiñ\tge\t."
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "108",
    "arabicText": "تِلْكَ ءَايَـٰتُ ٱللَّهِ نَتْلُوهَا عَلَيْكَ بِٱلْحَقِّ ۗ وَمَا ٱللَّهُ يُرِيدُ ظُلْمًۭا لِّلْعَـٰلَمِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "These\tare\tthe\tverses\tof\tAllah,\twhich\tWe\trecite\tto\tyou\t(O\tdear\tProphet\tMuhammad - peace\tand\t\nblessings\tbe\tupon\thim),\twith\ttruth;\tand\tAllah does\tnot\twish\tany\tinjustice\tto\tthe\tcreation.\t",
    "romanUrduTranslationText": "Yeh\tAllah\tki\tāyateiñ\thaiñ\tke\thum\ttheek-theek\ttum\tpar\tpardhte\thaiñ\taur\tAllah\tjahān\twāloñ\tpar\t\nzulm\tnahi\tchāhta\t"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "109",
    "arabicText": "وَلِلَّهِ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۚ وَإِلَى ٱللَّهِ تُرْجَعُ ٱلْأُمُورُ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t to\tAllah only\tbelongs\tall\twhatever\tis\t\nin\t the\t heavens\tand\tall\twhatever\tis\tin\t the\t\nearth;\t and\t towards\t Allah only\t is\t the\t\nreturn\tof\tall\tmatters.\t\t",
    "romanUrduTranslationText": "Aur\tAllah\thi\tka\thai\tjo\tkuch\tāsmānoñ\tmeiñ\t\nhai\taur\tjo\tkuch\tzameen\tmeiñ\thai\taur\tAllah\t\nhi\tki\ttaraf\tsab\tkāmoñ\tki\truju'\thai.\t"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "110",
    "arabicText": "كُنتُمْ خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ تَأْمُرُونَ بِٱلْمَعْرُوفِ وَتَنْهَوْنَ عَنِ ٱلْمُنكَرِ وَتُؤْمِنُونَ بِٱللَّهِ ۗ وَلَوْ ءَامَنَ أَهْلُ ٱلْكِتَـٰبِ لَكَانَ خَيْرًۭا لَّهُم ۚ مِّنْهُمُ ٱلْمُؤْمِنُونَ وَأَكْثَرُهُمُ ٱلْفَـٰسِقُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". You\t are\t the\t best\t among\t all\t the\t nations\t\nthat\t were\t raised\t among\t mankind\t - you\t\nenjoin\t good\t deeds\t and\t forbid\timmorality\t\nand\tyou believe\tin\tAllah;\tand\tif\tthe\tPeople\t\ngiven\t the\t Book(s)\t believed\t it\t would\t be\t\nbetter\t for\t them;\t some\t of\t them\t are\t\nbelievers\t(Muslims)\tand\tmost\tof\tthem\tare\t\ndisbelievers.\t (The\t best\t Ummah\t is\t that\t of\t\nProphet\tMuhammad - peace\t and\t blessings\t\nbe\tupon\thim.)\t",
    "romanUrduTranslationText": "Tum\t behtar\t ho\t un\t sab\tUmmatoñ\tmeiñ\tjo\t\nlogoñ\t meiñ\t zāhir\t huyiñ\t bhalāi\t ka\t hukm\t\ndete\t ho\t aur\t burāi se\t mana\t karte\t ho\t aur\t\nAllah\t par\t Imān\t rakhte\t ho\t aur\t agar\t kitābi\t\nImān\tlāte\tto\tunka\tbhalā\ttha\tun\tmeiñ\tkuch\t\nMusalman\thaiñ\taur\tziyāda\tkāfir\t"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "111",
    "arabicText": "لَن يَضُرُّوكُمْ إِلَّآ أَذًۭى ۖ وَإِن يُقَـٰتِلُوكُمْ يُوَلُّوكُمُ ٱلْأَدْبَارَ ثُمَّ لَا يُنصَرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "They\tcannot\tharm\tyou\texcept\tcause\tsome\t\ntrouble;\tand\tif\tthey\tfight\tagainst\tyou,\tthey\t\nwill\t turn\t their\t backs\t on\t you;\t then\t they\t\nwill\tnot\tbe\thelped.\t\t\t",
    "romanUrduTranslationText": "Woh\ttumhāra\tkuchh\tna\tbigādeñ\tge\tmagar\t\nyehi\t satāna\t aur\t agar\t tum\t se\t ladeiñ\t to\t\ntumhāre\t sāmne\t se\t peeth\t pher\t jāyeiñ\t ge\t\nphir\tun\tki\tmadad\tna\thogi\t"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "112",
    "arabicText": "ضُرِبَتْ عَلَيْهِمُ ٱلذِّلَّةُ أَيْنَ مَا ثُقِفُوٓا۟ إِلَّا بِحَبْلٍۢ مِّنَ ٱللَّهِ وَحَبْلٍۢ مِّنَ ٱلنَّاسِ وَبَآءُو بِغَضَبٍۢ مِّنَ ٱللَّهِ وَضُرِبَتْ عَلَيْهِمُ ٱلْمَسْكَنَةُ ۚ ذَٰلِكَ بِأَنَّهُمْ كَانُوا۟ يَكْفُرُونَ بِـَٔايَـٰتِ ٱللَّهِ وَيَقْتُلُونَ ٱلْأَنۢبِيَآءَ بِغَيْرِ حَقٍّۢ ۚ ذَٰلِكَ بِمَا عَصَوا۟ وَّكَانُوا۟ يَعْتَدُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Disgrace\t has\t been\t destined\t for\t them\t -\nwherever\t they\t are\t they\t shall\t not\t find\t\npeace,\texcept\t by\ta\t rope\t from\tAllah and\ta\t\nrope from\tmen\t- and\t they\thave\tdeserved\t\nthe\twrath\tof\tAllah,\tand\tmisery\tis\tdestined\t\nfor\t them;\t that\t is\t because\t they\t used\t to\t\ndisbelieve\t in\t the\t signs\t of\t Allah,\t and\t\nunjustly\tmartyr\tthe\tProphets;\tthat\twas\tfor\t\ntheir\tdisobedience\tand\ttransgression.\t\t\t\t",
    "romanUrduTranslationText": "Un\t par\t jama\t di\t gyi\t khuwāri jahāñ\t hoñ\t\namān\t na\t pāyeñ\t magar\t Allah\t ki\t dor\t aur\t\nādmiyoñ\t ki\t dor\t se\t aur\t ghazab-e-Ilāhi ke\t\nsaza-wār\t huwe\t aur\t un\t par\t jama\t di\t gyi\t\nmohtāji\tyeh\tis\tliye\tke\twoh\tAllah\tki\tāyatoñ\t\nse\tkufr\tkarte\taur\tPaighambaroñ\tko\tna\thaq\tshaheed\tkarte\tyeh\tis\tliye\tke\tna-farmān\tbardār\taur\t\nsarkash\tthey"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "113",
    "arabicText": "۞ لَيْسُوا۟ سَوَآءًۭ ۗ مِّنْ أَهْلِ ٱلْكِتَـٰبِ أُمَّةٌۭ قَآئِمَةٌۭ يَتْلُونَ ءَايَـٰتِ ٱللَّهِ ءَانَآءَ ٱلَّيْلِ وَهُمْ يَسْجُدُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "All\t of\t them\tare\t not alike;\tamong\t the\t People\tgiven\t the\tBook(s)\tare\t some\twho\tare\t firm\t on\t the\t\ntruth\t- they\trecite\tthe\tverses\tof\tAllah in\tthe\tnight\thours\tand\tprostrate\t(before\tHim).\t\t\t\t",
    "romanUrduTranslationText": ". Sab\tek\tse\tnahi\tkitābiyoñ\tmeiñ\tkuch\twoh\thaiñ\tke\thaq\tpar\tqāim\traheiñ\tAllah\tki\tĀyateiñ\tpadhte\t\nhaiñ\trāt\tki\tghadiyoñ\tmeiñ\taur\tSajda\tkarte\thaiñ"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "114",
    "arabicText": "يُؤْمِنُونَ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ وَيَأْمُرُونَ بِٱلْمَعْرُوفِ وَيَنْهَوْنَ عَنِ ٱلْمُنكَرِ وَيُسَـٰرِعُونَ فِى ٱلْخَيْرَٰتِ وَأُو۟لَـٰٓئِكَ مِنَ ٱلصَّـٰلِحِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "They\taccept\tfaith\tin\tAllah and\tthe\tLast\tDay,\tand\tenjoin\tgood\tdeeds\tand\tforbid\timmorality,\tand\t\nhasten\tto\tperform\tgood\tdeeds;\tand\tthey\tare\tthe\trighteous.\t\t\t\t\t",
    "romanUrduTranslationText": "Allah\taur\tpichle\tdin\tpar\t Imān\tlāte\thaiñ\taur\tbhalāi\tka\thukm\tdete\taur\tburāi\tse\tmana\tkarte\thaiñ\t\naur\tnek\tkāmoñ\tpar\tdaudte\thaiñ\taur\tyeh\tlog\tlāiq\thaiñ\t."
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "115",
    "arabicText": "وَمَا يَفْعَلُوا۟ مِنْ خَيْرٍۢ فَلَن يُكْفَرُوهُ ۗ وَٱللَّهُ عَلِيمٌۢ بِٱلْمُتَّقِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tthey\twill\tnot\tbe\tdenied\tthe\treward\tof\twhatever\tgood\tthey\tdo;\tand\tAllah knows\tthe\tpious.\t\t\t\t\t\t",
    "romanUrduTranslationText": "Aur\twoh\tjo\tbhalāi\tkareiñ\tun\tka\thaq\tna\tmāra\tjāye\tga\taur\tAllah\tko\tma'loom\thaiñ\tdar\twāle"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "116",
    "arabicText": "إِنَّ ٱلَّذِينَ كَفَرُوا۟ لَن تُغْنِىَ عَنْهُمْ أَمْوَٰلُهُمْ وَلَآ أَوْلَـٰدُهُم مِّنَ ٱللَّهِ شَيْـًۭٔا ۖ وَأُو۟لَـٰٓئِكَ أَصْحَـٰبُ ٱلنَّارِ ۚ هُمْ فِيهَا خَـٰلِدُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Indeed\t those\t who\t disbelieve\t - neither\t\ntheir\t wealth\t nor\t their\t offspring\t will\t help\t\nsave\t them\t in\t the\t least,\t from\t Allah;\t and\t\nthey\tare\tthe\tpeople\tof\tfire;\tremaining\tin\tit\t\nforever\t\t\t\t\t\t",
    "romanUrduTranslationText": "Woh\tjo\tkāfir\thuwe\tun\tke\tmāl\taur\taulād\tun\t\nko\tAllah\tse\tkuch\tna\tbachāyeñ\tge\taur\twoh\t\nJahannami\t haiñ\t un\t ko\t hameshā\t us\t meiñ\t\nrahna\t"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "117",
    "arabicText": "مَثَلُ مَا يُنفِقُونَ فِى هَـٰذِهِ ٱلْحَيَوٰةِ ٱلدُّنْيَا كَمَثَلِ رِيحٍۢ فِيهَا صِرٌّ أَصَابَتْ حَرْثَ قَوْمٍۢ ظَلَمُوٓا۟ أَنفُسَهُمْ فَأَهْلَكَتْهُ ۚ وَمَا ظَلَمَهُمُ ٱللَّهُ وَلَـٰكِنْ أَنفُسَهُمْ يَظْلِمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "The\t example\t of\t what\t they\t spend\t in\t this\t\nworldly\tlife\tis\tsimilar\t to\t the\t freezing\tcold\t\nwind\t which\t struck\t the\t fields\t of\t a\t nation\t\nwho\t wronged\t themselves,\t and\t destroyed\t\nit\t completely;\t and\t Allah did\t not oppress\t\nthem,\t but\t it\t is\t they\t who\t wronged\t\nthemselves\t\t\t\t\t\t",
    "romanUrduTranslationText": "Kahawat\tuski\tjo\tis\tduniya\tki\tzindagi\tmeiñ\t\nkharch\t karte\t haiñ\t us\t hawa\t ki\t si\t hai\t jis\t\nmeiñ\t pālā\t ho\t woh\t ek\t aisi\t qaum\t ki\t kheti\t\npar\tpadi\tjo\tapna\thi\tbura\tkarte\tthey\tto\tusey\t\nbilkul\tmār\tgayi\taur\tAllah\t ne\t un\t par\t zulm\t\nna\t kiya\t hāñ\twoh\t khud\t apni\tjān\t par\t zulm\t\nkarte\thaiñ"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "118",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَتَّخِذُوا۟ بِطَانَةًۭ مِّن دُونِكُمْ لَا يَأْلُونَكُمْ خَبَالًۭا وَدُّوا۟ مَا عَنِتُّمْ قَدْ بَدَتِ ٱلْبَغْضَآءُ مِنْ أَفْوَٰهِهِمْ وَمَا تُخْفِى صُدُورُهُمْ أَكْبَرُ ۚ قَدْ بَيَّنَّا لَكُمُ ٱلْـَٔايَـٰتِ ۖ إِن كُنتُمْ تَعْقِلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "O\tPeople\twho\tBelieve!\tDo\tnot\tshare\tyour\t\nsecrets\twith\tothers\t- they\tdo\tall\t they\tcan\t\nto\t ruin\t you;\t they\t desire\t the\t maximum\t\nharm\t for\t you;\t enmity\t has\t been\t revealed\t\nfrom\t their\t speech,\tand\twhat\t they\t hide\tin\t\ntheir\t breasts\t is\t greater;\t we\t have\t\nexplained\t the\t signs\t clearly\t to\t you,\t if\t you\t\nhave\tintelligence.\t\t\t\t",
    "romanUrduTranslationText": "Aey\t Imān\t wālo!\tGhairoñ\t ko\t apna\t rāz-dār\t\t\nna\tbanāo\twoh\ttumhāri\tburāi\tmeiñ\t(kami)\t\nnahi\tkarte\tun\tki\tārzu\thai\tjitni\tiza\ttumheiñ\t\npahuñche\t bair\t (bughz)\t un\t ki\t bātoñ\t se\t\njhalak\t utha\t aur\t woh\t jo\t seene\t meiñ\t\nchhupāye\t haiñ\t aur\t bada\t hai\t ham\t ne\t\nnishāniyāñ\t tumheiñ\t khol\t kar\t suna\t \t deiñ\t\nagar\ttumheiñ\taql\tho."
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "119",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَتَّخِذُوا۟ بِطَانَةًۭ مِّن دُونِكُمْ لَا يَأْلُونَكُمْ خَبَالًۭا وَدُّوا۟ مَا عَنِتُّمْ قَدْ بَدَتِ ٱلْبَغْضَآءُ مِنْ أَفْوَٰهِهِمْ وَمَا تُخْفِى صُدُورُهُمْ أَكْبَرُ ۚ قَدْ بَيَّنَّا لَكُمُ ٱلْـَٔايَـٰتِ ۖ إِن كُنتُمْ تَعْقِلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Listen!\t It\tis\t you\t who\tlove\t them\t and\t they\t\ndo\t not\t love\t you,\t whereas\t the\t fact\t is\t that\t\nyou\t believe\t in\t all\t the\t Books;\t when\t they\t\nmeet\t you\t they\t say,\t “We\t believe”;\t and\nwhen\t they\t are\t alone\t they\t chew\t their\t\nfingers\tat\tyou\twith\trage;\tsay,\t“Die\tin\tyour\t\nfrenzy!”\tAllah knows\twell\twhat\tlies\twithin\t\nthe\thearts\t\t\t\t",
    "romanUrduTranslationText": "Sunte\t ho!\t Yeh\t jo\t tum\t ho,\t tum\t to\t unheiñ\t\nchāhte\t ho\t aur\t woh\t tumheiñ\t nahi\t chāhte\t\naur\thāl\t yeh\tke\t tum\tsab\tkitāboñ\tpar\t Imān\t\nlāte\t ho\t aur\t woh\t jab\t tum\t se\t milte\t haiñ\t\nkehte\t haiñ\t ham\t Imān\t lāye\t aur\t akele\t hoñ\t\nto\t tum\t par\t ungliyāñ\t chabayeiñ\tghusse\t se\t\ntum\t farmado\t ke\t mar\t jāo\t apni\t ghutan\t\n(Qalbi\tjalan)\tmeiñ\tAllah\tkhoob\tjānta\thai\tdiloñ\tki\tbāt."
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "120",
    "arabicText": "إِن تَمْسَسْكُمْ حَسَنَةٌۭ تَسُؤْهُمْ وَإِن تُصِبْكُمْ سَيِّئَةٌۭ يَفْرَحُوا۟ بِهَا ۖ وَإِن تَصْبِرُوا۟ وَتَتَّقُوا۟ لَا يَضُرُّكُمْ كَيْدُهُمْ شَيْـًٔا ۗ إِنَّ ٱللَّهَ بِمَا يَعْمَلُونَ مُحِيطٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "If\t some\t good\t reaches\t you,\t they\t feel\t\nunhappy;\t and\t if\t misfortune\t befalls\t you,\t\nthey\twill\trejoice;\tand\tif\tyou\tremain\tsteadfast\tand\tpious,\ttheir\tevil\tscheme\twill\tnot\tharm\tyou\tin\t\nthe\tleast;\tundoubtedly\tall\twhat\tthey\tdo\tis\tencompassed\tby\tAllah.\t\t\t\t",
    "romanUrduTranslationText": ". Tumheiñ\tkoi\tbhalāi\tpahoñche\tto\tunheiñ\tbura\tlage\taur\ttum\tko\tburāi\tpahuñche\tto\tus\tpar\tkhush\t\nhoñ\taur\tagar\t tum\t sabr\taur\t parhez-gāri\t kiye\t raho\t to\t un\t ka\t dāoñ\t tumhāra\t kuchh\t na\t bigāde\tga\t\nbeshak\tun\tke\tsab\tkām\tKhuda\tke\tghere\tmeiñ\thaiñ\t"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "121",
    "arabicText": "وَإِذْ غَدَوْتَ مِنْ أَهْلِكَ تُبَوِّئُ ٱلْمُؤْمِنِينَ مَقَـٰعِدَ لِلْقِتَالِ ۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tremember\tO\tdear\tProphet\t(Muhammad - peace\tand\tblessings\tbe\tupon\thim)\twhen\tyou\tcame\t\nforth\tfrom\tyour\thouse\tin\tthe\tmorning,\tappointing\tthe\tbelievers\ton\tpositions\tof\tbattle;\tand\tAllah\nis\tAll\tHearing,\tAll\tKnowing.\t\t\t\t",
    "romanUrduTranslationText": "Aur\t yād\t karo\t aey\t Mehboob!\t Jab\t tum\t subah\t ko\t apne\t daulat\t khāne\t se\t bar-āmad\t huwe\t\nMusalmānoñ\tko\tladāi\tke\tmorchoñ\tpar\tqāim\tkarte\taur\tAllah\tsunta\tjānta\thai."
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "122",
    "arabicText": "إِذْ هَمَّت طَّآئِفَتَانِ مِنكُمْ أَن تَفْشَلَا وَٱللَّهُ وَلِيُّهُمَا ۗ وَعَلَى ٱللَّهِ فَلْيَتَوَكَّلِ ٱلْمُؤْمِنُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "When\t two\t groups\t among\t you\t almost\t\ndecided\t to\tshow\tcowardice\t- and\tAllah is\t\ntheir\t Protector;\t and\t in\tAllah only\t should\t\nthe\tbelievers\ttrust.\t\t\t\t",
    "romanUrduTranslationText": "Jab\t tum\t meiñ\t ke\t do\t girohoñ\t ka\t irāda\t\nhuwa\t ke\t na-mardi\t kar\t jāyeiñ\t aur\t Allah\t\nunka\t sambhālne\t wāla\t hai\t aur\t\nMusalmānoñ\t ko\t Allah\t hi\t par\t bharosa\t\nchāhiye."
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "123",
    "arabicText": "وَلَقَدْ نَصَرَكُمُ ٱللَّهُ بِبَدْرٍۢ وَأَنتُمْ أَذِلَّةٌۭ ۖ فَٱتَّقُوا۟ ٱللَّهَ لَعَلَّكُمْ تَشْكُرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Allah indeed\taided\tyou\tat\tBadr\twhen\tyou\t\nhad\tno\tmeans;\tso\t fear\tAllah - so\t that\tyou\t\nmay\tbe\tthankful.\t\t\t\t",
    "romanUrduTranslationText": "Aur\t beshak\t Allah\t ne\t badr\t meiñ\t tumhāri\t\nmadad\t ki\t jab\t tum\t bilkul\t be\t saro\t sāman\t\nthey\t to\tAllah\tse\tdaro\tke\tkahiñ\t tum\tshukr\t\nguzār\tho."
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "124",
    "arabicText": "إِذْ تَقُولُ لِلْمُؤْمِنِينَ أَلَن يَكْفِيَكُمْ أَن يُمِدَّكُمْ رَبُّكُم بِثَلَـٰثَةِ ءَالَـٰفٍۢ مِّنَ ٱلْمَلَـٰٓئِكَةِ مُنزَلِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "When\t you\t O\t dear\t Prophet\t(Muhammad -\npeace\t and\t blessings\t be\t upon\t him)\t said\t to\t\nthe\t believers,\t “Is\t it\t not\t sufficient\t for\t you\t\nthat\t your\t Lord\t may\t support\t you\t by\t\nsending\tdown\tthree\tthousand\tangels?”\t",
    "romanUrduTranslationText": "Jab\t aey\t Mehboob!\t Tum\t Musalmānoñ\t se\t\nfarmāte\t they\t kiya\t tumheiñ\t yeh\t kāfi\t nahi\t\nke\ttumhāra\tRab\ttumhāri\tmadad\tkare\tteen\t\nhazār\tFarishte\tutār\tkar\t"
  },
  {
    "juz": {
      "id": "4"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "125",
    "arabicText": "بَلَىٰٓ ۚ إِن تَصْبِرُوا۟ وَتَتَّقُوا۟ وَيَأْتُوكُم مِّن فَوْرِهِمْ هَـٰذَا يُمْدِدْكُمْ رَبُّكُم بِخَمْسَةِ ءَالَـٰفٍۢ مِّنَ ٱلْمَلَـٰٓئِكَةِ مُسَوِّمِينَ",
    "urduTranslationText": "",
    "englishTranslationText": ". Yes,\twhy\tnot?\tIf\tyou\tpatiently\tendure\tand\t\nremain\tpious,\tand\t the\tdisbelievers\tattack\t\nyou\t suddenly,\t your\t Lord\t will\t send\t down\t\nfive\tthousand\tmarked\tangels\tto\thelp\tyou.\t\t",
    "romanUrduTranslationText": "Hāñ\t kiyuñ\t nahi,\t agar\t tum\t sabr-o-taqwa\t\nkaro\taur\tkāfir\tusi\tdam\ttum\tpar\tā padeiñ\tto\t\ntumhāra\t Rab\t tumāri\t madad\t ko\t pāñch\t\nhazār\tFirishtey\tnishān\twāle\tbheje\tga\t"
  }
]