[
  {
    "juz": {
      "id": "12"
    },
    "surah": {
      "id": "11"
    },
    "ayatNumber": "46",
    "arabicText": "قَالَ يَـٰنُوحُ إِنَّهُۥ لَيْسَ مِنْ أَهْلِكَ ۖ إِنَّهُۥ عَمَلٌ غَيْرُ صَـٰلِحٍۢ ۖ فَلَا تَسْـَٔلْنِ مَا لَيْسَ لَكَ بِهِۦ عِلْمٌ ۖ إِنِّىٓ أَعِظُكَ أَن تَكُونَ مِنَ ٱلْجَـٰهِلِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "He\tsaid,\t“O\tNooh,\the\tis\tnot\tof\tyour\tfamily;\t\nhis\tdeeds\tare\tmost\timproper;\ttherefore\tdo\t\nnot\t ask\t Me\t a\t thing\t of\t which\t you\t do\t not\t\nhave\t knowledge;\t I\t advise\t you\t not\t to\t be\t\nunwise.”",
    "romanUrduTranslationText": "Farmāyā\t aey\t Nūh!\t Woh\t tere\t ghar\t wāloñ\t\nmeiñ\t nahiñ\t be-shak us\t ke\t kām\t bade\t na\t\nlāiq\t haiñ\t to\tmujh\t se\twoh\t bāt\t na\tmang\tjis\t\nka\t tujhe\t ‘ilm\t nahiñ\t maiñ\t tujhe\t nasihat\t\nfarmātā\thooñ\tke\tnādān\tna\tban."
  },
  {
    "juz": {
      "id": "12"
    },
    "surah": {
      "id": "11"
    },
    "ayatNumber": "47",
    "arabicText": "قَالَ رَبِّ إِنِّىٓ أَعُوذُ بِكَ أَنْ أَسْـَٔلَكَ مَا لَيْسَ لِى بِهِۦ عِلْمٌۭ ۖ وَإِلَّا تَغْفِرْ لِى وَتَرْحَمْنِىٓ أَكُن مِّنَ ٱلْخَـٰسِرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "He\t submitted,\t “My\t Lord!\t I\t seek\t your\t\nrefuge\tfrom\tasking\tyou\tthe\tthing\tof\twhich\t\nI\t do\t not\t have\t knowledge;\t and\t if\t You\t do\t\nnot\tforgive\tme\tand\tdo\tnot\thave mercy\ton\t\nme,\tI\twould\tthen\tbe\ta\tloser.”\t",
    "romanUrduTranslationText": "Árz\t ki\t aey\t Rab\t mere\t maiñ\t teri\t panāh\t\nchāhtā\thooñ\tke\ttujh\tse\twoh\tchiz\tmañgooñ\t\njis\tka\tmujhe\t‘ilm\tnahiñ\taur\tagar\t tu\tmujhe\t\nna\t bakhshe\t aur\t rahem\t na\t kare\t to\t maiñ\t\nziyāñ\t kār\t (nuqsān\t uthāne\t wāla)\t ho\t\njāooñga"
  },
  {
    "juz": {
      "id": "12"
    },
    "surah": {
      "id": "11"
    },
    "ayatNumber": "48",
    "arabicText": "قِيلَ يَـٰنُوحُ ٱهْبِطْ بِسَلَـٰمٍۢ مِّنَّا وَبَرَكَـٰتٍ عَلَيْكَ وَعَلَىٰٓ أُمَمٍۢ مِّمَّن مَّعَكَ ۚ وَأُمَمٌۭ سَنُمَتِّعُهُمْ ثُمَّ يَمَسُّهُم مِّنَّا عَذَابٌ أَلِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "It\twas\tsaid,\t“O\tNooh!\tAlight\tfrom\tthe\tship\t\nalong\t with\t peace\t from\t Us\t and\t the\t\nblessings\t that\t are\t upon\t you\t and\t upon\t\nsome\tgroups\tthat\tare\twith\tyou;\tand\tsome\t\ngroups\tare\tthose\twhom\tWe\tshall\tlet\tenjoy\t\nthis\tworld\tand\tthen a\tpainful\tpunishment\t\nfrom\tUs\twill\treach\tthem.”\t",
    "romanUrduTranslationText": "Farmāyā\t gayā\t aey\t Nūh!\t Kashti\t se\t utar\t\nhamāri\t taraf\t se\t salām\t aur\t barkatoñ\t ke\t\nsāth\t jo\t tujh\t par\t haiñ\t aur\t tere\t sāth\t ke\t\nkuchh\t \t girohoñ\t par\t aur\t kuchh\t giroh\t woh\t\nhaiñ\t jinheiñ\t ham\t duniyā\t baratne\t deñ\t ge\t\nphir\tunheiñ\thamāri\ttaraf\tse\tdard-nāk\tázāb\t\npahuñche\tga"
  },
  {
    "juz": {
      "id": "12"
    },
    "surah": {
      "id": "11"
    },
    "ayatNumber": "49",
    "arabicText": "تِلْكَ مِنْ أَنۢبَآءِ ٱلْغَيْبِ نُوحِيهَآ إِلَيْكَ ۖ مَا كُنتَ تَعْلَمُهَآ أَنتَ وَلَا قَوْمُكَ مِن قَبْلِ هَـٰذَا ۖ فَٱصْبِرْ ۖ إِنَّ ٱلْعَـٰقِبَةَ لِلْمُتَّقِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "These\tare\tthe\ttidings\tof\tthe\thidden,\twhich\t\nWe\t reveal\t to\t you\t (O\t dear\t Prophet\t\nMuhammad - peace\tand\tblessings\tbe\tupon\t\nhim);\tyou\tdid\tnot\tknow\tthem\tnor\tdid\tyour\t\npeople,\t before\t this;\t therefore\t patiently\t\nendure;\tindeed\tthe\texcellent\tfate\tis\tfor\tthe\t\npious.\t",
    "romanUrduTranslationText": "Yeh\tghaib\tki\tkhabreñ\thaiñ\tke\tham\ttumhāri\t\ntaraf\twaḥi\tkarte\thaiñ\tunheiñ\tna\ttum\tjānte\t\nthe\t na\t tumhāri\t qaum\t is\t se\t pehle\t to\t sabr\t\nkaro\tbe-shak\t\tbhalā\tanjām\tparhezgāroñ\tka"
  },
  {
    "juz": {
      "id": "12"
    },
    "surah": {
      "id": "11"
    },
    "ayatNumber": "50",
    "arabicText": "وَإِلَىٰ عَادٍ أَخَاهُمْ هُودًۭا ۚ قَالَ يَـٰقَوْمِ ٱعْبُدُوا۟ ٱللَّهَ مَا لَكُم مِّنْ إِلَـٰهٍ غَيْرُهُۥٓ ۖ إِنْ أَنتُمْ إِلَّا مُفْتَرُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t towards\t the\t people\t of\t A’ad,\t their\t\nfellow\t man\t Hud;\t he\t said,\t “O\t my\t people!\t\nWorship\t Allah - there\t is\t no\t other\t True\t\nGod\t except\t Him;\t you\t are\t purely\t\nfabricators.”",
    "romanUrduTranslationText": "Aur\t‘Āad\tki\ttaraf\tun\tke\tham\tqaum\tHood\tko\t\nkahā\taey\tmeri\tqaum!\tAllāh\tko\tpoojo\tus\tke\t\nsiwā\t tumhārā\t koi\t m’abood\t nahiñ\t tum\t to\t\nnire\t muftari\t (bilkul\t jhoote\t ilzām\t ‘āaid\t\nkarne\twāle)\tho"
  },
  {
    "juz": {
      "id": "12"
    },
    "surah": {
      "id": "11"
    },
    "ayatNumber": "51",
    "arabicText": "يَـٰقَوْمِ لَآ أَسْـَٔلُكُمْ عَلَيْهِ أَجْرًا ۖ إِنْ أَجْرِىَ إِلَّا عَلَى ٱلَّذِى فَطَرَنِىٓ ۚ أَفَلَا تَعْقِلُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "“O\tmy\tpeople!\tI\tdo\tnot\task\tany\tfee\tfrom\tyou\tfor\tit; my\treward\tis\tonly\tupon\tHim\tWho\thas\tcreated\t\nme;\tso\tdo\tyou\tnot\thave\tsense?”\t",
    "romanUrduTranslationText": "Aey\tqaum!\tMaiñ\tis\tpar\ttum\tse\tkuchh\tujrat\tnahiñ\tmāñgtā\tmeri\tmazdoori\tto\tusi ke\tzimme\thai\tjis\t\nne\tmujhe\tpaidā\tkiya\tto\tkya\ttumheñ\taql\tnahiñ"
  },
  {
    "juz": {
      "id": "12"
    },
    "surah": {
      "id": "11"
    },
    "ayatNumber": "52",
    "arabicText": "وَيَـٰقَوْمِ ٱسْتَغْفِرُوا۟ رَبَّكُمْ ثُمَّ تُوبُوٓا۟ إِلَيْهِ يُرْسِلِ ٱلسَّمَآءَ عَلَيْكُم مِّدْرَارًۭا وَيَزِدْكُمْ قُوَّةً إِلَىٰ قُوَّتِكُمْ وَلَا تَتَوَلَّوْا۟ مُجْرِمِينَ",
    "urduTranslationText": "",
    "englishTranslationText": ". “And\tO\tmy\tpeople!\tSeek\tforgiveness\tfrom\tyour\tLord,\tthen\tincline\ttowards\tHim\tin\trepentance\t-\nHe\twill\tsend\tabundant\train\tfrom\tthe\tsky\tupon\tyou\tand\twill\tgive\tyou\tmuch\tmore\tstrength\tthan\t\nyou\thave\t- and\tdo\tnot\tturn\taway\tcommitting\tcrimes!”",
    "romanUrduTranslationText": "Aur\taey\tmeri\tqaum!\tApne\tRab\tse\tmu’aāfi\tchāho\tphir\tus\tki\ttaraf\t\truju’\tlāo\ttum\tpar\tzor\tka\tpani\t\nbheje\tga\taur\ttum\tmeiñ\tjitni\tquwwat\thai\tus\tse\taur\tziyada\tdega\taur\tjurm\tkarte\thuye\troo\tgardāni\t\nna\tkaro"
  },
  {
    "juz": {
      "id": "12"
    },
    "surah": {
      "id": "11"
    },
    "ayatNumber": "53",
    "arabicText": "قَالُوا۟ يَـٰهُودُ مَا جِئْتَنَا بِبَيِّنَةٍۢ وَمَا نَحْنُ بِتَارِكِىٓ ءَالِهَتِنَا عَن قَوْلِكَ وَمَا نَحْنُ لَكَ بِمُؤْمِنِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "They\tsaid,\t“O\tHud!\tYou\thave\tnot\tcome\tto\tus\twith\tany\tproof\tand\twe\twill\tnot\tforsake\tour\tdeities\t\nupon\tyour\tsaying,\tnor\twill\twe\tbelieve\tyou.”\t",
    "romanUrduTranslationText": "Bole\t aey\tHood\t tum\t koi\t dalil\tlekar\t hamāre\t pās\t na\t āye\t aur\t ham\t khāli\t tumhāre\t kahne\t se\t apne\t\nkhudāoñ\tko\tchhodne\tke\tnahiñ\tna\ttumhāri\tbāt\tpar\tyaqeen\tlāyeñ."
  },
  {
    "juz": {
      "id": "12"
    },
    "surah": {
      "id": "11"
    },
    "ayatNumber": "54",
    "arabicText": "إِن نَّقُولُ إِلَّا ٱعْتَرَىٰكَ بَعْضُ ءَالِهَتِنَا بِسُوٓءٍۢ ۗ قَالَ إِنِّىٓ أُشْهِدُ ٱللَّهَ وَٱشْهَدُوٓا۟ أَنِّى بَرِىٓءٌۭ مِّمَّا تُشْرِكُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "“We\tonly\tsay\tthat\tyou\thave\tbeen\tseverely\t\nstruck\t by\t one\t of\t our\t deities”;\t he\t said,\t “I\t\nmake\t Allah a\t witness,\t and\t you\t all\t bear\t\nwitness\t that\t I\t have\t no\t relation\t with\t\nwhatever\t you\t ascribe\t (as\t partners\t to\t\nAllah)”-",
    "romanUrduTranslationText": "Hum\t to\t yahi\t kahte\t haiñ\t ke\t hamāre\t kisi\t\nkhudā\t ki\t tumheñ\t buri\t jhapat\t (pakad)\t\npahuñchi\tkahā\tmaiñ\tAllāh\tko\tgawāh\tkartā\t\nhooñ\t aur\t tum\t sab\t gawāh\t ho\t jāo\t ke\t maiñ\t\nbezār\thooñ\tun\tsab\tse\tjinheiñ\ttum\tAllāh\tke\t\nsiwā\tus\tka\tsharik\tthahrāte\tho."
  },
  {
    "juz": {
      "id": "12"
    },
    "surah": {
      "id": "11"
    },
    "ayatNumber": "55",
    "arabicText": "مِن دُونِهِۦ ۖ فَكِيدُونِى جَمِيعًۭا ثُمَّ لَا تُنظِرُونِ",
    "urduTranslationText": "",
    "englishTranslationText": "“Besides\tHim\t- therefore\tall\tof\tyou\tscheme\t\nagainst\tme\tand\tdo\tnot\tgive\tme\trespite.”",
    "romanUrduTranslationText": "Tum\t sab\t mil\t kar\t merā\t burā\t chāho\t phir\t\nmujhe\tmohlat\tna\tdo"
  },
  {
    "juz": {
      "id": "12"
    },
    "surah": {
      "id": "11"
    },
    "ayatNumber": "56",
    "arabicText": "إِنِّى تَوَكَّلْتُ عَلَى ٱللَّهِ رَبِّى وَرَبِّكُم ۚ مَّا مِن دَآبَّةٍ إِلَّا هُوَ ءَاخِذٌۢ بِنَاصِيَتِهَآ ۚ إِنَّ رَبِّى عَلَىٰ صِرَٰطٍۢ مُّسْتَقِيمٍۢ",
    "urduTranslationText": "",
    "englishTranslationText": "“I\t rely\t upon\t Allah,\t Who\t is\t my\t Lord\t and\t\nyour\t Lord;\t there\t is\t not\t a\t creature\t that\t\nwalks,\t whose\t forelock\t is\t not\t in\t His\t\ncontrol;\tindeed\tmy\t Lord\tcan\tbe\t found\t on\t\nthe\tStraight\tPath.”\t",
    "romanUrduTranslationText": "Maiñ\t ne\t Allāh\t par\t bharosā\t kiya\t jo\t merā\t\nrab\thai\taur\ttumhārā\tRab,\tkoi\tchalne\t\twāla\t\nnahiñ\t jis\t ki\t choti\t us\t ke\t qabza-e-qudrat\t\nmeiñ\tna\tho\tbe-shak\t\tmerā\trab\tsidhe\trāste\t\npar\tmiltā\thai"
  },
  {
    "juz": {
      "id": "12"
    },
    "surah": {
      "id": "11"
    },
    "ayatNumber": "57",
    "arabicText": "فَإِن تَوَلَّوْا۟ فَقَدْ أَبْلَغْتُكُم مَّآ أُرْسِلْتُ بِهِۦٓ إِلَيْكُمْ ۚ وَيَسْتَخْلِفُ رَبِّى قَوْمًا غَيْرَكُمْ وَلَا تَضُرُّونَهُۥ شَيْـًٔا ۚ إِنَّ رَبِّى عَلَىٰ كُلِّ شَىْءٍ حَفِيظٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "“Then\t if\t you\t turn\t away,\t I\t have\t conveyed\t\nto\tyou\twhat\tI\twas\tsent\twith\ttowards\tyou;\t\nand\t my\t Lord\t will\t bring\t others\t in\t your\t\nstead;\t and\t you\t will\t not\t be\t able\t to\t cause\t\nHim\t any\t harm;\t indeed\t my\t Lord\t is\t a\t\nGuardian\tover\tall\tthings.”\t",
    "romanUrduTranslationText": "Phir\t agar\t tum\t muñh\t phero\t to\t maiñ\t\ntumheiñ\tpahuñchā\tchukā\tjo\ttumhāri\ttaraf\t\t\nlekar\t bhejā\t gayā\t aur\t merā\t rab\t tumhāri\t\njagah\t auroñ\t ko\t le āaye\t ga\t aur\t tum\t us\t ka\t\nkuchh\t\tna\tbigād\tsakoge\tbe-shak\t\tmerā\trab\t\nhar\tshey\tpar\tnigehbān\thai"
  },
  {
    "juz": {
      "id": "12"
    },
    "surah": {
      "id": "11"
    },
    "ayatNumber": "58",
    "arabicText": "وَلَمَّا جَآءَ أَمْرُنَا نَجَّيْنَا هُودًۭا وَٱلَّذِينَ ءَامَنُوا۟ مَعَهُۥ بِرَحْمَةٍۢ مِّنَّا وَنَجَّيْنَـٰهُم مِّنْ عَذَابٍ غَلِيظٍۢ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t when\t Our\t command\t came,\t We\t\nrescued\t Hud\t and\t the\t Muslims\t who\t were\t\nwith\t him,\t by\t Our\t mercy;\t and\t We\t saved\t\nthem\tfrom\ta\tsevere\tpunishment.\t",
    "romanUrduTranslationText": ". Aur\t jab\tHamārā\t ḥukm\t āyā\tHam\t ne\tHood\naur\t us\t ke\t sāth\t ke\t Musalmānoñ\t ko\t apni\t\nraḥmat farmā\t kar\t bachā\t liyā\t aur\t unheiñ\t\nsakht\t‘aƶāb\tse\tnajāt\tdi"
  },
  {
    "juz": {
      "id": "12"
    },
    "surah": {
      "id": "11"
    },
    "ayatNumber": "59",
    "arabicText": "وَتِلْكَ عَادٌۭ ۖ جَحَدُوا۟ بِـَٔايَـٰتِ رَبِّهِمْ وَعَصَوْا۟ رُسُلَهُۥ وَٱتَّبَعُوٓا۟ أَمْرَ كُلِّ جَبَّارٍ عَنِيدٍۢ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t these\t are\t the\t A’ad\t- they\t denied\t the\t\nsigns\t of\t their\t Lord\t and\t disobeyed\t His\t\nNoble\t Messengers\t and\t followed\t the\t\ncommands\tof\tevery\tstubborn\tdisobedient.\t",
    "romanUrduTranslationText": "Aur\t yeh\t haiñ\t ke\t apne\t Rab\t ki\t Āyatoñ\t se\t\nmunkir\t huye\t aur\t us\t ke\t Rasooloñ\t ki\t nā\t\nfarmāni\t ki\t aur\t har\t bade\t sarkash\t hat\t\ndharam\tke\tkahne\tpar\tchale"
  },
  {
    "juz": {
      "id": "12"
    },
    "surah": {
      "id": "11"
    },
    "ayatNumber": "60",
    "arabicText": "وَأُتْبِعُوا۟ فِى هَـٰذِهِ ٱلدُّنْيَا لَعْنَةًۭ وَيَوْمَ ٱلْقِيَـٰمَةِ ۗ أَلَآ إِنَّ عَادًۭا كَفَرُوا۟ رَبَّهُمْ ۗ أَلَا بُعْدًۭا لِّعَادٍۢ قَوْمِ هُودٍۢ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t a\t curse\t followed\t them\t in\t the\t world,\t\nand\t on\t the\t Day\t of\t Resurrection;\t pay\t heed!\t Indeed\t A’ad\t disbelieved\tin\t their\t Lord;\t away\t with\t\nA’ad,\tthe\tpeople\tof\tHud!\t",
    "romanUrduTranslationText": "Aur\tun\t ke\tpiche\tlagi\tis\tdunyā\tmeiñ\tl’anat\t\naur\tqayāmat\tke\tdin\tsun\tlo\tbe-shak\t‘apne\tRab\tse\tmunkir\thuye\taray door\thoñ\t‘Āad Hood ki\tqaum."
  },
  {
    "juz": {
      "id": "12"
    },
    "surah": {
      "id": "11"
    },
    "ayatNumber": "61",
    "arabicText": "۞ وَإِلَىٰ ثَمُودَ أَخَاهُمْ صَـٰلِحًۭا ۚ قَالَ يَـٰقَوْمِ ٱعْبُدُوا۟ ٱللَّهَ مَا لَكُم مِّنْ إِلَـٰهٍ غَيْرُهُۥ ۖ هُوَ أَنشَأَكُم مِّنَ ٱلْأَرْضِ وَٱسْتَعْمَرَكُمْ فِيهَا فَٱسْتَغْفِرُوهُ ثُمَّ تُوبُوٓا۟ إِلَيْهِ ۚ إِنَّ رَبِّى قَرِيبٌۭ مُّجِيبٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tto\tthe\tThamud\ttribe,\tWe\tsent\ttheir\tfellow\tman\tSaleh;\the\tsaid,\t“O\tmy\tpeople!\tWorship\tAllah,\t\nthere\tis\tno\tother\tTrue\tGod\texcept\tHim;\tHe\tcreated\tyou\tfrom\tthe\tearth\tand\testablished\tyou\tin\tit,\t\nso\tseek\tforgiveness\tfrom\tHim\tand\tincline\ttowards\tHim\tin\trepentance;\tindeed\tmy\tLord\tis\tClose,\t\nAcceptor\tof\tPrayer.”\t\t",
    "romanUrduTranslationText": "Aur\t Samood ki\t taraf\t un\t ke\t ham\t qaum\t ko\t kahā:\t aey\t meri\t qaum!\t Allāh\t ko\t poojo\t us\t ke\t siwā\t\ntumhārā\tkoi\tm’abood\tnahiñ\tus\tne\ttumheiñ\tzameen\tse\tpaidā\tkiya\taur\tis\tmeiñ\ttumheiñ\tbasāyā\tto\t\nus\tse\tmu’āfi\tchāho\tphir\tus\tki\ttaraf\truju’\tlāo\tbe-shak\t\tmerā\trab\tqarib\thai\tdu’ā\tsun\tne\t\twāla."
  },
  {
    "juz": {
      "id": "12"
    },
    "surah": {
      "id": "11"
    },
    "ayatNumber": "62",
    "arabicText": "قَالُوا۟ يَـٰصَـٰلِحُ قَدْ كُنتَ فِينَا مَرْجُوًّۭا قَبْلَ هَـٰذَآ ۖ أَتَنْهَىٰنَآ أَن نَّعْبُدَ مَا يَعْبُدُ ءَابَآؤُنَا وَإِنَّنَا لَفِى شَكٍّۢ مِّمَّا تَدْعُونَآ إِلَيْهِ مُرِيبٍۢ",
    "urduTranslationText": "",
    "englishTranslationText": "They\tsaid,\t “O\tSaleh!\tYou\tseemed\t very\tpromising\tamong\tus,\tbefore\t this\t- What!\tYou\t forbid\tus\t\nfrom\t worshipping\t the\t deities\t of\t our\t forefathers?\t And\t indeed\t we\t have\t fallen\t into\t a\t deeply\t\nintriguing\tdoubt\tconcerning\twhat\tyou\tcall\tus\tto.”\t\t",
    "romanUrduTranslationText": "Aey\tSuāleh!\tIs\tse\tpehle\tto\ttum\tham\tmeiñ\thonhār\tm’aloom\thote\tthe\tkya\ttum\thameñ\tis\tse\tman’a\t\nkarte\tho\tke\tapne\tbāp\tdādā\tke\tm’aboodoñ\tko\tpoojeñ\taur\tbe-shak\t\tjis\tbāt\tki\ttaraf\thameñ\tbulāte\tho\t\nus\tse\tek\tbade\tdhoka\tdālne\twāle\tshak\tmeiñ\thaiñ"
  },
  {
    "juz": {
      "id": "12"
    },
    "surah": {
      "id": "11"
    },
    "ayatNumber": "63",
    "arabicText": "قَالَ يَـٰقَوْمِ أَرَءَيْتُمْ إِن كُنتُ عَلَىٰ بَيِّنَةٍۢ مِّن رَّبِّى وَءَاتَىٰنِى مِنْهُ رَحْمَةًۭ فَمَن يَنصُرُنِى مِنَ ٱللَّهِ إِنْ عَصَيْتُهُۥ ۖ فَمَا تَزِيدُونَنِى غَيْرَ تَخْسِيرٍۢ",
    "urduTranslationText": "",
    "englishTranslationText": "He\t said,\t “O\t my\t people!\t What\t is\t your\t\nopinion\t- if\t I\t am\t on\t clear\t proof\t from\t my\t\nLord\t and\t He\t has\t bestowed\t upon\t me\t\nmercy\t from\t Him,\t so\t who\t will\t rescue\t me\t\nfrom\t Allah if\t I\t disobey\t Him?\t So\t you\t will\t\nnot\tincrease\tanything\tfor\tme,\texcept\tloss!”\t\n\t",
    "romanUrduTranslationText": "Bolā\taey\tmeri\t qaum!\tBhalā\t batāo\t to\tagar\t\nmaiñ\tapne\tRab\tki\ttaraf\t\tse\troshan\tdalil\tpar\t\nhooñ\taur\tus\tne\tmujhe\tapne\tpās\tse\tRaḥmat\t\t\t\t\nbakhshi\t to\t mujhe\t us\t se\t kaun\t bachāyega\t\nagar\tmaiñ\t us\t ki\t nā\tfarmāni\t karuñ\t to\t tum\t\nmujhe\tsiwā\tnuqsān\tke\tkuch\tna\tbadhāoge"
  },
  {
    "juz": {
      "id": "12"
    },
    "surah": {
      "id": "11"
    },
    "ayatNumber": "64",
    "arabicText": "وَيَـٰقَوْمِ هَـٰذِهِۦ نَاقَةُ ٱللَّهِ لَكُمْ ءَايَةًۭ فَذَرُوهَا تَأْكُلْ فِىٓ أَرْضِ ٱللَّهِ وَلَا تَمَسُّوهَا بِسُوٓءٍۢ فَيَأْخُذَكُمْ عَذَابٌۭ قَرِيبٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": ". “And\t O\tmy\t people!\t This\tis\t the\t she-camel\t\nof\tAllah - a\tsign\t for\tyou\t- so\tlet\ther\tgraze\t\nin\tAllah’s\tearth,\tand\tdo\tnot\ttouch\ther\twith\t\nan\t evil\t intention\t for\t an\t imminent\t\npunishment\twill\treach\tyou.”\t",
    "romanUrduTranslationText": "Aur\t aey\t meri\t qaum! Yeh\t Allāh\t ka\t nāqa\t\n(ooñtni)\thai\t\t tumhāre\tliye\tnishāni\t to\tisey\t\nchhod\tdo\t ke\tAllāh\t ki\tzameen\tmeiñ\t khāye\t\naur\tisey\tburi\ttarah\thāth\tna\tlagānā\tke\ttum\t\nko\tnazdik\t‘aƶāb\tpahuñche\tgā"
  }
]