[
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "271",
    "arabicText": "إِن تُبْدُوا۟ ٱلصَّدَقَـٰتِ فَنِعِمَّا هِىَ ۖ وَإِن تُخْفُوهَا وَتُؤْتُوهَا ٱلْفُقَرَآءَ فَهُوَ خَيْرٌۭ لَّكُمْ ۚ وَيُكَفِّرُ عَنكُم مِّن سَيِّـَٔاتِكُمْ ۗ وَٱللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "If\t you\t give\t charity\t openly,\t what\t an\t\nexcellent\t deed\t it\t is!\t And\t if\t you\t secretly\t\ngive\tit\t to\t the\t poor,\tit\tis\t the\t best\t for\t you;\t\nand\tit\twill\tredeem\tsome\tof\tyour\tsins;\tand\t\nAllah is\tAware\tof\tyour\tdeeds",
    "romanUrduTranslationText": "Agar\t khairāt\t do\t to\t woh\t kya\t hi\t achhi\t bāt\t\nhai\t aur\t agar\t chhupa\t kar\t faqeeron\t ko\t do\t\nyeh\t tumhāre\t liye\t sabse\t behtar\t hai\t aur\t is\t\nmeiñ\ttumhāre\tkuchh\tgunāh\tghateñ\tge\taur\t\nAllah\tko\ttumhāre\tkāmoñ\tki\tkhabar\thai\t."
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "272",
    "arabicText": "۞ لَّيْسَ عَلَيْكَ هُدَىٰهُمْ وَلَـٰكِنَّ ٱللَّهَ يَهْدِى مَن يَشَآءُ ۗ وَمَا تُنفِقُوا۟ مِنْ خَيْرٍۢ فَلِأَنفُسِكُمْ ۚ وَمَا تُنفِقُونَ إِلَّا ٱبْتِغَآءَ وَجْهِ ٱللَّهِ ۚ وَمَا تُنفِقُوا۟ مِنْ خَيْرٍۢ يُوَفَّ إِلَيْكُمْ وَأَنتُمْ لَا تُظْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "It\t is\t not\t your\t duty\t (O\t dear\t Prophet\t\nMuhammad - peace\tand\tblessings\tbe\tupon\t\nhim)\tto\tmake\t them\taccept\tguidance\t- but\t\nAllah guides\t whomever\t He\t wills;\t and\t\nwhatever\t good\t thing\t you\t spend\t is\t\nbeneficial\t for\t yourselves;\t and\t it\t is\t not\t\nright\t for\t you\t to\t spend\t except\t to\t seek\t\nAllah’s\tpleasure;\tand\twhatever\tyou\tspend\t\nwill\tbe\t repaid\t to\t you\tin\t full,\tand\t you\twill\t\nnot\tbe\twronged.\t-",
    "romanUrduTranslationText": "Unheiñ\t rāh\t dena\t tumhāre\t zimme\t lāzim\t\nnahi\thān\tAllah\trāh\tdeta\thai\tjise\tchāhta\thai\t\naur\t tum\t jo\t achhi\t chiz\t do\t to\t tumhāra\t hi\t\nbhala\t hai\t aur\t tumheiñ\t kharch\t Karna\t\nmunāsib\t nahi\t magar\t Allah\t ki\t marzi\t\nchhahne\t ke\t liye\t aur\t jo\t māl do\t tumheiñ\t\npoora\tmilega\taur\tnuqsān\tna\tdiye jāo\tge\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "273",
    "arabicText": "لِلْفُقَرَآءِ ٱلَّذِينَ أُحْصِرُوا۟ فِى سَبِيلِ ٱللَّهِ لَا يَسْتَطِيعُونَ ضَرْبًۭا فِى ٱلْأَرْضِ يَحْسَبُهُمُ ٱلْجَاهِلُ أَغْنِيَآءَ مِنَ ٱلتَّعَفُّفِ تَعْرِفُهُم بِسِيمَـٰهُمْ لَا يَسْـَٔلُونَ ٱلنَّاسَ إِلْحَافًۭا ۗ وَمَا تُنفِقُوا۟ مِنْ خَيْرٍۢ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٌ",
    "urduTranslationText": "",
    "englishTranslationText": "(Spend)\t For\t the\t poor\t who\t are\t restricted\t\nwhile\tin\tAllah's\t cause,\twho\t cannot\t travel\t\nin\t the\t land\t (for\t earning)\t - the\t unwise\t\nthink\t they\t are\t wealthy\t because\t of\t their\t\nrestraint;\tyou\twill\trecognise\tthem\tby\ttheir\t\nfaces;\t they\t do\t not\t seek\t from\t people\t in\t\norder\tto\tavoid\tgrovelling;\tand\tAllah knows\twhatever\tyou\tspend\tin\tcharity\t",
    "romanUrduTranslationText": "Un\t faqeeroñ\t ke\t liye\t jo\t rāh\t e\t khuda\t meiñ\t\nroke\tgaye\t zameen\tmeiñ\t chal\t nahiñ\t sakte\t nadān\t unheiñ\t tawangar\t samjhe\t bachne\t ke\t sabab\t to\t\nunheiñ\t unki\t soorat\t se\t pahchān\t lega\t logoñ\t se\t suāl\t nahi\t karte\t ke\t gid-didāna\t pade\t aur\t tum\t jo\t\nkhairāt\tkaro\tAllah\tusey\tjānta\thai\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "274",
    "arabicText": "ٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُم بِٱلَّيْلِ وَٱلنَّهَارِ سِرًّۭا وَعَلَانِيَةًۭ فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Those\twho\tspend\ttheir\twealth\tby\tnight\tand\tday,\tsecretly\tand\topenly\t- their\treward\tis\twith\ttheir\t\nLord;\tand\tthere\tshall\tbe\tno\tfear\tupon\tthem\tnor\tshall\tthey\tgrieve.\t",
    "romanUrduTranslationText": "Woh\tjo\tapne\tmāl\tkhairāt\tkarte\thaiñ\trāt\tmeiñ\taur\tdin\tmeiñ\tchupe\taur\tzāhir\tunke\tliye\tunka\tneg\t\n(Ajr)\thai\tunke\tRab\tke\tpās\tunko\tna\tkuchh\tandesha\tho\tna\tkuchh\tgham"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "275",
    "arabicText": "ٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُم بِٱلَّيْلِ وَٱلنَّهَارِ سِرًّۭا وَعَلَانِيَةًۭ فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ ٱلَّذِينَ يَأْكُلُونَ ٱلرِّبَوٰا۟ لَا يَقُومُونَ إِلَّا كَمَا يَقُومُ ٱلَّذِى يَتَخَبَّطُهُ ٱلشَّيْطَـٰنُ مِنَ ٱلْمَسِّ ۚ ذَٰلِكَ بِأَنَّهُمْ قَالُوٓا۟ إِنَّمَا ٱلْبَيْعُ مِثْلُ ٱلرِّبَوٰا۟ ۗ وَأَحَلَّ ٱللَّهُ ٱلْبَيْعَ وَحَرَّمَ ٱلرِّبَوٰا۟ ۚ فَمَن جَآءَهُۥ مَوْعِظَةٌۭ مِّن رَّبِّهِۦ فَٱنتَهَىٰ فَلَهُۥ مَا سَلَفَ وَأَمْرُهُۥٓ إِلَى ٱللَّهِ ۖ وَمَنْ عَادَ فَأُو۟لَـٰٓئِكَ أَصْحَـٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَـٰلِدُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Those\twho\tdevour\tusury\twill\tnot\tstand\tup\t\non\t the\t Day\t of\t Judgement,\t except\t like\t the\t\none\t whom\t an\t evil\t jinn\t has\t deranged\t by\t\nhis\t touch;\t that\t is\t because\t they\t said,\t\n“Trade\tis\talso\tlike\tusury!”;\twhereas\tAllah\nhas\t made\t trading\t lawful\t and\t forbidden\t\nusury;\t for\tone\t to whom\t the\tguidance\thas\t\ncome\t from\t his\t Lord,\t and\t he\t refrained\t\ntherefrom,\tis\tlawful\twhat\the\thas\t taken\tin\t\nthe\t past;\tand\t his\taffair\tis\twith\tAllah;\tand\t\nwhoever\t continues\tearning\tit\t henceforth,\t\nis\tof\tthe\tpeople\tof\tfire;\tthey\twill\tremain\tin\t\nit\tfor\tages",
    "romanUrduTranslationText": "Woh\tjo\tSood\tkhāte\thaiñ\tQiyamat\tke\tdin\tna\t\nkhade\t hoñge\t Magar\t Jaise\t khada\t hota\t hai\t\nwoh\tjise\tāseb\tne\tchoo\tkar\tmakhboot\tbana\t\ndiya\tho\tyeh\tis\tliye\tke\tunhoñ\tne\tkaha\tbae'\t\nbhi\tto\tSood\thi\tke\tmānind\thai\taur\tAllah\tne\t\nhalāl\t kiya\t bae'ko\taur\t harām\t kiya\tSood\t to\t\njise\t us\t ke\t Rab\t ke\t pās\t se\t nasihat\t āyi\t aur\t\nwoh\tbāz\traha\tto\tusey\thalāl\thai\tjo\tpahle\tle\t\nchuka\taur\tus\tka\tkām\tkhuda\tke\tsupurd\thai\t\naur\t jo\t ab\t aisi\t harkat\t karega\t to\t woh\t\ndozakhi\thai\twoh\tus\tmeiñ\tmuddatoñ\traheñ\t\nge"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "276",
    "arabicText": "يَمْحَقُ ٱللَّهُ ٱلرِّبَوٰا۟ وَيُرْبِى ٱلصَّدَقَـٰتِ ۗ وَٱللَّهُ لَا يُحِبُّ كُلَّ كَفَّارٍ أَثِيمٍ",
    "urduTranslationText": "",
    "englishTranslationText": "Allah destroys\t usury\t and\t increases\t\ncharity;\t and\t Allah does\t not\t like\t any\t\nungrateful,\texcessive\tsinner.\t",
    "romanUrduTranslationText": " Allah\thalāk\tkarta\thai\tSood\tko\taur\tbadhāta\t\nhai\t khairāt\t ko\t aur\t Allah\t ko\t pasand\t nahi\t\nāata\tkoi\tna-shukra\tbada\tgunehgār"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "277",
    "arabicText": "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ وَأَقَامُوا۟ ٱلصَّلَوٰةَ وَءَاتَوُا۟ ٱلزَّكَوٰةَ لَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "Indeed\t those\t who\t believed\t and\t did\t good\t\ndeeds\t and\t kept\t the\t prayer\t established\t\nand\tpaid\tthe\tcharity\t- their\treward\tis\twith\t\ntheir\tLord;\tand\tthere\tshall\tbe\tno\tfear\tupon\t\nthem\tnor\tshall\tthey\tgrieve.\t",
    "romanUrduTranslationText": ". Beshak\t woh\t jo\t Imān\t lāye\t aur\t achchhe\t\nkām\tkiye\taur\tnamāz\tqāyim\tki\taur\tzakāt\tdi\t\nunka\tneg (A’jr-o-Sawāb) unke\tRab\tke\tpās\t\nhai\t aur\t na\t unheiñ\t kuchh\t andesha\t ho\t na\t\nkuchh\tgham."
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "278",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱتَّقُوا۟ ٱللَّهَ وَذَرُوا۟ مَا بَقِىَ مِنَ ٱلرِّبَوٰٓا۟ إِن كُنتُم مُّؤْمِنِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "O\t People\t who\t Believe!\t Fear\t Allah and\t\nforego\t the\t remaining\t usury,\t if\t you\t are\t\nMuslims.\t\n",
    "romanUrduTranslationText": "Aey\t Imān\t wālo!\t Allah\t se\t daro\t aur\t chhod\t\ndo\t jo\t bāqi\t reh\t gaya\t hai\t Sood\t agar\t\nMusalman\tho\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "279",
    "arabicText": "فَإِن لَّمْ تَفْعَلُوا۟ فَأْذَنُوا۟ بِحَرْبٍۢ مِّنَ ٱللَّهِ وَرَسُولِهِۦ ۖ وَإِن تُبْتُمْ فَلَكُمْ رُءُوسُ أَمْوَٰلِكُمْ لَا تَظْلِمُونَ وَلَا تُظْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tif\tyou\tdo\tnot,\tthen\tbe\tcertain\tof\ta\twar\t\nwith\tAllah and\tHis\tNoble\tMessenger;\tand\t\nif\t you\t repent,\t take\t back\t your\t principal\t\namount;\tneither\tyou\tcause\tharm\tto\tsomeone,\tnor\tyou\tbe\tharmed.\t\t\n",
    "romanUrduTranslationText": ". Phir\tagar\taisa\tna\tkaro\tto\tyaqeen\tkarlo\tAllah\taur\tAllah\tke\tRasool\tse\tladāi\tka\taur\tagar\ttum\ttauba\t\nkaro\tto\tapna\tasl\tmāl\tle\tlo,\tna\ttum\tkisi\tko\tnuqsān\tpahoñchao\tna\ttumheiñ\tnuqsān\tho\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "280",
    "arabicText": "وَإِن كَانَ ذُو عُسْرَةٍۢ فَنَظِرَةٌ إِلَىٰ مَيْسَرَةٍۢ ۚ وَأَن تَصَدَّقُوا۟ خَيْرٌۭ لَّكُمْ ۖ إِن كُنتُمْ تَعْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": ". And\tif\t the\tdebtor\tis\tin\tdifficulty,\tgive\thim\trespite\t till\t the\t time\tof\tease;\tand\tyour\t foregoing\t the\t\nentire\tdebt\tfrom\thim\tis\tstill\tbetter\tfor\tyou,\tif\tonly\tyou\trealise.\t\n",
    "romanUrduTranslationText": "Aur\tagar\tqarz-dār\ttangi\twāla\thai\tto\tusey\tmohlat\tdo\tāsani\ttak\taur\tqarz\tus\tpar\tbilkul\tchhod\tdena\t\ntumhāre\tliye\taur\tbhala\thai\tagar\tjāno\t"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "281",
    "arabicText": "وَٱتَّقُوا۟ يَوْمًۭا تُرْجَعُونَ فِيهِ إِلَى ٱللَّهِ ۖ ثُمَّ تُوَفَّىٰ كُلُّ نَفْسٍۢ مَّا كَسَبَتْ وَهُمْ لَا يُظْلَمُونَ",
    "urduTranslationText": "",
    "englishTranslationText": "And\tfear\tthe\tday\tin\twhich\tyou\twill\tbe\treturned\tto\tAllah;\tand\tevery\tsoul\twill\tbe\tpaid\tback\tin\tfull\t\nwhat\tit\thad\tearned,\tand\tthey\twill\tnot\tbe\twronged.",
    "romanUrduTranslationText": "Aur\tdaro\tus\tdin\tse\tjis\tmeiñ\tAllah\tki\ttaraf\tphiroge\taur\thar\tjān\tko\tus\tki\tkamāi\tpoori\tbhar,\tdi\tjāyegi\t\naur\tun\tpar\tzulm na\thoga"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "282",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِذَا تَدَايَنتُم بِدَيْنٍ إِلَىٰٓ أَجَلٍۢ مُّسَمًّۭى فَٱكْتُبُوهُ ۚ وَلْيَكْتُب بَّيْنَكُمْ كَاتِبٌۢ بِٱلْعَدْلِ ۚ وَلَا يَأْبَ كَاتِبٌ أَن يَكْتُبَ كَمَا عَلَّمَهُ ٱللَّهُ ۚ فَلْيَكْتُبْ وَلْيُمْلِلِ ٱلَّذِى عَلَيْهِ ٱلْحَقُّ وَلْيَتَّقِ ٱللَّهَ رَبَّهُۥ وَلَا يَبْخَسْ مِنْهُ شَيْـًۭٔا ۚ فَإِن كَانَ ٱلَّذِى عَلَيْهِ ٱلْحَقُّ سَفِيهًا أَوْ ضَعِيفًا أَوْ لَا يَسْتَطِيعُ أَن يُمِلَّ هُوَ فَلْيُمْلِلْ وَلِيُّهُۥ بِٱلْعَدْلِ ۚ وَٱسْتَشْهِدُوا۟ شَهِيدَيْنِ مِن رِّجَالِكُمْ ۖ فَإِن لَّمْ يَكُونَا رَجُلَيْنِ فَرَجُلٌۭ وَٱمْرَأَتَانِ مِمَّن تَرْضَوْنَ مِنَ ٱلشُّهَدَآءِ أَن تَضِلَّ إِحْدَىٰهُمَا فَتُذَكِّرَ إِحْدَىٰهُمَا ٱلْأُخْرَىٰ ۚ وَلَا يَأْبَ ٱلشُّهَدَآءُ إِذَا مَا دُعُوا۟ ۚ وَلَا تَسْـَٔمُوٓا۟ أَن تَكْتُبُوهُ صَغِيرًا أَوْ كَبِيرًا إِلَىٰٓ أَجَلِهِۦ ۚ ذَٰلِكُمْ أَقْسَطُ عِندَ ٱللَّهِ وَأَقْوَمُ لِلشَّهَـٰدَةِ وَأَدْنَىٰٓ أَلَّا تَرْتَابُوٓا۟ ۖ إِلَّآ أَن تَكُونَ تِجَـٰرَةً حَاضِرَةًۭ تُدِيرُونَهَا بَيْنَكُمْ فَلَيْسَ عَلَيْكُمْ جُنَاحٌ أَلَّا تَكْتُبُوهَا ۗ وَأَشْهِدُوٓا۟ إِذَا تَبَايَعْتُمْ ۚ وَلَا يُضَآرَّ كَاتِبٌۭ وَلَا شَهِيدٌۭ ۚ وَإِن تَفْعَلُوا۟ فَإِنَّهُۥ فُسُوقٌۢ بِكُمْ ۗ وَٱتَّقُوا۟ ٱللَّهَ ۖ وَيُعَلِّمُكُمُ ٱللَّهُ ۗ وَٱللَّهُ بِكُلِّ شَىْءٍ عَلِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "O\t People\t who\t Believe!\t If\t you\t make\t an\t\nagreement\t for\t debt\t for\t a\t specified\t time,\t\nwrite\t it\t down;\t and\t appoint\t a\t scribe\t to\t\nwrite\t it\t for\t you\t with\t accuracy;\t and\t the\t\nscribe\t must\t not\t refuse\t to\t write\t in\t the\t\nmanner\tAllah has\t taught\thim,\tso\the\tmust\t\nwrite;\t and\t the\t liable\t person\t (debtor\t )\t\nshould\t dictate\t it\t to\t him\t and\t fear\t Allah,\t\nWho\tis\this\tLord,\tand\tnot\thide\tanything\tof\t\nthe\t truth;\t but\t if\t the\t debtor\t is\t of\t poor\t\nreasoning,\t or\t weak,\t or\t unable\t to\t dictate,\t\nthen\t his\t guardian\t must\t dictate\t with\t\njustice;\t and\t appoint\t two\t witnesses\t from\t\nyour\t men;\t then\t if\t two\t men\t are\t not\t\navailable,\t one\tman\tand\t two\twomen\t from\t\nthose\t you\t would\t prefer\t to\t be\t witnesses,\t\nso\t that\t if\t one\t of\t them\t forgets,\t the\t other\t\ncan\t remind\t her;\t and\t the\t witnesses\t must\t\nnot\trefuse\twhen\tcalled\tupon\tto\ttestify;\tdo\t\nnot\tfeel\tburdened\tto\twrite\tit,\twhether\tthe\t\ntransaction\tis\tsmall\tor\tbig\t- write\tit\tfor\tup\t\nto\t its\t term’s\t end;\t this\t is\t closer\t to\t justice\t\nbefore\tAllah and\twill\tbe\ta\tstrong\tevidence\t\nand\t more\t convenient\t to\t dispel\t doubts\t\namongst\tyourselves\t- except\twhen\tit\tis\tan\t\ninstant\ttrade\tin\twhich\texchange\tis\tcarried\t\nout\timmediately,\t there\tis\tno\tsin\ton\tyou\tif\t\nit\tis\tnot\twritten\tdown;\tand\ttake\twitnesses\t\nwhenever\tyou\tperform\ttrade;\tand\tneither\tthe\tscribe\tnor\tthe\twitnesses\tbe\tcaused\tany\tharm\t(or\t\nthey\tcause\tany\tharm);\tand\tif\t you\tdo,\tit\twould\tbe\tan\toffence\ton\t your\tpart;\tand\t fear\tAllah;\tand\t\nAllah teaches\tyou;\tand\tAllah knows\teverything.\t",
    "romanUrduTranslationText": "Aey\t Imān\t wālo!\t jab\t tum\t ek\t muqarrar\t\nmuddat\t tak\t kisi\t dain\t ka\t len\t den\t karo\t to\t\nusey\t likh\t lo\t aur\t chāhiye\t ke\t tumhāre\t\ndarmiyān\t koi\t likhne\t wāla\t theek\t theek\t\nlikhe\t aur\t likhne\t wāla\t likhne\t se\t inkār\t na\t\nkare\tjaisa\t ki\t usey\tAllah\t ne\t sikhāya\t hai\t to\t\nusey\tlikh\tdena\tchāhiye\tjis\tpar\thaq\tāta\thai\t\nwoh\tlikhāta\tjaye\taur\tAllah\tse\tdare\tjo\tuska\t\nrab\t hai\t aur\t haq\t me\t se\t kuchh\t rakh\t na\t\nchhode\tphir\tjis\tpar\thaq\tāta\thai\tagar\tbe\taql\t\nya\t na-tawāñ\t ho\t ya\t likha\t na\t sake\t to\t uska\t\nwali\t insāf\t se\t likhāye\t aur\t do\t gawāh\t karlo\t\napne\tmardoñ\tmeiñ\t se\t phir\t agar\t do\tmard\t\nna\t hoñ\t to\t ek\t mard\t aur\t do\t auratein,\t aise\t\ngawāh\t jin\t ko\t pasand\t karo\t ke\t kahiñ\t\nunmeiñ ek\t aurat\t bhoole\t to\t doosri\t yād\t\ndilāye\t aur\t gawāh\t jab\t bulāye\t to\t jāyeñ\t to\t\nāne\t se\t inkār\t na\t kareiñ\t aur\t isey\t bhāri\t na\t\njāno\t ke\t dain\t chhota\t ho\t ya\t bada\t is\t ki\t\nmee'ād\ttak\tlikhat\tkarlo\tyeh\tAllah\tke\tnazdeek\tziyāda\tinsāf\tki\tbāt\thai\taur\tis\tmeiñ\tgawāhi\tkhoob\t\ntheek\trahegi\taur\tyeh\tis\tse\tqareeb\thai\tke\ttumheiñ\tshubah\tna\tpade\tmagar\tyeh\tke koi\tSar-e-Dast\t\nka\t sauda\tdast\t badast\tho\t to\tus\t ke\tna\tlikhne\t ka\t tum\tpar\tgunah\tnahi\taur\tjab\t khareed\t o\t farokht\t\nkaro\tto\tgawah\tkarlo\taur\tna\tkisi\tlikhne\twāle\tko\tzarar\tdiya\tjāye\tna\tgawah\tko\t(ya\tna\tlikhne\twāla\t\nzarar\t de\t na\t gawah)\t aur\t jo\t aisa\t karo\t to\t yeh\t tumhāra\t fisq hoga\t aur\t Allah\t se\t daro\t aur\t Allah\t\ntumheiñ\tsikhata\thai\taur\tAllah\tsab\tkuchh\tjānta\thai"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "283",
    "arabicText": "۞ وَإِن كُنتُمْ عَلَىٰ سَفَرٍۢ وَلَمْ تَجِدُوا۟ كَاتِبًۭا فَرِهَـٰنٌۭ مَّقْبُوضَةٌۭ ۖ فَإِنْ أَمِنَ بَعْضُكُم بَعْضًۭا فَلْيُؤَدِّ ٱلَّذِى ٱؤْتُمِنَ أَمَـٰنَتَهُۥ وَلْيَتَّقِ ٱللَّهَ رَبَّهُۥ ۗ وَلَا تَكْتُمُوا۟ ٱلشَّهَـٰدَةَ ۚ وَمَن يَكْتُمْهَا فَإِنَّهُۥٓ ءَاثِمٌۭ قَلْبُهُۥ ۗ وَٱللَّهُ بِمَا تَعْمَلُونَ عَلِيمٌۭ",
    "urduTranslationText": "",
    "englishTranslationText": "And\t if\t you\t are\t on\t a\t journey\t and\t cannot\t\nfind\t a\t scribe,\t then\t a\t mortgage\t (deposit)\t\nmust\t be\t handed\t over;\t and\t if\t one\t of\t you\t\ntrusts\t the\t other,\t the\t one\t who\t is\t trusted\t\nmay\t return\t the\t mortgage\t entrusted\t to\t\nhim\t and\t fear\tAllah,\t his\t Lord;\t and\t do\t not\t\nhide\t testimony;\t and\t if\t one\t hides\t it,\t his\t\nheart\t is\t sinful\t from\t within;\t and\t Allah\nknows\twhat\tyou\tdo\t",
    "romanUrduTranslationText": "Aur\t agar\t tum\t safar\t mein\t ho\t aur\t likhne\t\nwāla\t na\t pāo\t to\t girav ho\t qabze\tmeiñ\t diya\t\nhua\t aur\t agar\t tum\tmeiñ\t ek\t ko\t doosre\t par\t\nitminān\t ho\t to\t woh\t jise\t us\t ne\t ameen\t\nsamajha\t tha\t apni\t amanat\t ada\t kare\t aur\t\nAllah\tse\tdaro\tjo\tus\tka\trab\thai.\taur\tgawāhi\t\nna\t chupao\t aur\t jo\t gawāhi\t chupāye\t ga\t to\t\nandar\tse\tus\tka\tdil\tgunehgār\thai\taur\tAllah\t\ntumhāre\tkāmoñ\tko\tjānta\thai"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "284",
    "arabicText": "لِّلَّهِ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۗ وَإِن تُبْدُوا۟ مَا فِىٓ أَنفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُم بِهِ ٱللَّهُ ۖ فَيَغْفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُ ۗ وَٱللَّهُ عَلَىٰ كُلِّ شَىْءٍۢ قَدِيرٌ",
    "urduTranslationText": "",
    "englishTranslationText": "To\t Allah only\t belongs\t all\t whatever\t is\t in\t\nthe\t heavens\t and\t all\t whatever\t is\t in\t the\t\nearth;\tand\twhether\tyou\tdisclose\twhat\tis\tin\t\nyour\t hearts\t or\t hide\t it,\t Allah will\t take\t\naccount\tof\tit\t from\tyou;\tso\tHe\twill\t forgive\t\nwhomever\tHe\twills\tand\tpunish\twhomever\t\nHe\twills;\tand\tAllah is\tAble\tto\tdo\tall\tthings.\t\t",
    "romanUrduTranslationText": "Allah\thi\tka\thai\tjo\tkuch\tāsmanoñ\tmeiñ\thai\t\naur\tjo\tkuch\tzameen\tmeiñ\thai\taur\tagar tum\nzāhir\tkaro\tjo\tkuch\ttumhāre\tji\tmeiñ\thai\tya\t\nchupao\t Allah\t tum\t se\t us\t ka\t hisāb\t lega\t to\t\njise\t chāhe\t ga bakshe\t ga\t aur\t jise\t chahega\nsaza\t dega\t aur\t Allah\t har\t cheez\t par\t Qadir\t\nhai"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "285",
    "arabicText": "ءَامَنَ ٱلرَّسُولُ بِمَآ أُنزِلَ إِلَيْهِ مِن رَّبِّهِۦ وَٱلْمُؤْمِنُونَ ۚ كُلٌّ ءَامَنَ بِٱللَّهِ وَمَلَـٰٓئِكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ لَا نُفَرِّقُ بَيْنَ أَحَدٍۢ مِّن رُّسُلِهِۦ ۚ وَقَالُوا۟ سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ ٱلْمَصِيرُ",
    "urduTranslationText": "",
    "englishTranslationText": "The\tNoble\tMessenger\tbelieves\tin\twhat\thas\t\nbeen\tsent\tdown\tto\thim\tby\this\tLord,\tand\tso\t\ndo\tthe\tbelievers;\tall\thave\taccepted\tfaith\tin\t\nAllah and\t His\t angels\t and\t His\t Books\t and\t\nHis\tNoble\tMessengers;\tsaying,\t“We\tdo\tnot\t\nmake\t any distinction,\t in\t believing,\t\nbetween\t any\t of\t His\t Noble\t Messengers”;\t\nand\t they\t said,\t “We\t hear,\t and\t we\t obey;\t\nYour\t forgiveness\t be\t granted,\tO\t our\t Lord,\t\nand\ttowards\tYou\tis\tour\treturn.”\t",
    "romanUrduTranslationText": "Rasool\t Imān\t lāya\t us\t par\t jo\t us\t ke\t rab\t ke\t\npās\t se\t us\t par\t utra\t aur\t Imān\t wale\t sabne\t\nmāna\t Allah\t aur\t uske\t Farishton\t aur\t uski\t\nKitabon\t aur\t uske\t Rasooloñ\t ko\t ye\t kahte\t\nhuye\t ki,\t ham\t uske\t kisi\t Rasool\t par\t iman\t\nlāne\tme\tfarq\tnahi\tkarte\thain\taur\tarz ki\tke\t\nham\tne\tSuna\taur\tmāna\tteri\tmu'āfi\t\tho\taye\t\nRab\thamare!\taur\tteri\thi\ttaraf\tphirna\thai,"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "2"
    },
    "ayatNumber": "286",
    "arabicText": "لَا يُكَلِّفُ ٱللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا ٱكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَآ إِن نَّسِينَآ أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَآ إِصْرًۭا كَمَا حَمَلْتَهُۥ عَلَى ٱلَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِۦ ۖ وَٱعْفُ عَنَّا وَٱغْفِرْ لَنَا وَٱرْحَمْنَآ ۚ أَنتَ مَوْلَىٰنَا فَٱنصُرْنَا عَلَى ٱلْقَوْمِ ٱلْكَـٰفِرِينَ",
    "urduTranslationText": "",
    "englishTranslationText": "Allah does\t not\t burden\t any\t soul,\t except\t\nwith\tsomething\twithin\tits\tcapacity;\tbeneficial\tfor\tit\tis\tthe\tvirtue\tit\tearned,\tand\tharmful\tfor\tit\tis\t\nthe\tevil\tit\tearned;\t“Our\tLord!\tDo\tnot\tseize\tus\tif\twe\tforget\tor\tare\tmistaken;\tour\tLord!\tAnd\tdo\tnot\t\nplace\ton\tus\ta\theavy\tburden\t(responsibility)\tas\tYou\tdid\ton\tthose\tbefore\tus;\tour\tLord!\tAnd\tdo\tnot\t\nimpose\ton\tus\ta\tburden,\tfor\twhich\twe\tdo\tnot\thave\tthe\tstrength;\tand\tpardon\tus\t- and\tforgive\tus\t-\nand\thave\tmercy\ton\tus\t- You\tare\tour\tMaster,\ttherefore\thelp\tus\tagainst\tthe\tdisbelievers.”\t\t",
    "romanUrduTranslationText": "Allah\tkisi\tjān\tpar\tbojh\tnahi\tdālta\tmagar\tus\tki\ttāqat\tbhar\tus\tka\tfāyeda\thai\tjo\tachcha\tkamāya\taur\t\nus\t ka\t nuqsān\t hai\t jo\t burāi\t kamāi\t aey\t Rab\t hamāre!\t hameiñ\t na\t pakad\tmagar hum\t bhooleiñ\t ya\t\nchookeiñ\taey\tRab\thamāre!\tAur\tham\tpar\tbhāri\tbojh\tna\trakh\tjaisa\ttu\tne\thum\tse\tagloñ\tpar\trakha\t\ntha\taey\tRab\thamāre!\tAur\tham\tpar\twoh\tbojh\tna\tdāl\tjis\tki\thameiñ\tsahār (Tāqat) na\tho\taur\thameiñ\t\nmu'āf\tfarma\tde\taur\tbakhsh\tde\taur\thum\tpar\tmehar\t(Rahem)\tkar\ttu\thamāra\tmaula\thai\ttu\tkāfiroñ\t\npar\thameiñ\tmadad\tde."
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "1",
    "arabicText": "مُالٓمٓ",
    "urduTranslationText": "",
    "englishTranslationText": "Alif-Laam-Meem.",
    "romanUrduTranslationText": "Alif-laam-meem"
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "2",
    "arabicText": "ٱللَّهُ لَآ إِلَـٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ",
    "urduTranslationText": "",
    "englishTranslationText": "Allah - none is worthy of worship, except Him, He is Alive (eternally, on His own) and the Upholder (keeps others established).",
    "romanUrduTranslationText": "Allah hai jis ke siwa kisi ki pooja nahi āap zinda auroñ ka qāim rakhne wāla."
  },
  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "3",
    "arabicText": "مِنَزَّلَ عَلَيْكَ ٱلْكِتَـٰبَ بِٱلْحَقِّ مُصَدِّقًۭا لِّمَا بَيْنَ يَدَيْهِ وَأَنزَلَ ٱلتَّوْرَىٰةَ وَٱلْإِنجِيلَ",
    "urduTranslationText": "",
    "englishTranslationText": "He has sent down to you (O dear Prophet Muhammad - peace and blessings be upon him) this true Book (the Holy Qur’an), confirming the Books before it, and He sent down the Taurat (Torah) and the Injeel (Bible).",
    "romanUrduTranslationText": "Us ne tum par ye sachchi Kitāb utāri agli Kitāboñ ki tasdeeq farmāti aur us ne is se pehle Tauret aur Injeel utāri."
  },

  {
    "juz": {
      "id": "3"
    },
    "surah": {
      "id": "3"
    },
    "ayatNumber": "4",
    "arabicText": "مِن قَبْلُ هُدًۭى لِّلنَّاسِ وَأَنزَلَ ٱلْفُرْقَانَ ۗ إِنَّ ٱلَّذِينَ كَفَرُوا۟ بِـَٔايَـٰتِ ٱللَّهِ لَهُمْ عَذَابٌۭ شَدِيدٌۭ ۗ وَٱللَّهُ عَزِيزٌۭ ذُو ٱنتِقَامٍ",
    "urduTranslationText": "",
    "englishTranslationText": "Before\t this,\t a\t guidance\t to\t mankind;\t and\t sent\t\ndown\tthe\tJudgement\t(Criterion\tto\tjudge\tbetween\t\nright\t and\t wrong);\t indeed\t for\t those\t who\t\ndisbelieved\t in\t the\t verses\t of\t Allah,\t is\t a\t severe\t\npunishment;\t and\t Allah is\t the\t Almighty,\t the\t\nAvenger\t(of\tthe\twrong).\t\t",
    "romanUrduTranslationText": ". Logoñ\t ko\t rāh\t dikhāti\t aur\t faisla\t utāra,\t\nbeshak\twoh\tjo\tAllah\tki\tāayatoñ\tse\tmunkir\t\nhuwe\tun\tke\tliye\tsakht\t‘azāb\thai\taur\tAllah\t\nghalib\tbadla\tlene\twāla\thai,"
  }
]
